{
    "limitactivelogins": {
        "name": "limitactivelogins",
        "real_name": "11111111111111111111111111Limit Active Logins",
        "product_type": "free_and_pro",
        "description": "22222222222222222222222222222By default on a Joomla website, the Users can sign in using one account from unlimited devices\/browsers at a time. This is not good for websites that have restricted content for subscribers. With this plugin, you can easily set a limit for the number of active logins that a user can have.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Set maximum no. of active logins for a User.<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Block new logins when the login limit is reached.<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Allow new logins while logging out from other devices when the limit is reached.<\/li>\r\n\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Signed-in devices. The User is able to see the devices that he is already logged in from different browsers and devices (desktop, laptop, mobile devices, etc.).<\/li>\r\n\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Logout from other device(s). The User can sign out from any other device(s) that he has already logged in, and the session is still active.<\/li>\r\n\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Customizable Maximum Active Logins. For example, a User from Asia can login from 5 devices, but a User from Europe only from two devices.<\/li>\r\n\r\n<\/ul>\r\n\r\n<h3 class=\"uk-h2 uk-text-center\">Benefits<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n\r\n<ul class=\"uk-list uk-list-striped\">\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Useful for membership sites.<\/li>\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Prevent Users from sharing their account.<\/li>\r\n<\/ul>\r\n<p>Important Notice: Even if the User is closing the browser without logging out, their login session exists for period of time. So this will also considered as an active login.<\/p>\r\n<!-- END: Features -->",
        "stable_version": "66.0.0",
        "beta_version": "77.0.1",
        "changelog": "ssssssssssssssss+ Added   ! Removed   ^ Changed   # Fixed\r\n\t\t\r\n26-Jan-2021 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2021-01-26",
        "extension_type": "Component",
        "live_demo_url": "1111111111111https:\/\/limitactivelogins.web357.com\/",
        "more_info_url": "222222222222https:\/\/www.web357.com\/product\/limit-active-logins-for-joomla",
        "documentation_url": "33333333333https:\/\/docs.web357.com\/category\/70-limit-active-logins",
        "changelog_url": "444444444444444https:\/\/www.web357.com\/product\/limit-active-logins-for-joomla#changelog",
        "support_url": "5555555555555555https:\/\/www.web357.com\/support",
        "jed_url": "6666666666666666666https:\/\/extensions.joomla.org\/?the-limit-active-logins-joomla-extension-will-be-available-soon-in-JED",
        "backend_settings_url": "7777777777777777.\/index.php?option=com_config&view=component&component=com_limitactivelogins"
    },
    "web357framework": {
        "name": "web357framework",
        "real_name": "Web357 Framework",
        "product_type": "free",
        "description": "The Web357 Framework Joomla! plugin is a required helper tool that is used by all the Web357 extensions. Within the plugin files, we have included code and PHP functions that allow the plugin updates to be applied only in one place, i.e. the plugin itself, and ensure that they are rolled out automatically to any external site that is using the Web357 applications and plugins.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Some functions that are used often<\/h3>\r\n<hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li>\r\n    <i class=\"uk-icon-thumbs-o-up\"><\/i>\r\n    <strong>getCountry() :<\/strong> Detects the Country of a User. This function is based on geoplugin.net.\r\n    <br>\r\n  <\/li>\r\n  <li>\r\n    <i class=\"uk-icon-thumbs-o-up\"><\/i>\r\n    <strong>getOS() :<\/strong> Detects the Operating System of a User (e.g. Windows, Linux, Android, iOS\/OS, etc.).\r\n    <br>\r\n  <\/li>\r\n  <li>\r\n    <i class=\"uk-icon-thumbs-o-up\"><\/i>\r\n    <strong>getBrowser() :<\/strong> Detects the Browser of a User (e.g. Firefox, Google Chrome, Safari, Opera, Internet Explorer\r\n    etc.).<\/li>\r\n<\/ul>\r\n<!-- END: Features -->",
        "stable_version": "1.8.2",
        "beta_version": "",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n19-Jan-2021 : v1.8.2\r\n+ [New Extension] Compatible with the first beta release of the Limit Active Logins Joomla! extension.\r\n^ Improve campaign data attributes on logo URL (e.g. \/\/www.web357.com\/?utm_source=CLIENT&utm_medium=CLIENT-ProLink-Backend-Footer-Web357-logo)\r\n# [Improvement] Improve the description of asking about the Web357 License key. The link to find the API key has been replaced with the correct one.\r\n# [Improvement] Search for System - Web357 Framework, instead of Web357 Framework after clicking on the link \"Enter the API key in plugin settings\".\r\n# [Improvement] Show the parameter screenshot also in the disabled parameters (Only in PRO version).\r\n# [Bug Fixed] Use the correct product link at Joomla! backend footer, when the free version is installed.\r\n# [Bug Fixed] PHP Fatal Error: Class 'VersionChecker' not found.\r\n# [Bug Fixed] Do not show the apikeychecker warning to non logged in admins\r\n# [Bug Fixed] Do not show the Web357 Api key checker warning message to non-logged-in Admins.\r\n# [Bug Fixed] Warning: preg_match(): Compilation failed: unmatched closing parenthesis at offset 38 in web357framework.class.php\r\n\r\n01-Dec-2020 : v1.8.1\r\n# [Bug Fixed] Api key validation in Web357 Framework plugin \"SSL certificate problem: unable to get local issuer certificate\". [Thank you, Thomas Thrane]\r\n^ [Improvement] If the beta version is installed, show a successful notification message that the version is up-to-date.\r\n^ [Improvement] Remove JLogs - Code Cleanup\r\n\r\n23-Nov-2020 : v1.8.0\r\n+ Compatible with the Web357 Licenses Key Manager (https:\/\/bit.ly\/web357-license-key-manager)\r\n+ Joomla! 4 compatible\r\n# [Bug Fixed] CSS file is missed at Joomla! backend, if you navigate in menu item settings of any Web357 component (com_monthlyarchive or com_vmsales).\r\n^ [Improvement] The notification message about the API key link has been changed. You can find the API key in the Downloads section, at web357.com [Thank you, Sondra Boone]\r\n# [Bug Fixed] Blank page in VM Sales settings after upgrade to the VirtueMart version v3.6.2. [Thank you, Rossiniy Gamberea]\r\n# Bug fixes and improvements.\r\n\r\n10-Jun-2019 : v1.7.7\r\n# [Bug Fixed] CSS file has been missed at the Joomla! backend, if you navigate the settings of any Web357 component.\r\n# [Improvement] Some links have been changed (extension page, demo, documentation, support, etc.).\r\n\r\n10-Apr-2019 : v1.7.6\r\n# [Bug Fixed] Fix product image path in the tab \"About Extension\", in extension parameters.\r\n^ [Improvement] Load the jQuery library only when needed. at Joomla! backend.\r\n^ [Improvement] Minified versions of Javascript and CSS files, at Joomla! backend.\r\n\r\n15-Feb-2019 : v1.7.5\r\n+ [Improvement] Move all assets to media\/ folder at Joomla! root.\r\n# [Bug Fixed] JLoader::registerNamespace (only in Joomla! 2.5.x )\r\n\r\n16-Jan-2019 : v1.7.4\r\n# [Bug Fixed] Error after trying to get the latest version from Web357 Api. (Error Code: 0 Operation timed out after X milliseconds with 0 out of 0 bytes received.) [Thank you, Max Morriconi]\r\n\r\n15-Jan-2019 : v1.7.3\r\n# [Bug Fixed] A conflict issue with the 3rd party extension \"Podcast Manager\" has been resolved. [Many thanks to Carlos Cámara]\r\n# [Bug Fixed] Error Code: 0. SSL: no alternative certificate subject name matches the target hostname 'cdn.web357.com'. The file: https:\/\/cdn.web357.com\/web357-releases.json does not exist. The method to take the latest version has been changed. Now we use the Web357 API, instead of downloading the JSON file with all extensions data each time. [Thank you, Claudia Schmid]\r\n! [Removed] The modal behavior JHtml::_('behavior.modal'); has been removed at the backend.\r\n\r\n07-Dec-2018 : v1.7.2\r\n# [Bug Fixed] An HTTPS error occurred after updating any extension. Update path does not exist. Error updating COM_INSTALLER_TYPE_TYPE_.\r\n# [Bug Fixed] Fix issues with Matukio Events Joomla! Component. The error occurs at Backend > Components > Matukio Events> Default Booking Form. It just will not load if the Web357 framework is active. [Thank you, Walter Fleritsch]\r\n# [Bug Fixed] Some javascript issues at the back-end with the Gantry5 of RocketTheme, and the T3 BS3 Blank Template of Joomlart have been resolved successfully (Switching the \"Theme Outlines\" does not work) [Many thanks to Thomas Thrane, Michael Kastl, and Marcin Nader]\r\n# Minor bug fixes\r\n\r\n02-Nov-2018 : v1.7.1\r\n+ Add global elements for general use in Virtuemart extensions (the files \"vmcategories.php\" and \"vmmanufacturers.php\" have been added).\r\n^ Change json's file path about extensions' information.\r\n! Some unnecessary code in the \"profeature.php\" file has been removed.\r\n# Minor bug fixes.\r\n\r\n09-Aug-2018 : v1.7.0\r\n+ Fully compatible with Joomla! 4.x\r\n^ CSS improvements for parameter fields with screenshots, like the Cookies Notification Bar plugin and the Support Hours module.\r\n# [BUG Fixed] The backend_settings_url variable has been corrected for J! 2.5\r\n# Minor bug fixes.\r\n\r\n23-Jul-2018 : v1.6.4\r\n# [Bug Fixed] Error 500 The file: http:\/\/cdn.web357.com\/web357-releases.json does not exist. All HTTP URLs have been replaced with HTPS. (502 Bad Gateway nginx). [Thank you, Ea]\r\n# [Improvement] An SQL query added to update the old update urls (web357.eu > web357.com) from the table #__update_sites\r\n\r\n14-Jul-2018 : v1.6.3\r\n# [Bug Fixed] Error: 500 String could not be parsed as XML. (Affects the Cookies Policy Notification Bar - Joomla! Plugin)\r\n^ [Improvements] New parameter fields for the Cookie Manager functionality of the Cookies Policy Notification Bar - Joomla! Plugin.\r\n^ [Improvements] New helper CSS classes for the screenshots in the plugin parameters of the Cookies Policy Notification Bar - Joomla! Plugin.\r\n\r\n28-Jun-2018 : v1.6.2\r\n# [Improvement] Load the Web357 product images from Web357's CDN to decrease the size of the zip file.\r\n! [Deleted] Some elements have been deleted because are not used anymore in our extensions.\r\n^ [Improvement] The date format inside the XML has been changed. Now is displayed like this \"DD MMM YYYY\", instead of this \"YYYY-MM-DD\".\r\n\r\n17-Jun-2018 : v1.6.1\r\n# [Improvement] New method to get the latest version. Fixes some errors after an extension installation on some servers with strong firewalls.\r\n\r\n16-Mar-2018 : v1.6.0\r\n+ Web357 API Key: One single API Key for each Web357 Subscriber who has one or more active subscriptions at Web357.com. In order to update commercial Web357 extensions, enter your API Key in the Web357 Framework plugin settings. The key can be found in your Web357 account.\r\n! The Web357 Download ID parameter field has been deleted from each extension settings and has been replaced by a unique API key parameter field at the Web357 Framework plugin settings.\r\n^ Functions improved: The getOS() and the getBrowser() functions have been updated to get the most recent Operating Systems and Browsers.\r\n^ The Web357 Instagram and Youtube links have been added to the About Web357 tab info in extension settings.\r\n+ A new button (Settings) has been added to the description tab for each Web357 component and plugin.\r\n# Demo and JED links have been updated.\r\n# Minor bug fixes.\r\n# Code cleanup.\r\n\r\n28-Feb-2018 : v1.5.2\r\n# BUG FIXED: Compatibility issues with older versions of Virtuemart have been resolved \"\\plugins\\system\\web357framework\\elements\\vmcategoriesp.php\". [Many thanks to Andrea Riquelme]\r\n+ NEW FIELD: A clock-style time picker has been added as a new element parameter field. For now, is used in the first beta version of Event Schedule Joomla! Component and Module.\r\n\r\n03-Jan-2018 : v1.5.1\r\nBUG Fixed: The tab \"COM_PLUGINS_TEXTS_FOR_LANGUAGES_FIELDSETS_LABEL\" has been appeared on many previously installed plugins, because of a small issue in web357framework system plugin. [Many thanks to Arte Ferro srl]\r\n\r\n29-Dec-2017 : v1.5.0\r\n# BUG FIXED: There were some backward compatibility issues with older versions of Joomla! (e.g. v3.6.5), mostly for the Cookies Policy Notification Bar plugin. The input text fields for the languages are missing. [Many thanks to Xenofon Kaloudis]\r\n\r\n15-Dec-2017 : v1.4.9\r\n+ We've added some helper functions for the Login as User Joomla! extension.\r\n\r\n13-Nov-2017 : v1.4.8\r\n# Bug Fixed: Some language strings are missing.\r\n\r\n07-Nov-2017 : v1.4.7\r\n# Bug Fixed: An error message has been displayed after trying update to the latest update v1.4.6 of Web357 Framework. The error message is \"Could not open update \"Web357 Framework (FREEPRO version)\". [Thank you, Mauro]\r\n\r\n06-Nov-2017 : v1.4.6\r\n+ We've added some helper functions, like the \"onContentPrepareForm\", for the Cookies Policy Notification Bar Joomla! system plugin, to allow saving language strings even if the plugin is disabled.\r\n\r\n05-Jul-2017 : v1.4.5\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n02-Jun-2017 : v1.4.4\r\n# Bug Fixed: The modal popup to display the screenshots inside the extension parameters (e.g. in supporthours module), at Joomla backend does not work.\r\n\r\n12-May-2017 : v1.4.3\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n# Minor bug fixes.\r\n\r\n06-May-2017 : v1.4.2\r\n# BUG Fixed: The k2categories element has been improved to avoid errors in PHP7+\r\n\r\n21-Apr-2017 : v1.4.1\r\n# Fatal PHP errors in Monthly Archive after the upgrade to Web357 Framework v1.4.0 have been resolved. [Thank you, Wim]\r\n\r\n20-Apr-2017 : v1.4.0\r\n+ A new form field element has been added to check if an extension is installed or enabled. This is useful for Monthly Archive component to detect whether the com_k2 extension is active or not, so to retrieve the content from there.\r\n# Minor bug fixes\r\n\r\n04-Oct-2016 : v1.3.9\r\n+ CSS Improvement: The \"w357_xsmall_header\" class has been added for styling purposes of the extra small headers at the extension parameters.\r\n\r\n02-Sep-2016 : v1.3.8\r\n# BUG FIXED: Some PHP Notices in the file \"web357framework.class.php\", in line 128, have been resolved. [Thank you, Guillaume]\r\n\r\n30-May-2016 : v1.3.7\r\n# BUG Fixed: If user's operating system is not in our popular operating systems list,  some PHP warnings have displayed in server's error log files. [Thank you, Guillaume]\r\n\r\n25-Apr-2016 : v1.3.6\r\n# Some issues (blank page and template crashed, mostly) in extension's configuration\/parameters that still use Joomla! 3.3.x, have been resolved.\r\n# Minor bug fixes.\r\n\r\n31-Mar-2016 : v1.3.5\r\n+ The header element now supports CSS classes.\r\n+ A link has been added to the \"version checker\" parameter field. It will redirect you to the update manager to get the latest version of an extension.\r\n^ The URL of changelog will redirect you at web357.com, instead of displaying a modal popup window.\r\n^ The language file has been updated.\r\n# CSS minor fixes.\r\n# General bug fixes.\r\n\r\n08-Dec-2015 : v1.3.4\r\n# Minor bug fixes after the latest upgrade from v1.3.3\r\n\r\n07-Dec-2015 : v1.3.3\r\n^ Updated description.\r\n^ Updated translations.\r\n\r\n24-Nov-2015 : v1.3.2\r\n# jQuery Issues with View Changelog modal popup, have been resolved.\r\n^ The loading at the back-end has been improved by replacing external social scripts (facebook, twitter, google+), with social icons. There are no scripts anymore, just images.\r\n^ The file \"elements_helper.php\" is required also for the about.php element, for the CSS styling of social icons.\r\n\r\n23-Nov-2015 : v1.3.1\r\n^ Improvement of \"K2 Categories\" element.\r\n# Minor bug fixes.\r\n\r\n13-Nov-2015 : v1.3.0\r\n# Bug Fixed: Now you can update more than one Web357 extensions at once.\r\n# Minor bug fixes.\r\n\r\n29-Oct-2015 : v1.2.3\r\n# BUG Fixed: The Customizer of Yootheme templates does not work properly if the Web357 Framework is enabled.\r\n^ Clean up some code.\r\n\r\n14-Oct-2015 : v1.2.2\r\n+ Web357 framework works as an installer for all extensions, instead of installing packages.\r\n\r\n11-Oct-2015 : v1.2.1\r\n+ K2categories element has been added.\r\n\r\n24-Aug-2015 : v1.2.0\r\n# Bug Fixed: Some issues and jQuery conflicts with JoomGallery component, have been resolved.\r\n# Minor bug fixes.\r\n\r\n02-Jun-2015 : v1.1.0\r\n+ 2 new elements added.\r\n+ Link for the pro version has been edited.\r\n# Problem with language files. Renamed to filename-BKP.ini after installing the framework.\r\n# BUG Fixed: If \"php_curl\" is not enabled in PHP, the parameters cannot be displayed in administration panel.\r\n# BUG Fixed: If \"allow_url_fopen\" is not enabled in PHP, the parameters cannot be displayed in administration panel.\r\n# BUG Fixed: Some issues for Windows servers 2008 and 500 errors have been resolved.\r\n\r\n25-Apr-2015 : v1.0.1\r\n# Bug fixed: Problem with version checker.\r\n\r\n23-Apr-2015 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2021-01-19",
        "extension_type": "Plugin",
        "live_demo_url": "",
        "more_info_url": "https:\/\/www.web357.com\/product\/web357-framework-joomla-plugin",
        "documentation_url": "https:\/\/docs.web357.com",
        "changelog_url": "https:\/\/www.web357.com\/product\/web357-framework-joomla-plugin#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "",
        "backend_settings_url": ".\/index.php?option=com_plugins&view=plugins&filter[search]=System%20-%20Web357%20Framework"
    },
    "fix404errorlinks": {
        "name": "fix404errorlinks",
        "real_name": "Fix 404 Error Links",
        "product_type": "free_and_pro",
        "description": "The Fix 404 Error Links is a SEO Tool for Admins and consists a useful extension for any Joomla! website. This extension has been created to deal with the log 404 (Page not Found) errors. It allows any website administrator to manage and fix the problematic links, as well as redirect them to the desired page.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Error 404 Links List<\/strong> (Group &amp; Detailed List of detected Error 404 Links. Data stored: Error URL, Error Code, Error Message, Username, IP Address, Country, Browser, Operating System, Referer URL).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Fix one by one, or butch-fix, of detected Error 404 Links. <\/strong><strong id=\"docs-internal-guid-b595fe4b-4f04-2c72-377d-f0f213c33f45\">This is a unique feature not found in other similar extensions.<\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Match Types<\/strong> (a) full URL, b) contains string, c) starts with string, d) end with string, e) find and replace). See the match type examples below.<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Logging<\/strong>\r\n    <ul>\r\n      <li> Error 404 Logging from Guest &amp; Users.<\/li>\r\n      <li> Error 404 Logging from Search Engine Bots.<\/li>\r\n      <li> Error 404 Logging from Danger Strings List.<\/li>\r\n      <\/ul>\r\n  <\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Notifications<\/strong> (Instant Email Notifications).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Security<\/strong> (Danger Strings Redirection).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Import from &quot;com_redirects&quot; Joomla! plugin\/component<\/strong> (Redirects can be imported from the Default Joomla Redirects plugin\/component into Fix404ErrorLinks redirects)<\/li>\r\n<\/ul>\r\n\r\n<h3 class=\"uk-h2 uk-text-center\">Parameters<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Enable Error 404 Logging<\/strong> (Choose 'Yes' if you want to store all 404 Error Links in the database and then fix them. If you choose 'No', the error links will not be stored in the database and Admins will not be notified for 404 error links via Email. The default option is 'Yes').<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Enable Logging from Bots<\/strong> (Choose 'Yes' if you want to store all 404 Error Links in the database from Search Engine Bots. If you choose 'No', the error links from bots will not be stored in the database and Admins will not be notified for 404 error links via Email. The default option is 'No').<\/li>\r\n  <li dir=\"ltr\"><strong>Danger Strings Logging<\/strong> (Choose 'Yes' if you want to store in the database all 404 Error Links that have been marked as danger, and already exist in the 'Danger strings list' below).  <\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Email Notifications<\/strong> (Choose 'Yes' if you want to receive instant notification messages for the 404 Error Links. You will receive a detailed email that includes the error link data, the User data (e.g. Country, IP address, browser, operating System etc.) and an action button to Fix the Url immediately via Joomla! admin panel).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Email Recipient<\/strong> (Enter the email of Recipient. If you leave the field blank and you have enabled the 'Email Notifications' field, the default email from Joomla! configuration will be used).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Danger Strings Redirection<\/strong> (Choose 'Yes' if you want to redirect all 404 Error links that contain a danger string partially or in the entire URL).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Danger Strings List<\/strong> (List of all danger strings. You can insert more danger strings, add one entry per row).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Redirect Danger URLs to<\/strong> (All 404 Error links that contain a danger string partially or in the entire URL will be redirected to this Url).<\/li>\r\n<\/ul>\r\n\r\n<h3 class=\"uk-h2 uk-text-center\">How to redirect an Error Link and how Match Type works<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<p>In \"404 error logs\" page, at Joomla! back-end, you can see all error links and a \"Fix it\" button next to each error link. If you press that button you will be redirected to the Fix Link page and you will see a form with 4 fields (a. Old Full Url or Text *, b. Destination Url *, c. Comments, d. Published).<\/p>\r\n\r\n<h3 class=\"uk-h2 uk-text-center\">Examples<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<p><strong>Example 1:<\/strong><\/p>\r\n<ul>\r\n  <li>Old Full Url or Text: <strong><em>&quot;this\/is\/an\/error\/link&quot;<\/em><\/strong><\/li>\r\n  <li>Match Type: <em><strong>&quot;Full URL&quot;<\/strong><\/em><\/li>\r\n  <li>Destination URL: <strong><em>&quot;\/this\/is\/a\/valid\/link\/&quot;<\/em><\/strong><\/li>\r\n<\/ul>\r\n<p>If a User or a Guest visits the link &quot;http:\/\/domain.com\/this\/is\/an\/error\/link\/&quot; he will be redirected to &quot;http:\/\/domain.com\/this\/is\/a\/valid\/link\/&quot;.<\/p>\r\n<p><strong>Example 2:<\/strong><\/p>\r\n<ul>\r\n  <li>Old Full Url or Text: <strong><em>&quot;is\/a&quot;<\/em><\/strong><\/li>\r\n  <li>Match Type: <strong><em>&quot;Contains String&quot;<\/em><\/strong><\/li>\r\n  <li>Destination URL.: <strong><em>&quot;\/this\/is\/a\/valid\/link\/&quot;<\/em><\/strong><\/li>\r\n<\/ul>\r\n<p>If a User or a Guest visits the link &quot;http:\/\/domain.com\/this\/is\/an\/error\/link\/&quot; he will be redirected to &quot;http:\/\/domain.com\/this\/is\/a\/valid\/link\/&quot; because the error link contains the string &quot;is\/a&quot;.<\/p>\r\n<p><strong>Example 3:<\/strong><\/p>\r\n<ul>\r\n  <li>Old Full Url or Text: <em><strong>&quot;this&quot;<\/strong><\/em><br>\r\n    <\/li>\r\n  <li>Match Type: <strong><em>&quot;Start with String&quot;<\/em><\/strong><br>\r\n    <\/li>\r\n  <li>Destination URL.: <strong><em>&quot;\/this\/is\/a\/valid\/link\/&quot;<\/em><\/strong><\/li>\r\n<\/ul>\r\n<p>If a User or a Guest visits the link &quot;http:\/\/domain.com\/this\/is\/an\/error\/link\/&quot; he will be redirected to &quot;http:\/\/domain.com\/this\/is\/a\/valid\/link\/&quot; because the error link starts with the string &quot;this&quot;.<\/p>\r\n<p> <strong>Example 4:<\/strong><\/p>\r\n<ul>\r\n  <li>  Old Full Url or Text: <strong><em>&quot;link&quot;<\/em><\/strong><br>\r\n    <\/li>\r\n  <li>Match Type: <em><strong>&quot;End with String&quot;<\/strong><\/em><br>\r\n    <\/li>\r\n  <li>Destination URL.: <strong><em>&quot;\/this\/is\/a\/valid\/link\/&quot;<\/em><\/strong><\/li>\r\n<\/ul>\r\n<p>If a User or a Guest visits the link &quot;http:\/\/domain.com\/this\/is\/an\/error\/link\/&quot; he will be redirected to &quot;http:\/\/domain.com\/this\/is\/a\/valid\/link\/&quot; because the error link ends with the string &quot;link&quot;.<\/p>\r\n<p> <strong>Example 5:<\/strong><\/p>\r\n<ul>\r\n  <li>Old Full Url (find): <strong><em>&quot;link&quot;<\/em><\/strong><br>\r\n    <\/li>\r\n  <li>Match Type: <em><strong>&quot;Find and Replace&quot;<\/strong><\/em><br>\r\n    <\/li>\r\n  <li>Destination URL (replace): <strong><em>&quot;url&quot;<\/em><\/strong><\/li>\r\n<\/ul>\r\n<p>If a User visits the link &quot;http:\/\/domain.com\/this\/is\/an\/error\/link\/&quot; he will be redirected to &quot;http:\/\/domain.com\/this\/is\/a\/valid\/url\/&quot; because the error link contains the string  &quot;link&quot; and it has replaced it with the string &quot;url&quot;.<br>\r\n<\/p>\r\n<!-- END: Features -->",
        "stable_version": "2.1.1",
        "beta_version": "2.1.2",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n19-Jan-2021 : v2.1.1\r\n# [Bug Fixed] Unknown column 'source_match_http_code' in 'field list'\r\n# [Bug Fixed] The hits of the redirects with regex is now increasing properly.\r\n# [Bug Fixed] The Redirection Analysis is not displayed while editing the redirection when the match type \"Do nothing\" is selected.\r\n\r\n18-Jan-2021 : v2.1.0\r\n# [Bug Fixed] If an error URL has been added twice in the database, there was an error with URL increase. The error message was \"500 - Fix404ErrorLinks: Error Updating Database.\" [Thank you, Marcelo Aguirre]\r\n# [Bug Fixed] Some issues with IDN (Internationalized Domain Name) characters have now been resolved successfully. [Thank you, Marcelo Aguirre]\r\n# [Bug Fixed] Warning: preg_match(): Compilation failed: unmatched closing parenthesis at offset 38 in \/plugins\/system\/fix404errorlinks\/fix404errorlinks.php on line 1207\r\n# [Bug Fixed] Blank page after deleting all the fixed 404 error links.\r\n# [Bug Fixed] The hits of the valid redirects are now increased properly.\r\n# [Bug Fixed] Got error 'repetition-operator operand invalid' from regexp [Thank you, Bent Elting]\r\n# [Bug Fixed] Fixed issue when there is a slash in the source URL.\r\n# [Bug Fixed] Fix issue with redirect when there is a full site url in the Target URL input field.\r\n# [Bug Fixed] Redirect doesn't count the hits when a regex string is used. [Thank you, René]\r\n^ [UX Improvement] When the \"find and replace\" is used as the match type of URL, leave only the option \"Redirect to a URL or text\" for the \"When matched\" parameter, and hide the other ones (Redirect to a menu item, Error Page, Do nothing).\r\n^ [Improvement] Rreplace the showFooter function with Web357framework's function.\r\n^ [UX Improvement] Redirection Analysis. When viewing or editing a redirect redirection's details will be displayed at the bottom of the form (screenshot: http:\/\/bit.ly\/fix404-redirection-analysis)\r\n^ [Improvement]  PHP Deprecated:  idn_to_ascii(): INTL_IDNA_VARIANT_2003 is deprecated in PHP v7.3.x.\r\n^ [Improvement]  PHP Deprecated:  idn_to_utf8(): INTL_IDNA_VARIANT_2003 is deprecated in PHP v7.3.x.\r\n\r\n03-Jul-2019 : v2.0.0\r\n+ Component redesigned\r\n+ Detailed control panel\r\n+ View & Fix the Error 404 links\r\n+ Redirections\r\n+ New method to Add a redirection\r\n+ 3 types of logging\r\n+ Instant email notifications\r\n+ Email restrictions\r\n+ Redirect all 404 Error links in one page\r\n+ Extra security with the danger strings\r\n+ GeoIP2 Webservice\r\n..and much more: https:\/\/www.web357.com\/blog\/news\/new-major-release-v2-0-0-for-the-fix-404-error-links-joomla-component\r\n\r\n07-Dec-2018 : v1.3.2\r\n# [Bug Fixed] Declaration of Fix404errorlinksControllerError404logs... [Many thanks to Bianka Craanen]\r\n# [Bug Fixed] Fix publishing issues after upgrading from Joomla! 3.9.1\r\n^ [Improvement] Allow regular expressions for Find and Replace method.\r\n\r\n09-Aug-2018 : v1.3.1\r\n# [Bug Fixed] There was a fatal error after deleting the error logs. [Many thanks to Bianka Craanen and Rob de Ruiter]\r\n\r\n09-Aug-2018 : v1.3.0\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n^ Code Cleanup.\r\n# Minor bug fixes and many improvements.\r\n\r\n20-Mar-2018 : v1.2.0\r\n# BUG Fixed: The fixed redirect URLs are adding a 4-digit number and the symbol \"::\". Before v1.1.0 everything was working fine. [Many thanks to Johann Piber]\r\n# BUG Fixed: jos-Error: Unknown column 'redirects.http_response_status_code' in 'field list'. [Thank you, Vito]\r\n# BUG Fixed: If you uninstall the component through Joomla! Extension Manager, the table `#__fix404_errorlogs` will not deleted.\r\n\r\n16-Mar-2018 : v1.1.0\r\n+ NEW FEATURE: HTTP Status Code. If the HTTP status code of the URL is 404 (error page), then the plugin redirects the User to the destination URL you've set. If the HTTP status code of URL is 200 (a valid page that already exists), then the plugin redirects the User to the destination URL you've set. Also, there is an option to use both of them at the same time.\r\n+ NEW FEATURE: Now you can set priorities for redirected (fixed) URLs by ordering them.\r\n^ Functions Improved: The getOS() and the getBrowser() functions have been updated to get the most recent Operating Systems and Browsers.\r\n^ The Demo and the JED link have been updated in the description tab, at Joomla! backend.\r\n! The Web357 Download ID parameter field has been deleted from each extension settings and has been replaced by a unique API key parameter field at the Web357 Framework plugin settings.\r\n+ A new button (Settings) has been added to the description tab at Joomla! backend.\r\n^ Compatible with the latest version (1.6.0) of Web357 framework plugin.\r\n# Minor improvements.\r\n# Code cleanup.\r\n\r\n06-Jul-2017 : v1.0.9\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n13-May-2017 : v1.0.8\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n+ Compatible with the latest version of Web357 Framework v1.4.3.\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n\r\n04-Oct-2016 : v1.0.7\r\n# Some issues after an update of a premium version, even if the customer has save correctly the download ID of his order, have been resolved.\r\n\r\n05-Sep-2016 : v1.0.6\r\n# Bug Fixed: mysql_real_escape_string() is a function from the legacy MySQL extension. Replaced with $db->escape().\r\n# Bug Fixed: There are empty redirect links after importing from com_redirect Joomla! core component.\r\n# Bug Fixed: The Error URLs with double or single quotes are now allowed.\r\n# Bug Fixed: If the array of Error URLs is empty there was a PHP warning error \"PHP Warning:  Invalid argument supplied for foreach() \".\r\n+ Some folders like \"cache\/\" should be avoided. [Thank you, Georgios]\r\n^ The default PHP function to sending emails \"mail()\", has been replaced with \"JFactory::getMailer();\". [Thank you, Dan].\r\n! Unnecessary comments have been removed.\r\n\r\n17-Mar-2016 : v1.0.5\r\n# Bug Fixed: Strict Standards: Non-static method plgSystemFix404ErrorLinks::W357FrameworkHelperClass() should not be called statically in fix404errorlinks.php on line 104,105.\r\n\r\n08-Dec-2015 : v1.0.4\r\n# Minor bug fixes after the latest upgrade from v1.0.3\r\n\r\n07-Dec-2015 : v1.0.3\r\n^ Updated description.\r\n^ Updated translations.\r\n\r\n13-Nov-2015 : v1.0.2\r\n+ NEW Parameter Field: Download ID. You need to specify your Download ID before you can receive updates for the PRO versions. For more information please follow our instructions here: https:\/\/www.web357.com\/apikey\r\n# Minor bug fixes.\r\n\r\n05-Oct-2015 : v1.0.1\r\n# Minor issues with jQuery and CSS have been resolved..\r\n\r\n06-Jul-2015 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2021-01-19",
        "extension_type": "Component",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/fix-404-error-links",
        "more_info_url": "https:\/\/www.web357.com\/product\/fix-404-error-links-joomla-component",
        "documentation_url": "https:\/\/docs.web357.com\/category\/41-fix-404-error-links",
        "changelog_url": "https:\/\/www.web357.com\/product\/fix-404-error-links-joomla-component#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extension\/fix-404-error-links\/",
        "backend_settings_url": ".\/index.php?option=com_config&view=component&component=com_fix404errorlinks"
    },
    "monthlyarchive": {
        "name": "monthlyarchive",
        "real_name": "Monthly Archive",
        "product_type": "pro",
        "description": "The Monthly Archive Joomla! component provides a list of Joomla or K2 content divided into months and years. It is supplied with a lot of features and multiple parameters, improves user navigation and works as a search tool too. It is great for blogs, news portals, journalists, authors, speakers, and any other content based website.",
        "description_features": "<!-- BEGIN: Features -->\r\n  <h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n  <ul class=\"uk-list uk-list-striped\">\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Fully customizable with many parameters.<\/strong><\/li>\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Responsive Design.<\/strong><\/li>\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>SEO Friendly URLs.<\/strong><\/li>\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>MVC support.<\/strong><\/li>\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Based on Joomla! coding standards.<\/strong><\/li>\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Multi-Language support.<\/strong><\/li>\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Integration with 3rd party extensions: K2 component and JComments component.<\/strong><\/li>\r\n\r\n  <\/ul>\r\n  <h3 class=\"uk-h2 uk-text-center\">Many Useful Parameters<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n  <ul class=\"uk-list uk-list-striped\">\r\n    \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>CONTENT TYPE:<\/strong> You can either display directly the list of Articles instead of  displaying only the list of Months and Years.<\/li>\r\n    \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>STATE:<\/strong> You can choose a different type of article state to be displayed. You can either show all articles, the featured articles, the non-featured articles or both. The published or unpublished articles, the trashed articles, and of course the archived articles (from Joomla core functionality).<\/li>\r\n    \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>CUSTOM TEXTS:<\/strong> Custom Page Titles and Welcome Messages. Another useful feature to set your custom texts for the page title and the welcome message for each content type (months\/years list or list of articles) separately. Also, you can hide the page title or the welcome message, again in each content-type separately.<\/li>\r\n    \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>INCLUDE\/EXCLUDE CONTENT:<\/strong> Another great feature is to display any content you want to be displayed. You can choose which content items to include or exclude from your Archive, specific years, months, categories, authors, and articles.<\/li>\r\n    \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>UIkit FRAMEWORK:<\/strong> It is based on the fantastic UIkit framework of Yootheme team. The UIkit is a lightweight and modular front-end framework for developing fast and powerful web interfaces.<\/li>\r\n    \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>SEARCH FORM:<\/strong> Choose the input form fields that will be displayed in the search form. Select those that are useful for your Users. You can show the date select field, the order select field, the author's select form field, and the search input text. Also, you can show\/hide each form field in each content-type separately.<\/li>\r\n    \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>LAYOUT:<\/strong> There are multiple new useful parameters to customize the layout for each content type separately, the list of months\/years and the list of articles. For example, you can choose if you want to display the years in an accordion style. You can select the ordering of years, most recent years first, or oldest years first. To avoid big lists, you can set your own limits (e.g. display only the three most recent years and their months).<\/li>\r\n    \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>IMAGES:<\/strong> We add more powerful parameters for images. You can show or hide the image. You can choose if your image will be displayed with a link or not. You can choose the image type (the intro image, the full, the auto-detect from the content item or the blank image). Finally, you can set your preferred image dimensions (width and height).<\/li>\r\n    \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>COMMENTS:<\/strong> You can show an icon with the count of comments (from jcomments or k2) beside the content title, like hits.<\/li>\r\n    \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>MODULE:<\/strong> The module has also been re-written from scratch with bug fixes, speed optimizations, and new features just as the component has.<\/li>\r\n\r\n  <\/ul>\r\n  <!-- END: Features -->",
        "stable_version": "4.5.1",
        "beta_version": "4.5.1",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n22-Jan-2021 : v4.5.1\r\n# [Bug Fixed] Filtering error. When you select multiple filters for example month and author, you get a 404 error if the URL Rewriting is disabled from backend and the site run under a subdomain. [Thank you, Gerald Gimpl]\r\n# [Bug Fixed] In the category filter form field, if a category level is 4 it should be displayed directly beneath the category with level 3, and a little bit right.\r\n\r\n04-Jan-2021 : v4.5.0\r\n# [Bug Fixed] The select form field with the years should not stopped at 2020.\r\n# [Bug Fixed] Fix redirect after change the select month\/year in the search form.\r\n# [Bug Fixed] Empty results with the parameter Include\/Exclude categories for K2 contet type. [Thank you, Coninet Spa]\r\n# [Bug Fixed] An issue with the \"Allow only these HTML Tags\" parameter has been fixed. [Thank you, Giorgio Guzzi]\r\n^ [Language] The German (de-DE) language has been updated [Many thanks to Giorgio Guzzi]\r\n^ [Improvement] Added missing months\/years (2018, 2019, 2020, 2021) in the \"Include\/Exclude (months\/years)\" parameter field in component and menu item settings.\r\n^ [Improvement] Prepare content to show PHP\/Html\/CSS\/Javascript code at the monthly archive items, when using plugins such as the \"Sourcener\" of regularlabs which allows you to write code in the articles by using tags like {source}{\/source}.\r\n\r\n14-Mar-2019 : v4.4.6\r\n# [BUG Fixed] There was a 404 error after selecting a category. This issue affects only subdomains with subdirectories and sub (over 2 levels) menu items. [Thank you, Radin Nurhafiz]\r\n\r\n03-Mar-2019 : v4.4.5\r\n# [BUG Fixed] When the date of an article is, for example, 31\/Dec\/2018, 23:59:59, the article isn't displaying in December's (2018) list, but in January's (2019) results. This was a bug with the timezone in Daylight Saving Time (United States) or Summertime period (Europe). [Thank you, Olaf Bieler]\r\n+ [Update] The UIkit framework has been updated to the latest version (UIkit 3.0.3).\r\n^ [Improvement] After each JS and CSS file, the \"v\" variable has been added, with the value \"{version}_{datetime_of_release}\". Example: \"\/components\/com_monthlyarchive\/views\/archive\/tmpl\/default.css?v=4.4.5_20190303011554\"\r\n\r\n07-Dec-2018 : v4.4.4\r\n^ [Improvement] Search also in the author alias.\r\n^ [Language] The Danish (da-DK) language has been updated [Many thanks to Hans Uwe Petersen]\r\n^ [Improvement] The form input fields are WCAG compliant [Thank you, Richard Elwood]\r\n\r\n12-Oct-2018 : v4.4.3\r\n! The \"load UIkit\" option has been removed from the component and the module parameters.\r\n# Minor CSS Improvements.\r\n\r\n05-Oct-2018 : v4.4.2\r\n+ [Update] The UIkit framework has been upgraded to the latest version (UIkit 3.0.0-rc.17).\r\n^ [Improvement] The UIkit prefix has been changed from \".uk-\" to \".w357ui-\".\r\n# [BUG Fixed] The issue with error 404 when searching a string from JComments has been resolved. [Thank you, Rolf Winter]\r\n^ [Styling Improvement] Always use the black (#000) color in the modal window body, if the template background is dark.\r\n# [New Parameter] New feature allowing to select the position of month in the Month-Year display format. For example in Hungary the year is used to be displayed in front of the month (e.g. 2018 October). [Thank you, Krisztina]\r\n# [Bug Fixes] Some issues with the UI grid have been resolved in small devices.\r\n# [Bug Fixes] Minor CSS issues have been resolved.\r\n\r\n10-Sep-2018 : v4.4.1\r\n+ [New Module Feature] In the module settings, you can choose to display a select box with Months and Years.\r\n+ [New Parameter] Show Unauthorised Links. If set to Yes, links to registered content will be shown even if you are not logged-in. You will need to log in to access the full item. [Thank you, Joe]\r\n+ [New Parameter] You can choose your own blank image for the articles that not have any image. [Thank you, Bianka Craanen]\r\n# [Bug Fixed in K2] Even if the option \"Hide Trashed Items\" is disabled, the trashed items are displayed in the list of K2 items. [Thank you, Alberto]\r\n^ [CSS Improvement] In the extension parameters, the class \"btn-group-yesno\", replaced with \"btn-group btn-group\".\r\n\r\n09-Aug-2018 : v4.4.0\r\n+ Fully compatible with Joomla! 4.x\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n# [Improvement] Fixes issues with the jquery string on file names to avoid the exclusion from 3rd party extensions. The file \"jquery.no-conflict.js\" renamed to \"jq.no-conflict.js\".\r\n# [Bug Fixed] If the content created or publish_up datetime was \"0000-00-00 00:00:00\", the following error is displayed. \"DateTime::__construct(): Failed to parse time string at position. Double timezone specification.\" [Thank you, Michael Ferguson]\r\n# [Improvement] JS code should be in HEAD.\r\n^ Code Cleanup.\r\n# Minor bug fixes and many improvements.\r\n\r\n07-Apr-2018 : v4.3.7\r\n+ NEW PARAMETER also for the module: Load UIkit front-end framework. Optionally you can set this option to No if you have already are using a YOOtheme Pro template and you have detected some conflicts.\r\n\r\n29-Mar-2018 : v4.3.6\r\n# BUG Fixed: There was an SQL issue with subscribers which use K2. In where clause we use the (c.state=1), but in the K2 item, the column named 'state' is not present. The correct is (c.published=1). [Many thanks to Alberto for his contribution on this issue]\r\n\r\n16-Mar-2018 : v4.3.5\r\n+ NEW PARAMETER: Set an exception to the previous parameter \"Show only own articles\". You can now allow some user groups to see all articles instead of their own only.\r\n^ The Demo and the JED link have been updated in the description tab, at Joomla! backend.\r\n! The Web357 Download ID parameter field has been deleted from each extension settings and has been replaced by a unique API key parameter field at the Web357 Framework plugin settings.\r\n+ A new button (Settings) has been added to the description tab at Joomla! backend.\r\n^ Compatible with the latest version (1.6.0) of Web357 framework plugin.\r\n\r\n14-Mar-2018 : v4.3.4\r\n+ NEW PARAMETER: Load UIkit front-end framework. Optionally you can set this option to No if you have already are using a YOOtheme Pro template and you have detected some conflicts. [Many thanks to Michael Maass]\r\n+ NEW OPTION: In the \"Display Author\" parameter field, you can now use the \"Created by Alias\" option for the Author name. [Many thanks to Suat Ural]\r\n# Some lines of code have been improved.\r\n\r\n10-Feb-2018 : v4.3.3\r\n# BUF FIXED: Notice: Undefined variable: get_author in l\/components\/com_monthlyarchive\/models\/archive.php on line 462. [Many thanks to Francesco]\r\n\r\n09-Feb-2018 : v4.3.2\r\n+ NEW PARAMETER: Show only my own articles. The logged in user will be able to see only his own articles. [Thank you, Denise]\r\n# BUG FIXED: If the option \"Search Engine Friendly URLs\" from SEO Settings of the Joomla global configuration is disabled, there were error links (404) at the component and the module. [Many thanks to Ubovic Dragan]\r\n# Fix container issues with UIkit scope mode (jQuery conflicts).\r\n# Cleanup some unnecessary lines of code.\r\n\r\n08-Feb-2018 : v4.3.1\r\n^ The UIkit framework (scope mode) has been updated to UIkit 3.0.0-beta39.\r\n# Fixed compatibility issues with older versions of UIkit of users which still use the wrap framework in Yootheme templates.\r\n\r\n17-Jan-2018 : v4.3.0\r\n+ New improved SQL query for the model. Fully optimized and speedy results. Highly recommended for huge databases, over than 50,000 articles.\r\n+ SEO improvement: The word 'archive' has been removed from the URL for SEO purposes. You can set your own word from the menu item alias. (e.g. mysite.com\/yourwordhere\/2017\/03)\r\n+ The Metadata options are now supported in Menu Item and you can set the meta description, the meta keywords, and the robots for each menu item you create.\r\n^ The search engine has been improved.\r\n^ CSS improvements: The UIkit CSS framework is now lighter and it does not override anymore your base CSS (paragraphs, headings, links, etc.).\r\n^ The search engine has been improved and a new CSS class \".ma-highlight-search-word\" has been added into the CSS file, to highlighting your search words.\r\n^ The UIkit framework (scope mode) has been updated to UIkit 3.0.0-beta.37\r\n# BUG Fixed: Warning: DOMDocument::loadHTML(): ID s3gt_translate_tooltip_mini already defined \r\n# BUG Fixed: If you don't choose any filter, and write something in the search, it redirects the user to the homepage of the component.\r\n# Minor bug fixes.\r\n\r\n04-Jan-2018 : v4.2.8\r\n# BUG Fixed: When creating a new menu item, there is no possibility to filter with categories. [Thank you, Reinhard Bollmann]\r\n\r\n15-Dec-2017 : v4.2.7\r\n+ NEW PARAMETER: Option to show or hide the image in modal's dialog. [Many thanks to Rainer for his suggestion]\r\n^ In menu item settings now we use the useglobal=\"true\" instead of the JGLOBAL_USE_GLOBAL. This method allows you to know which are exactly the global values of global configuration.\r\n# Minor improvements\r\n\r\n07-Dec-2017 : v4.2.6\r\n# BUG Fixed: The modal dialog, of \"Link Type\" parameter, is not working after upgrade to UIkit 3.0.0-beta.35. [Thank you, Rainer]\r\n\r\n29-Nov-2017 : v4.2.5\r\n# BUG FIXED: Modal and Tooltip are not working with UIKit SCOPE mode. \r\n# BUG Fixed: The filters are not working if the user is logged in.\r\n\r\n28-Nov-2017 : v4.2.4\r\n# UIkit framework (scope mode) has been updated from UIkit 3.0.0-beta.24 to UIkit 3.0.0-beta.35\r\n# Missing parameters in menu item options (image_priority_1, image_priority_2, image_priority_3, image_priority_4)\r\n# If you choose a category, only the months which have at least one article will be displayed in the select form field.\r\n# BUG fixed: The count of articles for each author\/category\/month\/year is now correct.\r\n# Minor bug fixes and several improvements.\r\n\r\n15-Nov-2017 : v4.2.3\r\n# BUG Fixed: If an admin chooses the 'List of Articles' value, of 'Display Type' parameter, the count of articles in the welcome message was wrong. It shows always the count of articles for each page based on pagination, instead of the total number of the chosen month\/year or search filters.\r\n# BUG Fixed: If the intro or the full text is empty, and only the title exists, the following error is displayed. \"Warning: DOMDocument::loadHTML(): Empty string supplied as input in line X\".\r\n# MODULE: Bug fixed with useless blank lines. [Thank you, Csapó Krisztina]\r\n# CSS Bug Fixed: Do not show the content element in front of other template elements, like the sticky menu for example. (.ma-content-item{z-index:1}) [Thank you, Csapó Krisztina]\r\n# BUG Fixed with the UTC\/GMT\/MET timezones. The count of articles on each month was not correct and most of the times the string \"No Items\" is displayed. [Many thanks to Paul, Csapó Krisztina, and Harald Krüger]\r\n# Minor bug fixes and several improvements.\r\n\r\n14-Nov-2017 : v4.2.2\r\n+ New Feature added: Now you can see the \"Edit Article\" link in Monthly Archive list. [Many thanks to Michael Maass]\r\n\r\n25-Oct-2017 : v4.2.1\r\n# BUG Fixed: Warning: DOMDocument::loadHTML(): Empty string supplied as input in line X. [Many thanks to Kjartan Haugen and Mark Timmerman]\r\n# BUG Fixed: Some third-party content plugins for galleries, videos, etc didn't work properly. The triggering content plugins are now supported. [Many thanks to Kjartan Haugen]\r\n\r\n04-Sep-2017 : v4.2.0\r\n# BUG Fixed: Fatal error: Call to undefined method MonthlyarchiveHelper::getActions(). [Thank you, Daniel Smith]\r\n\r\n31-Aug-2017 : v4.1.9\r\n# BUG Fixed: The issue with the parameter field custom date format for tooltip has been resolved. Support request: https:\/\/www.web357.com\/forum\/2895-date-format-for-tooltip-problem [Thank you, Dimosthenis Messinis]\r\n\r\n17-Jul-2017 : v4.1.8\r\n^ The \"de-DE\" German language has been updated. [Thank you, Albert Spanninger]\r\n\r\n09-Jul-2017 : v4.1.7\r\n+ Import Content Prepare Plugin functionality. Allows 3rd party plugins (e.g. galleries) be displayed in the modal popup window [Thank you, Eddie].\r\n# CSS Bug Fixed: the z-index decreased to help galleries be displayed in front of the modal popup window.\r\n\r\n05-Jul-2017 : v4.1.6\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n22-Jun-2017 : v4.1.5\r\n# BUG Fixed: 500 SQL Error: Unknown column 'categories.parent_id' in 'field list'. [Thank you, Jennifer Gress]\r\n\r\n19-Jun-2017 : v4.1.4\r\n^ The \"ca-ES\" Catalan language has been updated. [Thank you, Jose (JOSERVEIS)]\r\n\r\n16-Jun-2017 : v4.1.3\r\n+ NEW FEATURE: This is an old feature which has been re-published. You can select which type of include\/exclude of categories you want to display. There are two options: 1. 'Parent Categories Only' means that you can include, the parent category, and its subcategories, without select all subcategories. 2. 'Parent Categories and its Subcategories' means that you can include, the parent category and you have also select its subcategories separately. [Thank you, Björn Wichern]\r\n# Some issues with the publish date of articles have been resolved. [Thank you, Jose M.]\r\n# Define image variables to avoid PHP warning messages. [Thank you, Jose M.]\r\n# Minor bug fixes.\r\n\r\n15-Jun-2017 : v4.1.2\r\n+ NEW FEATURE: Include\/Exclude Type (1. only months, 2. only years, 3. specific month-year).\r\n+ NEW FEATURE: Image priorities (intro image, full image, auto detect from the article, blank image). Choose which image to detect first. For example, if you set the intro image as priority-1, and the intro image does not exist, then the system will check for the priority-2 image, and then the next one.\r\n# Memory load improvements.\r\n# Speed optimization.\r\n# Minor bug fixes.\r\n\r\n29-May-2017 : v4.1.1\r\n# Some compatibility issues with older versions of UIkit, and Yootheme templates, like \"yoo_finch\", that have an old version of UIkit, have been resolved. [Thank you, Richard]\r\n^ UIkit has been updated to the latest version 3.0.0-beta.24.\r\n^ The \"nl-NL\" language has been updated. [Thank you, Wim Hanssen]\r\n\r\n13-May-2017 : v4.1.0\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n+ Compatible with the latest version of Web357 Framework v1.4.3.\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n\r\n08-May-2017 : v4.0.9\r\n# BUG Fixed: jQuery conflicts have been resolved (e.g. the back button is not worked). [Thank you, Wim Hanssen].\r\n\r\n07-May-2017 : v4.0.8\r\n# The \"de-DE\" language file has been updated. [Many thanks to Albert Spanninger]\r\n\r\n06-May-2017 : v4.0.7\r\n# BUG Fixed: First check if K2 exists to avoid errors in the component configuration. [Thank you, Robert Gilbey].\r\n\r\n05-May-2017 : v4.0.6\r\n^ The 'Include\/Exclude Authors' and the 'Include\/Exclude Categories' parameter fields for K2 have been changed, and you are able to choose from the list instead of entering the IDs of each item separated by a comma. [Thank you, Alan Smith]\r\n^ The language files ca-ES, da-DK, de-DE, el-GR, en-GB, es-ES, fr-FR, it-IT, nl-NL, have been updated for the component and module.\r\n# Bug Fixed: Some issues with pagination have been resolved.\r\n# Bug Fixed: Some CSS bugs in the menu navigation, in some templates which using and older version of UIkit, like the 'Bento' theme of Yootheme, have been resolved. [Thank you, Wim Hanssen].\r\n# Minor bug fixes.\r\n\r\n01-May-2017 : v4.0.5\r\n# Bug Fixed: Some parameter fields at backend are not displayed correctly in version Joomla! 3.7.\r\n+ New Feature: A new parameter field has been added. The \"Link Type\" parameter allow you to choose if you want to have links or modal dialogs. [Thank you, Eddie]\r\n\r\n27-Apr-2017 : v4.0.4\r\n^ Τhe tooltip style of UIkit has been replaced with another custom one and simple, after a feedback of many Subscribers that had many problems with their templates. [Thank you, George Ntatsis]\r\n\r\n26-Apr-2017 : v4.0.3\r\n# Bug Fixed: The tooltip is displayed in a wrong position.\r\n# Minor CSS issues and fixes have been resolved.\r\n\r\n24-Apr-2017 : v4.0.2\r\n+ New feature: If you enable the parameter of the auto-detected image, you will be able to select which image you want to get, the first or a random one of your content item. [Thank you, Mike Pringle]\r\n# Bug Fixed: Some CSS issues e.g. link color, gray color of small meta texts like count of articles, etc., have been removed and will take automatically the colors of your current template. [Thank you, Uwe Grünberg]\r\n# Bug Fixed: The modal window is now displayed in front of other HTML elements using the z-index CSS method.\r\n# Bug Fixed: You don't need to set the parameters also in the menu item. [Thank you, Wim]\r\n# Bug Fixed: If a menu item hasn't created, there is an error (404) after clicking on months\/years links via the module.\r\n# Bug Fixed: The pagination ($this->pagination->getListFooter()) is not working properly (link is empty) in some Joomla! templates of popular template providers like joomlababoo, joomlaxtc, rockettheme, joomlart, gavick, yootheme, etc. [Thank you, Wim]\r\n# Bug Fixed: The tooltip does not work properly in Joomla! templates from JoomlaBamboo.\r\n# Minor Bug Fixes.\r\n\r\n21-Apr-2017 : v4.0.1\r\n# Some issues with older versions of PHP (5.3.x) have been resolved.\r\n# The bug with the ordering in the Date (years\/months) select form field has been resolved.\r\n# Compatibility with the Web357 Framework plugin v1.4.1.\r\n# Fatal PHP errors in Monthly Archive after upgrade to Web357 Framework v1.4.0 have been resolved. [Thank you, Wim]\r\n# Minor CSS issues. [Thank you, Uwe]\r\n\r\n20-Apr-2017 : v4.0.0\r\n+ 29 new useful parameters have been added.\r\n+ More than 40 parameters have been improved.\r\n+ *\"Content-Type\" parameter. You can now display directly the list of Articles instead of displaying the list of Months and Years like the previous version did.\r\n+ Check first if a third party extension is active (installed or enabled), and then retrieve content from there, without displaying any errors.\r\n+ *STATE: You can choose a different type of article state to be displayed. You can either show all articles, the featured articles, the non-featured articles or both. The published or unpublished articles, the trashed articles, and of course the archived articles (from Joomla core functionality).\r\n+ *Custom Page Title and Welcome Message are now welcome. Another useful feature to set your custom texts for the page title and the welcome message for each content type (months\/years list or list of articles) separately. Also, you can hide the page title or the welcome message, again in each content-type separately.\r\n+ *Include\/Exclude content. Another great feature is to display any content you want to be displayed. You can choose which content items to include or exclude from your Archive, specific years, months, categories, authors, and articles. In the new version, the parameters are now displayed as a new separate tab in the component parameters.\r\n+ *UIkit Front-end framework: The layout has been improved spectacularly. It is based on the fantastic UIkit framework of Yootheme team. The UIkit is a lightweight and modular front-end framework for developing fast and powerful web interfaces.\r\n+ *SEARCH FORM: Choose the input form fields that will be displayed in the search form. Select those that are useful for your Users. You can show the date select field, the order select field, the author's select form field, and the search input text. Also, you can show\/hide each form field in each content-type separately.\r\n+ LAYOUT & NEW PARAMETERS: There are multiple new useful parameters to customize the layout for each content type separately, the list of months\/years and the list of articles. For example, you can choose if you want to display the years in an accordion style. You can select the ordering of years, most recent years first, or oldest years first. To avoid big lists, you can set your own limits (e.g. display only the three most recent years and their months).\r\n+ *IMAGES: We add more powerful parameters for images. You can show or hide the image. You can choose if your image will be displayed with a link or not. You can choose the image type (the intro image, the full, the auto-detect from the content item or the blank image). Finally, you can set your preferred image dimensions (width and height).\r\n+ *COMMENTS: This is a feature of a previous version but the functionality has been improved and optimized.\r\n+ *MODULE: The module has also been re-written from scratch with bug fixes, speed optimizations, and new features just as the component has.\r\n^ The language files have been changed. Some strings have been deleted and some others have been added.\r\n# Minor issues with previous parameter fields have been resolved.\r\n# Most of the bug fixes and security issues have been resolved.\r\n# CSS and Javascript issues have been resolved.\r\n\r\n21-Dec-2016 : v3.6.5\r\n^ The paths of JS files have been changed both for the component and module.\r\n# jQuery conflicts with other extensions using same versions have been resolved. [Many thanks to Karlschule Rastatt]\r\n# We use external JS\/CSS files instead of inline JS\/CSS code.\r\n# Minor bug fixes have been resolved.\r\n\r\n25-Apr-2016 : v3.6.4\r\n+ The Catalan language has been added (Many thanks to José M. for his contribution).\r\n# Some issues (blank page and template crashed, mostly) in extension's configuration\/parameters that still use Joomla! 3.3.x, have been resolved.\r\n# The error messages about the download ID, during the update of other Web357 extensions, have been resolved and have been removed. \r\n# Bug Fixed: Some conflicts with menu item's page heading and page title, have been resolved.\r\n# Minor bug fixes.\r\n\r\n12-Jan-2016 : v3.6.3\r\n# Bug Fixed: The sum of articles at the right of each year is not calculated correctly for the Joomla! and K2 articles.\r\n\r\n08-Dec-2015 : v3.6.2\r\n# Minor bug fixes after the latest upgrade from v3.6.1\r\n\r\n07-Dec-2015 : v3.6.1\r\n^ Updated description.\r\n^ Updated translations.\r\n\r\n23-Nov-2015 : v3.6.0\r\n+ NEW PARAMETER: SEO: Robots. You can block Monthly Archive component from Search Engines.\r\n+ NEW PARAMETER: SEO: Follow Links. You can tell search engines to follow or not follow the links (https:\/\/support.google.com\/webmasters\/answer\/96569?hl=en).\r\n# BUG FIXED: 1146 Table '#__k2_categories' doesn't exist.\r\n# BUG FIXED: Error loading component: com_k2, Component not found.\r\n# BUG FIXED: The \"Use Global\" option has not set for the menu item parameter fields: \"Include Category Type\" and \"Exclude Category Type\".\r\n# Bug Fixed: Element: k2categories.php. Check if K2 is installed and then if is enabled. Error Message: \"ComponentError loading component: com_k2, Component not found.\r\n^ The plugin is enabled automatically, instead of displaying the message: \"Error - The 'Monthly Archive' plugin is required for this extension and must be active.\"\r\n^ Default settings have been set. No errors anymore from the first installation, about MySql Error 1146, K2 is missing, JComments is not installed etc.\r\n^ The (copyright) footer is shorter now. Changed from \"Powered by Monthly Archive PRO (by Web357)\" to \"Powered by Monthly Archive\".\r\n^ The module has the same parameters as the component.\r\n+ The parameters \"Include Categories Type\" and \"Exclude Categories Type\" are also available for the Module. With this parameter you can include the parent category and its subcategories, without select all subcategories.\r\n\r\n13-Nov-2015 : v3.5.3\r\n+ NEW Parameter Field: Download ID. You need to specify your Download ID before you can receive updates for the PRO versions. For more information please follow our instructions here: https:\/\/www.web357.com\/apikey\r\n# BUG Fixes: the exclusion and inclusion of months and years working properly now.\r\n# LANGUAGE: Spanish language file has been saved again because there were some issues with ñ and á characters.\r\n\r\n11-Oct-2015 : v3.5.2\r\n# BUG Fixed: It's not possible to enter the settings after updating from 3.5.1, if the K2 component is not enabled or active.\r\n# MODULE: You can select K2 Categories for include\/exclude, without entering the IDs of Categories.\r\n\r\n08-Oct-2015 : v3.5.1\r\n^ You can select K2 Categories for include\/exclude, without entering the IDs of Categories.\r\n+ New Parameter Added: You can select which type of include\/exclude of categories you want to display. There are two options: 1. 'Parent Categories Only' means that you can include, the parent category, and its subcategories, without select all subcategories. 2. 'Parent Categories and its Subcategories' means that you can include, the parent category and you have also select its subcategories separately.\r\n# BUG FIXED: \"Più\" word did not display correctly in the Italian language.\r\n# BUG FIXED: Include - Exclude categories, did not work rightly.\r\n# BUG FIXED: The count of the Categories and the Authors in the  form field, now calculated correctly.\r\n\r\n15-May-2015 : v3.5.0\r\n+ 7 New Useful Parameters have been added (show_year, show_month, count_of_articles_beside_year, include_years, include_months, exclude_years, exclude_months).\r\n+ New Parameter added: Show or Hide Months or Years from the list.\r\n+ New Parameter added: Show or Hide the count of articles, beside each Month or Year, from the list.\r\n+ New Parameter added: Include\/Exclude specific Years and Months.\r\n+ New Feature added in Component: Nice jQuery Accordion effect for the Years (expand\/collapse).\r\n^ Languge files have been edited.\r\n! File removed: \"\/modules\/mod_monthlyarchive\/tmpl\/accordion.php\"\r\n! File removed: \"\/modules\/mod_monthlyarchive\/assets\/ma_output.php\"\r\n^ File renamed: from \"\/mod_monthlyarchive\/assets\/style.css\" to \"\/mod_monthlyarchive\/assets\/mod_monthlyarchive.css\"\r\n^ Italian Language file: \"Month\" in italian is \"Mese\" not \"Messe\"\r\n+ If you choose the menu item type \"Specific Month-Year\", you can display articles from all year instead of one month of the year.\r\n# MODULE - Bug fixed: Copyright text must be outside of .\r\n\r\n25-Apr-2015 : v3.4.2\r\n# Bug Fixed: Issues with the required field of menu item id in the module parameters.\r\n^ CSS improvements in component and module about big padding in list items.\r\n# Bug Fixed with version checker from web357 framework, has been resolved.\r\n# Warning messages in component's page, at joomla backend, have been resolved.\r\n\r\n23-Apr-2015 : v3.4.1\r\n+ Compatible with \"Web357Framework\" (joomla! system plugin).\r\n^ Improvement design for parameter fields (better radio buttons and color pickers).\r\n+ ADMIN: New Element: Description of extension (buttons: view demo, more details, changelog, support).\r\n+ ADMIN: New Element: Version Check.\r\n+ ADMIN: New Element: About Web357 (logo, description, find us on social media).\r\n# General minor fixes.\r\n# Clean and code improvement.\r\n\r\n06-Apr-2015 : v3.3.2\r\n# Issues fixed with menu item ids in module, after upgrade to 3.3.1\r\n\r\n31-Mar-2015 : v3.3.1\r\n^ CSS Files moved. Each \"view\" has their own css file. It helps when we need to override component in our current template\r\n^ The language files are now inside the component and module folder. All languages files have been added in Transifex.\r\n+ Component has been improved in joomla admin panel with 3 new sections, a) Overview (information about Monthly Archive), b) Settings, c) Changelog.\r\n# COMPONENT: BUG Fixed: Error message in admin panel: \"500 Html Behavior:: tab state not found\"\r\n^ COMPONENT: The first letter of Month, in select box, is now uppercase.\r\n^ COMPONENT: BUG Fixed: Pagination was everytime enabled, even if the field \"display pagination\" from parameters, had been set as \"Hide\".\r\n# MODULE: BUG Fixed: jQuery's conflict issues with \"accordion\" module style have been resolved.\r\n# MODULE: Content Type field has now a default value after the first installation.\r\n# MODULE: In parameter field \"Menu Item ID\", we inserted the language prefix to help you assign the correct menu item of component, if your website is multilangual.\r\n^ MODULE: \"style.css\" renamed to \"mod_monthlyarchive.css\".\r\n+ MODULE: override module supported.\r\n! MODULE: \"ma_output.php\" helper file has been removed.\r\n^ MODULE: fopen php function avoided for check module's latest version. Replaced with \"simplexml_load_file\".\r\n+ PHP, CSS code improvement.\r\n# Some unneeded lines and comments in code, have been removed.\r\n# Minor bug fixes.\r\n\r\n13-Mar-2015 : v3.3.0\r\n+ LANGUAGE: French (fr-FR) language added for the component and module.\r\n+ LANGUAGE: Danish (da-DK) language added for the component and module.\r\n+ MODULE: You can select the menu item ID that is assigned with Monthly Archive.\r\n! MODULE: List style parameter removed.\r\n# MODULE: Bug Fixed: Active color in the correct month link.\r\n# MODULE: Bug Fixed: Module doesn't display all months.\r\n^ COMPONENT: Improved MVC functionality.\r\n^ COMPONENT: In \"Specific Month-Year\" menu item, month and year fields are required.\r\n# COMPONENT: BUG Fixed: Error links with preffered alias and pagination links.\r\n^ COMPONENT: Remove \"limit,5\" from url, if pagination is disabled.\r\n+ COMPONENT: Nice CSS radio buttons for show\/hide fields, in backend parameters .\r\n+ COMPONENT: \"Page Display\" functionality for menu items. From menu item's tab. You can set custom browser title and page heading title in the front page of component.\r\n# COMPONENT: BUG Fixed: \"Date Format\" and \"Custom Date Format\" are now compatible with menu item parameters.\r\n+ COMPONENT: You can allow all or one or two or more, HTML Tags for the introtext.\r\n# COMPONENT: BUG Fixed: K2 Notice: Undefined index: catalias (only in joomla 2.5.x).\r\n# COMPONENT: BUG Fixed: \"Show page title\" parameter, has been resolved.\r\n# COMPONENT: BUG Fixed: Notice messages displayed, if an item id hasn't images, the intro or the full image (only in joomla 2.5.x).\r\n+ COMPONENT and MODULE: New Parameter added: You can sort the months by newest or oldest first.\r\n# BUG Fixed at backend: 500 - An error has occurred. JHtmlBehavior: :tabstate not supported.\r\n+ ACL supported\r\n# Menu parameter has been renamed from \"page_title\" to \"ma_page_title\" for avoid conflicts with menu item title which has the same parameter name.\r\n# GENERAL CSS BUG FIXES.\r\n\r\n09-Jan-2015 : v3.2.7\r\n+ New Parameter added: Option for display or hide the article image from intro text of article.\r\n+ New Parameter added: You can display the intro or the full text image of article.\r\n+ New Parameter added: You can enter your custom dimensions (width, height) of article image.\r\n+ New Parameter added: You can use the 3rd party extension (content plugin), the \"plg_content_imgresizecache.zip\" to resize your article images and cache. http:\/\/www.s2software.it\/en\/download\/joomla-image-resize-cache\r\n\r\n17-Dec-2014 : v3.2.6\r\n+ Intro image with the intro text will be displayed in Monthly Archive.\r\n\r\n27-Nov-2014 : v3.2.5\r\n+ Parameter Added: You can select the default date format from list.\r\n+ Parameter Added: You can enter a custom date format.\r\n\r\n14-Nov-2014 : v3.2.4\r\n+ Parameter Added: You can select the type of date, of article, you want to display. There are two options, the date of created or the date of published up.\r\n# General Bug fixes\r\n\r\n01-Oct-2014 : v3.2.3\r\n# Bug fixed in Module: module conflicts with t3 template framework.\r\n# Bug fixed in Module: copyright message doesn't displayed in module.\r\n# General Bug fixes\r\n\r\n24-Sep-2014 : v3.2.2\r\n# Bug fixed: $params variable missed in router.php\r\n# Bug fixed: better sef urls for k2\r\n\r\n11-Aug-2014 : v3.2.1\r\n# Bug fixed: Notice: Undefined variable: article_link_sef\r\n# Bug fixed: wrong Item Id for multilingual menu items\r\n^ added parameter for change viewer name (Prefered Alias)\r\n# General Bug fixes\r\n\r\n24-Jun-2014 : v3.2.0\r\n+ Spanish (es-ES) language added for component & module\r\n+ Dutch (nl-NL) language added for component & module\r\n+ Italian (it-IT) language added for component & module\r\n# General Bug fixes\r\n\r\n30-May-2014 : v3.1.7\r\n^ MODULE: Accordion type: displaying the months below, if the year is active.\r\n^ COMPONENT: Mistakes fixed in german translation. Thank you guys (Mats and Philipp)!\r\n+ COMPONENT: \"ARCHIVES_ALL\" has added in translations, English, Greek, German.\r\n+ COMPONENT: Support multilingual content\r\n# Bug fixed: Accordion module not working if there is more than one module on the same page\r\n\r\n31-Jan-2014 : v3.1.6\r\n# Bug Fixed: Pagination not displayed if the limit is smaller than the count of articles (Thank Meireles for the report: http:\/\/www.joomla357.com\/forum.html?view=topic&catid=13&id=757)\r\n\r\n21-Jan-2014 : v3.1.5\r\n# Bug Fixed: Itemid issues with assigned menu item ids\r\n# Bug Fixed: Pagination for Rockettheme templates\r\n^ Greek and German language files have been edited\r\n\r\n30-Oct-2013 : v3.1.4\r\n# Bug Fixed: Error 404 after click on the module links\r\n! advanced.php has been removed from module templates\r\n\r\n22-Oct-2013 : v3.1.3\r\n+ router.php\r\n^ more friendly urls\r\n# Notice and Warning messages now have been cleared if you select Error reporting: Development or Maximum\r\n# General Bug fixes\r\n\r\n02-Sep-2013 : v3.1.2\r\n# Missing Closing Div in Accordion version\r\n# bug fixed: pagination is now working correctly\r\n# General Bug fixes\r\n\r\n19-Jul-2013 : v3.1.1\r\n+ Parameters added in component & module (INCLUDE\/EXCLUDE: k2 categories) \r\n^ Cleaned up code syntax in monthlyarchive.class.php and xml files\r\n\r\n18-Jul-2013 : v3.1.0\r\n+ Parameters added in module (INCLUDE\/EXCLUDE: articles, authors, categories) \r\n^ Many changes in monthlyarchive.class.php\r\n^ Cleaned up code syntax in module's files\r\n# General Bug fixes\r\n\r\n31-May-2013 : v3.0.5\r\n+ MODULE: style.css added in the folder \/assets\r\n+ MODULE: active class added for display the selected month\/year (default color: green, you can change it from style.css)\r\n+ MODULE: nice accordion navigation layout with jQuery\r\n# MODULE: sef urls fixed with JRoute and the correct itemID of the component\r\n^ Cleaned up code syntax in module's files\r\n# General Bug fixes\r\n\r\n26-May-2013 : v3.0.4\r\n# Bug fixed: hierarchy for categories\r\n# Bug fixed: pagination is not working correctly, default list limit always was 5  http:\/\/www.joomla357.com\/forum.html?view=topic&catid=13&id=646#919\r\n\r\n24-Mar-2013 : v3.0.3\r\n+ German language added (many thanks to Matthias Brucke - mb[@]embeteco.com)\r\n+ Added the parameter to display the empty categories in select form\r\n+ Added the parameter to display the Default List Limits, for example 5,10,20,25,50\r\n# Bug fixed: in menu item parameters\r\n# Bug fixed: legacy controllers in joomla 3.0.x version\r\n\r\n06-Mar-2013 : v3.0.1\r\n+ Display article's author alias instead of name of the author\r\n+ Display introtext in the results list\r\n+ Module: You can select if you want to open the links in a new window\r\n^ Updated translations in joomla! backend\r\n# Bug fixed: with archived and unarchived count of articles in the select boxes\r\n# Bug fixed: with page and header title\r\n# Bug fixed: double alias in sef urls\r\n+ Now you can set the page and header title from each menu item that you create\r\n^ Language files changed\r\n+ Bux fixed: Unpublished items always displayed, even if the \"finish publishing\" is smaller than today\r\n+ Now you can insert the \"Include\" or \"Exclude\" categories, from the \"select box\" instead of text input separated by comma\r\n\r\n30-Oct-2012 : v3.0.0\r\n# Bug fixed: with pagination\r\n# CSS bug fixes\r\n+ Tree format for categories and subcategories in select box of search form\r\n+ Now you can search articles for a spesific year\r\n+ Added a parameter in module, for enable or hide the count of articles beside the months\r\n+ Added the parameter \"Pagination\". If \"Yes\" there is a pagination in monthly archive, if \"No\",\r\n all article link displaying in one page without pagination.\r\n+ Now you can see the unpublished articles if you've inserted a \"publish_down\" date in content\r\n item's field.\r\n^ Language files changed\r\n! End of life Joomla! 1.5\r\n\r\n28-Mar-2012 : v2.0.8\r\n# Bug fixed for Joomla! 2.5: Only shows articles when both is selected\r\n(http:\/\/www.joomla357.com\/forum?func=view&catid=13&id=340)\r\n\r\n17-Jan-2012 : v2.0.6\r\n+ Compatible with Joomla! 2.5\r\n# Bug fixed: Time Zone (http:\/\/www.joomla357.com\/forum?func=view&catid=13&id=212)\r\n\r\n28-Dec-2011 : v2.0.5\r\n+ Compatible with the Database Type \"MySQLi\".\r\n# Bug fixed: Problem to displaying \"Archived articles\" or \"Both types (unarchived & archived)\"\r\n (The problem appeared only on joomla 1.7)\r\n# Bug Fixes\r\n\r\n22-Sep-2011 : v2.0.4\r\n+ K2: Full compatibility with JComments\r\n# K2: Fixed: Problem at results in search input text\r\n+ Added a new nice button for search input form.\r\n+ 8 new features in parameters for including or exluding Content\r\n+ Include Content\r\n+ Include Authors\r\n+ Include Articles\r\n+ Include Categories\r\n+ Include Sections\r\n+ Exlude Content\r\n+ Exclude Authors\r\n+ Exclude Articles\r\n+ Exclude Categories\r\n+ Exclude Sections\r\n+ You can display or disable anything you want in search form in frontend\r\n+ Select Months\r\n+ Select Order\r\n+ Select Author\r\n+ Select Category\r\n+ Select Comments\r\n+ Search Input\r\n# Bug Fixes\r\n\r\n16-Sep-2011 : v2.0.3\r\n+ Supports K2 for Joomla! 1.7\r\n\r\n03-Aug-2011 : v2.0.2\r\n! Joomla! 1.6 Compatible\r\n^ Changes in language files\r\n# Bug Fixes\r\n\r\n30-Jul-2011 : v2.0.1\r\n+ Display option: \"Primary order\", in the component's parameters for better order of the Archives\r\n# Bug Fixes\r\n\r\n26-Jul-2011 : v2.0.0\r\n^ Change the name of component from \"archives\" to \"monthly archive\"\r\n+ Joomla! 1.6 Compatible\r\n+ Joomla! 1.7 Compatible\r\n! Remove the Greek Language from the backend\r\n+ Search option: \"Select Author\"\r\n+ Search option: \"Select Category\"\r\n# Bug Fixes\r\n\r\n29-Mar-2011 : v1.2.0\r\n+ Intergration with K2\r\n! Remove 2 not useful classes from archives.class.php\r\n+ Copyright (link to author)\r\n^ Cleaned up more code\r\n# Bug Fixes\r\n\r\n28-Mar-2011 : v1.1.0\r\n+ Added translations: el-GR, en-GB\r\n\r\n27-Feb-2011 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2021-01-22",
        "extension_type": "Component_and_Module",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/monthly-archive",
        "more_info_url": "https:\/\/www.web357.com\/product\/monthly-archive-joomla-component-module",
        "documentation_url": "https:\/\/docs.web357.com\/category\/39-monthly-archive",
        "changelog_url": "https:\/\/www.web357.com\/product\/monthly-archive-joomla-component-module#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extension\/news-display\/articles-display\/monthly-archive\/",
        "backend_settings_url": ".\/index.php?option=com_config&view=component&component=com_monthlyarchive"
    },
    "cookiespolicynotificationbar": {
        "name": "cookiespolicynotificationbar",
        "real_name": "Cookies Policy Notification Bar",
        "product_type": "pro",
        "description": "A beautiful and functional EU Cookie Law Compliance Joomla! Plugin that provides a mechanism for informing your visitors about how you use cookies on your website in an elegant manner. It includes a variety of features and parameters (responsive, multilingual, block cookies, change style, etc.). This Joomla! plugin is ready for the GDPR Compliance which has been already implemented on ‎25 May 2018.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n\r\n<ul class=\"uk-list uk-list-striped\">\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Cookies Manager (Functionality)<\/strong> (This parameter allows the users to accept or decline specific categories of cookies. They have the full control of cookies now, and they can change their cookies preferences anytime.) [NEW FEATURE in v3.5.0]<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Block Cookies Functionality<\/strong> (The cookies are disabled, till the User clicks on the \"Accept Cookies Policy\" button)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>GDPR Ready!<\/strong> Let the user to decide if accept or decline the cookies on the browser. [NEW FEATURE in v3.3.0]<\/li>\r\n    \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>GDPR Compliance!<\/strong> Allow the user to reconsider (after acceptance), and give him the choice to delete the cookies from his browser. [NEW FEATURE in v3.3.0]<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Store User's consent into the Database<\/strong> (Functionality to record and store visitor's consent (this record is not considered a personal data). We storing only the user IP Address and the date\/time of acceptance. GDPR Rules!) [NEW FEATURE in v3.3.0]<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Shortcode Functionality.<\/strong> (You will be able to display a table with the accepted website cookies and give the opportunity to the user reconsider or delete the cookies from his browser. Example of shortcode: {cookiesinfo}.) [NEW FEATURE in v3.3.0]<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>3 Options for the 'More Info' button<\/strong> (You will be able to choose the action of the 'More Info' button. Options are, 1) Custom link, 2) Link to a menu item, 3) Modal window with your Custom Text.) [NEW FEATURE in v3.2.0]<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Multilingual Support<\/strong> (You can manage the message on the notification bar, the text buttons, the confirmation alerts, and other text-strings for each of your active languages.)<\/li>\r\n  \r\n      <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>GeoIP2 Web Service<\/strong> (Show the notification bar only in specific Continents and Countries.)<\/li>\r\n\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Cookie Expiration Time<\/strong> (Set the time that the cookie expires. If you enter 365 will set the cookie to expire in 365 days. If set to 0, the cookie will expire at the end of the session (when the browser closes)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>7 Styling Positions<\/strong> (Top, Bottom Center, Top Left, Top Right, Bottom Left and Bottom Right)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Duration<\/strong> (The duration of the message (in seconds). After this time, the notification bar will disappear)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Animate Duration<\/strong> (The duration of the animation will run (in milliseconds). Default is 2000.)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Limit<\/strong> (The limit of how many times, the notification bar, will display if the visitor does not click on the button)<\/li>\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Message<\/strong> (The Message in notification bar. HTML allowed)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Font Color<\/strong> (The Font Color. Example: #fff or #ff0000 or green etc.)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Link Color<\/strong> (The Font Color. Example: #ccc or #f2f2f9 or red, blue, black etc.)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Font Size<\/strong> (The Font Size. Default is 13px.)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Background Opacity<\/strong> (The Background Opacity of notification bar)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Background Color<\/strong> (The Background Color. Example: #000)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Styling for all buttons<\/strong> (Set the font and the background color of each button, for the default or for the on-mouse-hover action)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Custom CSS <\/strong>(Enter your custom css code)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Custom Javascript <\/strong>(Enter your custom javascript code)<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Body Cover<\/strong> (Choose if you want to allow the notification bar cover the body of the page)<\/li>\r\n     \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Locked Overlay<\/strong> (The body of the page is locked until the user Accepts or Decline)<\/li>\r\n     \r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Include or Exclude the plugin from selected pages<\/strong> (Display the cookies notification bar only in specific pages<\/li>\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Always Display (for Debugging)<\/strong> (The cookies notification bar will be displayed even if the user accepts or decline. This feature mostly used by admins in the first steps of setup and customizations.)<\/li>\r\n<\/ul>\r\n\r\n<h3 class=\"uk-h2 uk-text-center\">Why we have to install this joomla! plugin?<\/h3>\r\n<hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<p>On 26 May 2011 the European Commission made the controversial 'Cookies Directive' law. It applies to the UK and all european countries. It mandates that the use of cookies on european business websites must be disclosed and explicit consent for their use be obtained from your users, however in the UK the Information Commissioners Office (ICO) has suggested that it is sufficient to work on the basis of implied rather than explicit consent. You can find more useful information about cookies <a href=\"http:\/\/ec.europa.eu\/ipg\/basics\/legal\/cookies\/index_en.htm\" target=\"_blank\">here<\/a>.<\/p>\r\n\r\n<h3 class=\"uk-h2 uk-text-center\">This is the easiest way to manage and block cookies on Joomla! websites<\/h3>\r\n<hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<div class=\"uk-text-center uk-margin-top\">\r\n    <iframe width=\"1280\" height=\"720\" src=\"https:\/\/www.youtube.com\/embed\/h1B7ihpkfZg\" frameborder=\"0\" allowfullscreen><\/iframe>\r\n<\/div>\r\n\r\n<h3 class=\"uk-h2 uk-text-center\">How to Block Cookies and use the Cookies Manager? (TUTORIAL)<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<p>Before using the <strong>Block Cookies Functionality<\/strong> and the <strong>Cookie Manager (modal window)<\/strong> feature, please read carefully the instructions you will find in this useful guide about how to block the cookies at your Joomla! website. <a href=\"https:\/\/www.web357.com\/blog\/news\/how-to-block-cookies-in-joomla\" target=\"_blank\"><strong>Take me to the guide »<\/strong><\/a><\/p>\r\n<!-- END: Features -->",
        "stable_version": "4.0.2",
        "beta_version": "",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n19-Jan-2021 : v4.0.2\r\n+ [New Parameter] Disable ReCaptcha cookies. By default the Invisible reCAPTCHA loads some required cookies. By setting this option to Yes you can disable the cookies of Invisible reCAPTCHA (screenshot: http:\/\/bit.ly\/disableReCAPTCHACookies).\r\n# [Bug Fixed] If you place HTML\/JS code inside cpnb tags with a custom category (e.g. <cpnb data-cpnb-cookie-category-id=\"analytical-cookies\">google analytics code goes here..<\/cpnb>) the content inside cpnb tags should be hidden when a User rejects the cookies.\r\n# [Bug Fixed] The CPNB tags and the Cookies Info shortcode is not working properly when the Joomla! cache is enabled.\r\n\r\n02-Dec-2020 : v4.0.1\r\n# [Bug Fixed] Error: 0 Class 'LanguageHelper' not found.\r\n# [Bug Fixed] Can't export\/import parameters since the last update (v4.0.0) [Thank you, Alex Giral]\r\n\r\n26-Nov-2020 : v4.0.0\r\n+ [J4 ready] Fully compatible with Joomla! 4.x. Almost, all the parameters in the backend works properly.\r\n+ [New Feature] Compatible with the Web357 Licenses Key Manager (https:\/\/bit.ly\/web357-license-key-manager)\r\n+ [Improvement] Compatible with the latest version 1.8.0 of Web357 Framework.\r\n^ [Improvement] By running Google Lighthouse test, we found a problem: the cpnb_outter, cpnb_inner and cpnb-modal-close ids are used twice in the rendered page while id attributes should be unique on a page. [Many thanks to Giussepe Covino]\r\n^ [Improvement] When a user entering the site on DE language, declines all cookies, change to UK. The next time the user entered the site they get send back to the DE site. The required-session cookies from core Language Filter system plugin are now ignored. [Many thanks to Esben Laursen]\r\n^ [Improvement] The \"cpnb-cookies-manager-icon-1-64x64.png\" icon is in the plugins folder, but since typically that this folder is forbidden by robots.txt, crawlers cannot download that icon, so the icon has been moved into the media folder. [Thank you, Giuse Covino]\r\n^ [Improvement] Add validation patterns for expiration time of cookies in the plugin parameters at Joomla! backend. (e.g. ^([1-9])[\\d]{0,3}$) You can enter only digits from 1 day up to 999 days.\r\n^ [Improvement] In the language files all the \"_QQ_\" strings, have been replaced with a single quote.\r\n^ [Improvement] The JFactory::getLanguage()->getKnownLanguages(); has been replaced with LanguageHelper::getKnownLanguages(JPATH_SITE);\r\n^ [Style Improvement] Fix \"lock overlay\" z-index to avoid clicking on menu items. [Thank you, Matthias Rost]\r\n# [Bug Fixed] Some issues with templates that has a sticky menu and place the notification bar at the top, are now resolved. [Thank you, Schöffel Tobias]\r\n# [Bug Fixed] Installation issues after installing the plugin on a clean Joomla! 4.0.0-alpha-12 installation.\r\n# Minor fixes, code cleanup and improvements.\r\n\r\n12-May-2020 : v3.9.1\r\n# [Bug Fixed] When you click the \"Accept\" button on Internet Explorer 11, nothing happens. [Thank you, Joachim Kroener]\r\n# [Bug fixed] PHP Notice: Undefined index: cpnb_cookiesSettings in \/cookiespolicynotificationbar.php on line 1009.\r\n^ [Improvement] If the user has not accepted the cookies policy, block the NID google's cookie which is loaded by the Joomla! core plugin \"plg_captcha_recaptcha_invisible\" [Thank you, Alexander]\r\n# [Bug Fixed] An issue in the templates section on the Yootheme PRO builder has been resolved. [Thank you, Gauliard Cathy]\r\n\r\n06-Mar-2020 : v3.9.0\r\n+ [New Feature] Admins are able to see which categories are accepted by the users via the acceptance logs in the plugin settings.\r\n+ [New Feature] Confirmation alerts for each button separately. In \"Base Settings\" you can see a new section of parameters \"Confirmation Alerts\", for the \"Accept\", for the \"Decline\", and for the \"Delete\" button.\r\n+ [New Feature] Restore the plugin settings to the defaults. All the settings will be replaced by the default plugin settings.\r\n+ [New Feature] The cookie expiration has been splitted in two variables, the datetime and the text. Now, if you are using the shortcode functionality to display the cookies info table, you can choose the Cookie expiration (count), and the cookie Expiration (text) (for example, 30 days, or 1 year, or 2 years, etc.)\r\n+ [New Parameter fields] You can now translate the expiration text values in the shortcode info table. You can do this from the \"Texts for Languages\" tab, for each language separately. There is a new field for each of these strings (minute, minutes, hour, hours, day, days, month, months, year, years).\r\n+ [New Feature] Add a class attribute for each button separately (accept, decline, cancel, more info, settings, save, reload), where these are displayed on the cookies notification bar, on the cookies manager (modal window) and in the cookies info table (shortcode). There are 11 buttons in total.\r\n# [New Feature] Because of some European countries, for example, Italy, a new parameter field has been created to set the days of the expiration date of the cookie \"cpnb_cookiesSettings\".\r\n# [New Feature] Trigger events are now available for each function separately. You can do something after clicking on the accept, on the decline, or on the cancel button. https:\/\/docs.web357.com\/article\/52-trigger-events\r\n+ [New Feature] The \"Include or Exclude from Pages\" functionality, in Advanced Settings, has been separated in two parameter sections. The \"Show Notification Bar\" and the \"Plugin's Functionality\". With the first parameter you can show\/hide the notification bar from specific pages, and with the second you can enable\/disable the whole plugin's functionality (notification bar, cookies manager modal window and cookies info table - shortcode functionality), from specific pages. [Thank you, Giuseppe Covino]\r\n^ [SEO Improvement] Some links are indexed automatically by search engine robots (e.g. Google, Bing, Baidu, Yandex, etc.). To avoid this situation we have add the attribute rel=\"nofollow\" to all the button links. [Thank you, Piero Pavan]\r\n^ [Style improvement] The checkbox style has been replaced by the classic checkbox style.\r\n^ [Language updated] The French language files have been updated. Many thanks to Sandra Decoux (sandra@idimweb.com) for her contribution.\r\n# [Bug Fixed] Detect the total of enabled cookie categories and if there are more than one, then create the \"cpnb_cookiesSettings\" cookie. If there is only one category (e.g. the \"required-cookies\"), do not create the \"cpnb_cookiesSettings\" cookie, to help you passing the Cookiebot validation service.\r\n# [Bug Fixed] after accept check all checkboxes asynchronously. Not reload needed as before.\r\n# [Bug Fixed] In the \"Block Cookies by blocking their Javascript Code\" parameters section it is not possible to have no one item.\r\n# Minor improvements and code cleanup.\r\n\r\n13-Jan-2020 : v3.8.3\r\n+ [New parameter] Show or Hide the Cookies Manager (Modal Window) to the Logged in Users.\r\n# [Improvement] Do not load the cookie name \"cpnb_cookiesSettings\" by default, but set enable only the required cookie category if the setting cookie is not initially loaded. This improvement has been added to pass the cookiebot service. Learn more here: http:\/\/bit.ly\/pass-cookiebot-validation-in-joomla\r\n# [Bug Fixed] Do not delete the allowed forced cookies if you click on the \"Decline\" button, inside the Cookies Manager (modal window) [Many thanks to Alexis Kourkoulos]\r\n# Minor fixes and improvements.\r\n\r\n06-Sep-2019 : v3.8.2\r\n+ [New feature] Force allow cookies. Sometimes we need to ensure that all the required cookies will be loaded successfully even if the user has declined the cookies policy. For this reason and only we are now able to force allow some cookies by adding the cookie names in the new parameter field. More info: http:\/\/bit.ly\/cpnb-force-alow-cookies\r\n# [Bug Fixed] Do not display the cookie manager icon in iframes.\r\n# [Bug Fixed] Display the cookie expiration in the cookies info table if a cookie name is a regex.\r\n^ [SEO Improvement] Missing ALT attribute to the image of the Cookies Manager (the one displayed on bottom-left corner).\r\n# Minor bug fixes and code improvements.\r\n\r\n13-May-2019 : v3.8.1\r\n# [Bug Fixed] Errors after upgrading to Yootheme PRO builder v1.19.x. Session cookies should not be blocked during editing Yootheme PRO Builder articles\/pages. [Thank you, Hervé Palmier]\r\n\r\n10-Apr-2019 : v3.8.0\r\n# [Bug Fixed] If the cookie category has been selected by admin as \"checked by default\" for loading the cookies in the first time visit, the javascript code should not be blocked if the user does not accept. This issue only affects when you are using the <cpnb> tags in your template files.\r\n# [Bug Fixed] If you are using the <cpnb> tags for specific categories, (for example: <cpnb data-cpnb-cookie-category-id=\"analytical-cookies\">...<\/cpnb>), in your template (.php) files, there is an error with the closing tag <\/cpnb>. [Many thanks to Alvaro]\r\n# [Bug Fixed] Sessions should not be blocked during editing an article\/page through the Yootheme PRO page Builder. [Thank you, Stefanie Krause]\r\n^ [Language Files] All the language files have been updated with all the new strings of latest parameters. (da-DK, de-DE, el-GR, en-GB, fr-FR, it-IT, nl-NL, ru-RU).\r\n\r\n14-Mar-2019 : v3.7.9\r\n# [Bug Fixed] If the parameter \"Include\/Exclude from Pages\" is enabled, kill the plugin from any excluded page.\r\n\r\n28-Feb-2019 : v3.7.8\r\n+ [New Parameter] Show\/Hide the Cookies Manager (Modal Window) only in specific pages. [Many thanks to Alvaro]\r\n^ [Improvement] The parameter \"Categories of Cookies\" is now available for modifications even if the Cookies Manager (Modal Window) is disabled.\r\n# [Bug Fixed] An issue with com_mijoshop cart has been resolved.\r\n^ [Improvement] The cache of mojishop will now be deleted after deleting\/disabling cookies. [Thank you, Toni, from Idilicstudio S.L]\r\n! [Deleted files] A few unnecessary files from GeoIP2 Web Service directory have been removed.\r\n\r\n14-Feb-2019 : v3.7.7\r\n# [Bug Fixed] The \"Import Parameters\" button is working again.\r\n# [Bug Fixed] PHP Notice: Undefined property: plgSystemCookiesPolicyNotificationBar::$current_url in cookiespolicynotificationbar.php on line 1883 [Thank you, Alexander Schuch]\r\n\r\n07-Feb-2019 : v3.7.6\r\n# [Bug Fixed] Parse error: syntax error, unexpected in script.helper.php on line 59. [Joomla! 2.5.x].\r\n^ [Styling Improvement] Fix checkbox label height in the Cookies Manager (modal window).\r\n\r\n15-Jan-2019 : v3.7.5\r\n# [Bug Fixed] The \"Accept\" button is not working if the \"Cookies Manager (Modal Window) functionality\" is disabled. [Thank you, Laurent GARIN]\r\n\r\n15-Jan-2019 : v3.7.4\r\n+ [New Parameter] Hide the notification bar after X seconds. The notification bar will disappear after X seconds. If you choose the 'Always Display' option, the notification bar will be displayed until the visitor clicks on an action button (Accept, Decline or Cancel). [Thank you, Vivi]\r\n# [Bug Fixed] Do not renew the user session on each page load, after clicking on the \"Cancel\" button. This fix is for admins who use the Google Analytics service. [Thank you, Jean-Pierre DP]\r\n# [Bug Fixed] The \"lib\" folder was missing. The GeoIP2 Webservice works properly now. [Thank you, Douglas Gordon]\r\n# [Improvement] The cookie \"cpnb_cookiessettings\", will not be loaded anymore in the first-page load. It will be loaded only after a user action (after clicks on the action button, accept\/decline\/cancel). After this improvement, your website will be marked as compliant with the Cookiebot service.\r\n\r\n24-Dec-2018 : v3.7.3\r\n# [Bug Fixed] If you are in a subpage and reload the page after accept (base settings) it redirects to the homepage.\r\n\r\n17-Dec-2018 : v3.7.2\r\n+ [New Feature] After Y pixels (e.g. 300)  of the scrolling from the top of the window, the plugin automatically accepts the cookies policy without any click needed. The notification bar is hidden automatically after reach the maximum height of scrolled pixels.\r\n^ [Improvement] To avoid conflicts with 3rd party plugins, load the modal behavior {JHtml::_('behavior.modal');} as a hidden field, instead globally in the web357 framework.\r\n# [Bug Fixed] When the notification bar is on the center of the page, and the parameters \"Locked Overlay\" and \"Reload the page after accepting\" are enabled, the body of the page stay locked after accept [Thank you, Marcin Nader]\r\n\r\n10-Dec-2018 : v3.7.1\r\n# [Bug Fixed] Acceptance logs not stored if the user clicks on the accept button, while is on an inner page.\r\n^ [Style Improvements] CSS fixes with \"Center\" position in small screens (smartphones).\r\n\r\n06-Dec-2018 : v3.7.0\r\n+ [New Feature] The click method on the \"Accept\" button, is now working asynchronously, with the AJAX method. There a new parameter in Base Settings (tab): \"Reload the page after accept\". Choose if you want to reload the page after the User clicks on the accept button. This parameter is useful if you would like to load the blocked javascript code (e.g. Google Analytics) after the user accepts the cookies policy. This feature affects only the 'Accept' button, at the notification bar. It does not affect any other buttons in the notification bar (e.g. Declined or Cancel button), or other areas like the cookies info table (shortcode), or the cookies settings modal window. [Thank you, Dennis Lai]\r\n+ [New Feature] The cookie \"cpnb_cookiessettings\" is now included in the cookies info table. This cookie is stored to check which categories of cookies are accepted or declined (e.g. Analytical Cookies, Targeted Advertising Cookies, etc.). Of course, you can change the description of this text in the plugin settings under the parameter (Cookies Settings description) in the \"Texts for Languages\" tab. [Many thanks to Fabrizio Magnoni]\r\n+ [New Feature] The Google Tag Manager scripts are now supported by specifying the cookies category ID to the <cpnb \/> attributes.  Example: &lt;cpnb data-cpnb-cookie-category-id=\"analytical-cookies\"&gt;\/\/ script code goes here&lt;\/cpnb&gt;\r\n+ [New Parameter] Show the notification bar only in the selected Continents\/countries. The notification bar will not be displayed in other continents\/countries. Supported by the GeoIP2 Webservice.\r\n+ [New Parameter] Hide the notification bar from the selected Continents\/Countries. The notification bar and its javascript files will not be loaded at the front-end. Supported by the GeoIP2 Webservice.\r\n^ [Improvement] The \"Enable confirmation alerts\" parameter in Base Settings is now disabled by default.\r\n# Several improvements and minor bug fixes.\r\n\r\n11-Oct-2018 : v3.6.2\r\n# [Bug Fixed] The double quotes should be escaped in confirmation alert messages [Many thanks to Nikolay Armianov]\r\n\r\n28-Sep-2018 : v3.6.1\r\n^ [Improvement] The Regular Expressions are now allowed in \"Cookie Names\" of the section \"Cookie Descriptions\". Example: _ga[a-zA-Z0-9]*  Screenshot: https:\/\/goo.gl\/M8wnhT [Many thanks to Kenneth C. Koppervik]\r\n# [Bug Fixed] Issues with special characters in confirmation alerts in the shortcode functionality have been resolved. [Many thanks to Cathy Gauliard]\r\n# [Bug Fixed] Do not display the Cookies Manager Icon if the Block Cookies functionality is disabled. [Thank you, Nico Dorfer]\r\n# [Bug Fixed] For those who use language overrides for the texts in the Cookies Manager (modal window), are not translated on each language, but only in the main language. [Many thanks to Idilicstudio S.L]\r\n# [Bug Fixed] The word \"Categories\" in the toggle menu of the Cookies Manager (modal window), for small devices, is now able to be translated in the language (.ini) files. [Thank you, Rob Bekke]\r\n^ [Improvement] The GDPR icon \"cpnb-cookies-manager-icon-1-64x64.png\" has been optimized via ImageRecycle. From 1.94 kilobytes to 777 bytes. [Thank you, Guillaume]\r\n^ [Improvement] The helpful screenshots in the plugin parameters have been optimized via ImageRecycle service.\r\n# [Bug Fixed] The \"cpnb_method\" variable will not be displayed anymore in the URL [Thank you, Yair Velasco]\r\n\r\n09-Aug-2018 : v3.6.0\r\n+ Fully compatible with Joomla! 4.x\r\n^ [Improvement] Better display in responsive design for the Cookies Manager (modal window).\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n^ Code Cleanup.\r\n# Minor bug fixes and many improvements.\r\n\r\n23-Jul-2018 : v3.5.5\r\n# [Bug Fixed] The break-lines are now stripped in confirmation alert messages because there were some JS errors in the console after clicking on buttons. [Thank you, Guillaume]\r\n# [Bug Fixed] Cannot read property 'addEventListener' of null.\r\n# [Bug Fixed] Error 500 The file: http:\/\/cdn.web357.com\/web357-releases.json does not exist. All HTTP:\/\/ URLs have been replaced with HTPS:\/\/. {502 Bad Gateway nginx}. [Thank you, Ea]\r\n\r\n21-Jul-2018 : v3.5.4\r\n+ [New Feature] A new parameter has been added to show or hide the \"Ok, I've understood\" button from the cookies notification bar. [Many thanks to Antonio Guerrero] \r\n+ [New Feature] If you would like to open the Cookies Manager (modal window) by another area now you can do it by clicking on a custom link, on a button or an image, using the ID attribute \"cookies\", or your custom hash link text from the plugin parameters.\r\n# [Bug Fixed] If the confirmation alert messages have single quotes, the action buttons (Ok, Decline, Cancel) are not working. [Thank you, Sebastien]\r\n# [Bug Fixed] Regardless the cookies declined after the initial consent or the user has not given his\/her initial consent, the message remains the same \"You have allowed website's cookies to be placed on your browser\". [Many thanks to Websun Ltd]\r\n^ [Language Updated] The language files for the Dutch (Netherlands) (nl-NL) language has been updated. [Thank you, Jeroen van der Horst]\r\n^ [Improvement] The \"Cookie Categories Group\" should not be displayed in the plugin settings if the \"the Cookies Manager (Modal Window) functionality\" is disabled. [Many thanks to Idilicstudio S.L.]\r\n\r\n14-Jul-2018 : v3.5.3\r\n+ [Improvement] Multilingual support for the Cookie Category Names and Descriptions in the Cookies Manager (modal window). [Thank you, Dorine Post] (Read this useful guide for more information and screenshots: https:\/\/www.web357.com\/faq\/cookies-policy-notification-bar\/how-to-translate-the-cookie-categories-in-the-cookies-manager)\r\n# [Bug Fixed] If there is at least one unpublished Cookie Category there were some javascript errors in the console after clicking on the save settings button in the cookies manager modal window.\r\n\r\n14-Jul-2018 : v3.5.2\r\n# [Bug Fixed] Could not save the plugin settings. Error: 500 String could not be parsed as XML (in French language). [Thank you, Anne Cloutier]\r\n^ [Language Updated] The language files for the Dutch (Netherlands) (nl-NL) language has been updated. [Thank you, Jeroen van der Horst]\r\n# [Bug Fixed] If the shortcode {cookiesinfo} was in a K2 content item, there were some caching issues.\r\n# [Improvement] Four default cookie categories have been added by default, even if the Admin did not save yet the plugin parameters.\r\n# [CSS Styling] Take care of dark backgrounds. The text color in the modal window should be dark because of the light (white) background.\r\n# [CSS Bug Fixed] Fix the text-wrapping in cookies info table [Thank you, Andreas Farr]\r\n# [CSS Improvements] Fix some CSS issues to support a few \"old-school\" templates.\r\n^ [Improvement] After a lot of requests from our subscribers, the \"Cookies Manager\" functionality will be disabled until the Admin enables it from the plugin settings at the backend.\r\n# [Bug Fixed] If the User clicks on the Save button, at the Cookies Manager (modal window), should delete all cookies first and then reload them again.\r\n^ [Styling Improvements] The buttons of the Shortcode functionality, under the {cookiesinfo} table, have now the same styling as the buttons in the notification bar and the buttons in the modal windows.\r\n^ [Improvement] If the user has logged in, the user ID is now stored in the Acceptance\/Declined Logs.\r\n! [Styling Improvements] The UIkit classes have been removed from the action buttons.\r\n\r\n13-Jul-2018 : v3.5.1\r\n# [Bug Fixed] Could not save the plugin settings. Error: 500 String could not be parsed as XML (Italian and German language). [Thank you, Alberto Paracchini]\r\n\r\n13-Jul-2018 : v3.5.0\r\n+ [New Feature] The Cookies Manager functionality allow users to accept or decline specific categories of cookies. They have the full control of cookies now, and they can change their cookies preferences anytime.\r\n+ [New Feature] Custom Cookies Categories (e.g. Strictly necessary, Analytical Cookies, Social Media, Targeted Advertising Cookies e.t.c.) for each Javascript Code you've added.\r\n+ [New Feature] New button \"Settings\" in the notification bar. This button opens the Cookie Manager (Modal Window). From the plugin parameters, you will be able to change also the name and the colors of this button.\r\n+ [New Feature] There is a new parameter field to upload your own custom cookies manager icon at the bottom left or bottom right of your website.\r\n+ [New Feature] New styling position. The notification bar can now be displayed also in the center of your page.\r\n+ [New Feature] There are two new parameters. 1) the \"Locked Overlay\" and the \"Overlay Color\". The body of the page is locked until the user Accepts or Declines.\r\n^ [Improvement] window.onload has been replaced with window.addEventListener('load'). [Thank you, Monique Clevis]\r\n^ [Improvement] There are new screenshots in the plugin parameters to help admins understood what each parameter does.\r\n# [Bug Fixed] Fix CSS padding issue with top-left position.\r\n# [Bug Fixed] Blank page with Fatal error: Call to undefined method JSite::isSSLConnection(). (only in Joomla! 2.5.x websites) [Thank you, Martin Freeman]\r\n^ [Language Files] The language files (da-DK, de-DE, el-GR, en-GB, fr-FR, it-IT, nl-NL, ru-RU) have been updated.\r\n! [Removed] The Ajax\/jQuery functionality has been removed permanently.\r\n\r\n28-Jun-2018 : v3.4.5\r\n+ [Backward Compatibility] The Cookies Notification Bar it works perfectly on Joomla! 2.5. A few lines of code have been added to continue supporting the Joomla! 2.5 because many of our Subscribers asked for.\r\n# [Bug Fixed] The parameter \"enable Confirmation Alerts\" is only displayed when Block Cookies is set to It should also be available when Block Cookies is set to No. The parameter should not be at the Block Cookies section. It has been moved to the Base Settings. [Thank you, Paul Hayward]\r\n^ [Improvement] The date format inside the XML has been changed. Now is displayed like this \"DD MMM YYYY\", instead of this \"YYYY-MM-DD\".\r\n\r\n27-Jun-2018 : v3.4.4\r\n+ [New Styling Feature] A new parameter has been added (The notification bar covers the body of the page, in the Styling options). Choose if you want to allow the notification bar cover or not the body of the page.\r\n+ [Improvement] Display the cookies info table (by the shortcode) even if there is only one cookie.\r\n# [Bug Fixed] Some caching issues have been resolved.\r\n# [Bug Fixed] The submenu items of some templates are not displayed properly.\r\n# [Bug Fixed] Could not save the plugin settings. Error: 500 String could not be parsed as XML.\r\n\r\n25-Jun-2018 : v3.4.3\r\n+ [New Feature] A new parameter has been added to disable the jQuery\/Ajax functionality. (You can disable this functionality if you've detected any conflicts with other jQuery libraries, or issues with Joomla! cache or any issues with speed optimized plugins like the JCH Optimize.)\r\n+ [New Feature] Set Cookies expiration time for each cookie (Accept, Decline, Cancel).\r\n+ [New Feature] A new parameter has been added to help admins easily Import\/Export the plugin parameters.\r\n+ [New Feature] New styling positions have been added (Top Left, Top Right, Bottom Left, Bottom Right).\r\n^ [Improvement] In the group of parameter \"Cookie Descriptions\", you can now set also the Expiration Time for each cookie separately.\r\n+ [Improvement] The JS and CSS files are loaded as minified now.\r\n# [Bug Fixed] Some issues at the backend while editing a template via a template builder (like the Yootheme PRO builder) have been resolved now.\r\n# [Bug Fixed] If the User clicks on the Decline button inside the modal, the window should be closed.  \r\n# [Bug Fixed] Several issues with JCH Optimize plugin have been resolved successfully.\r\n^ [Updated] The language files have been updated.\r\n! [Removed] The line-height option has been removed from the plugin settings.\r\n! [Removed] The \"Google fonts\" parameter has been removed from the plugin settings.\r\n! [Removed] The \"Language Migration Tool\" is not needed anymore and has been removed.\r\n! [Removed] The \"Clean cookies from Browser!\" parameter has been removed because is not necessary anymore. We have to keep things more simple. You can use your browser to delete the cookies. \r\n\r\n28-May-2018 : v3.4.2\r\n# [Bug Fixed] Could not save the plugin settings. Error: 500 String could not be parsed as XML. (Only with Italian Translation)\r\n\r\n28-May-2018 : v3.4.1\r\n# [Bug Fixed] 500 - Unknown column 'Array' in 'where clause'. [Thank you, Chuck Smith]\r\n^ [Improvement] Block all Joomla sessions by choosing \"No\" to the Allow Sessions parameter.\r\n+ [Bug Fixed] Display the cookies info table asynchronously after the cookies deleted.\r\n^ [Improvement] Block all Joomla sessions by choosing \"No\" to the Allow Sessions parameter.\r\n# [Improvement] Get latest fonts from Google with all weights\/variants [Many thanks to Gilles Migliori]\r\n+ [Improvement] A JS helper for read\/delete cookies has been added (jquery.cookie.js)\r\n! [Removed] The version jquery-1.8.3.min.js has been removed and replaced with Joomla's jQuery version JHtml::_('jquery.framework', false);\r\n^ [Updated] The Italian (it-IT) translation has been updated. New strings have been added [Thank you, Alberto Paracchini]\r\n\r\n21-May-2018 : v3.4.0\r\n+ [New Feature] You can now control shortcode's content in any language without editing the .ini files. You have three text areas which you can change 1) The text BEFORE Accept\/Decline, 2) The text AFTER Accept, 3) The text AFTER Decline.\r\n+ [New Feature] You can use two new shortcodes in your custom texts. 1) The {cpnb_cookies_info_table} (Display a table of website's served cookies), and 2) {cpnb_buttons} (Display the Allow\/Delete\/Reload buttons)\r\n+ [New Feature] More input texts in the plugin settings to take control of some strings in any language without editing the .ini files.\r\n+ [New Feature] Block Cookies by blocking their Javascript Code (Advanced Settings tab). You can block the javascript code that uses cookies. Add the full javascript code in each textarea form field. The javascript code (with its cookies) will not be displayed in the page source if the user does not click on the accept button.\r\n+ [New Feature] You can give descriptions for specific cookies. (For example, for the cookie \"_ga\" you can write this: \"Used to collect Google Analytics data.\").\r\n+ [New Feature] Cancel Button has been added to the cookies notification bar. The 'Cancel' button just hides the notification bar and display the bar again on the next page after refresh. [Thank you, Michael Maass]\r\n+ [New Feature] Instead of the \"OK, I've understood\" button in the modal popup window, now also displayed the \"Decline\" and the \"Cancel\" button. [Thanks, Michael Maass]\r\n+ [New Feature] The \"Always Display\" functionality is back. The cookies notification bar will be displayed even if the user accepts or decline. This feature mostly used by admins in the first steps of setup and customizations.\r\n^ [Improvement] Always store acceptance\/declined logs (in the database), not only if the \"Block Cookies\" parameter is enabled.\r\n^ [Improvement] If special characters are used in the text of notification bar and the \"mbstring\" and \"iconv\" PHP functions are missing, do not return any PHP errors. [Thank you, Antti Saarikoski]\r\n^ [Improvement] Do not load anything in the dom (HTML code, CSS inline code, JS code or files, etc.), if the plugin has selected to be hidden on the chosen page(s) from the plugin settings.\r\n^ [Improvement] The \"cookiesDeclined\" cookie is now displayed in the cookies info table. [Thank you, Sena Emilio]\r\n^ [Improvement] The \"Delete Cookies\" functionality in the schortcode, can now delete also the \"cookiesDeclined\" cookie. [Thank you, Sena Emilio]\r\n^ [Improvement] Display the notification bar again asynchronously, after the user clicks on the \"Delete Cookies\" button at the shortcode area.\r\n^ [Improvement] The shortcode parameters have been moved outside of the advanced settings (tab), and now have their own tab in the plugin settings.\r\n! [Removed] The \"Display Accepted Cookies Table\" parameter has been removed. Instead you can use the shortcode {cpnb_cookies_info_table}.\r\n# [Typo Error] Should be \"Texts for Languages\", not \"Texts for Lanugages\", in the blue box header at the plugin settings. [Thank you, Laurent Marcelin] \r\n# [Bug Fixed] Warning: count(): Parameter must be an array or an object that implements Countable (only in PHP v7.2.x).\r\n# [Bug Fixed] The scrolling in modal is not displayed properly if we have a big list of logs (acceptance\/declined) in the plugin settings.\r\n# [Bug Fixed] Some small issues that detected in the Joomla Debug Console have been resolved.\r\n^ [Updated] The German (de-DE) translation has been updated. [Many thanks to Michael Maass]\r\n^ [Updated] The Danish (da-DK) translation has been updated. New strings have been added [Thank you, Thomas Thrane]\r\n^ [Updated] The Italian (it-IT) translation has been updated. New strings have been added [Thank you, Alberto Paracchini]\r\n\r\n18-May-2018 : v3.3.8\r\n+ NEW BUTTON: The \"Decline\" button has been added to the notification bar. And of course is multilingual like other buttons.\r\n+ NEW PARAMETER: Hide cookies from the cookies table (comma separated). With this new parameter, you can hide some preferred cookies from the table. This option will not block the cookies from the browser, it just hiding them.\"\r\n+ The German (de-DE) translation has been added [Many thanks to Michael Maass]\r\n# CSS BUG FIXED: The modal window should be displayed in front of other elements, even the notification bar.\r\n# BUG FIXED: Do not return a blank 500 error page, but instead display a warning message if the required extensions 'mbstring' and 'iconv' are disabled from the server.\r\n# BUG FIXED: Javascript TypeError: Cannot read property 'w357_show_in_iframes' of undefined.\r\n# JS Issue: Check if the cpnb_config variable is defined without any JS errors, and then use it.\r\n# BUG Fixed: Add the base URL in front of Ajax URLs to avoid 404 error pages in subpages. [Many thanks to Claudia and Tim Austin]\r\n# BUG FIXED: Some caching issues, after the user accepts the cookies policy, have been resolved.\r\n# BUG FIXED: You can change the input texts for languages even if the plugin is not published yet, without lose any translations you've entered before.\r\n# Bug Fixes for Joomla! 2.5 and backward compatibility. Some lines of code have been added to continue to support Joomla! 2.5. and to avoid blank pages in the plugin settings. [Thank you, Andreas Ebert]\r\n# Minor bug fixes and code improvements.\r\n\r\n12-May-2018 : v3.3.7\r\n# CSS BUG FIXED: Opacity setting affects the \"Bar\" as a whole. We now use RGBA instead of HEX colors. The background color of the notification bar, and the background color of the buttons, are now based on RGBA functionality. [Thank you, Michael Maass]\r\n# BUG FIXED: The 'cpnb_confi'g javascript variable was empty because there are issues with uf8 characters in the language files. [Thank you, Guido Pier]\r\n# BUG FIXED: There was a conflict with the plugin \"System - TM Wrapper\", and causes errors with notification bar (has not be displayed). We've added some options for the 'json_encode' function and the problem has been resolved. [Thank you, Kees de Goeijer]\r\n! The background opacity parameter field has been deleted. Instead, you can use the Background color and choose the opacity with the RGBA function. [Thank you, Michael Maass]\r\n# The utf8 encoding with some special characters, mostly in German language, has been resolved.\r\n# BUG FIXED: Some issues with the Joomla cache have been resolved.\r\n# Minor fixes.\r\n\r\n09-May-2018 : v3.3.6\r\n+ NEW PARAMETER: Allow Session Cookies. Delete only the Persistent cookies and avoid Session Cookies (This option avoid admins to logged out of Joomla Administrator).\r\n+ The View\/Delete Acceptance Logs has been improved and you can now see the logs asynchronously without refreshing the entire browser tab.\r\n# BUG Fixed: There were some javascript issues (auto redirection every second) with Android devices and older versions of iPhone [Thank you, Gianluca Pantaleo]\r\n# BUG Fixed: Logs are not stored in websites with older versions of PHP.\r\n# Minor bug fixes and code improvements.\r\n! A method has been added to delete some unneeded old files which are not needed anymore. 1) \\plugins\\system\\cookiespolicynotificationbar\\assets\\js\\custom-xx-XX.js and 2) \\plugins\\system\\cookiespolicynotificationbar\\assets\\css\\custom.css\r\n^ The Danish (da-DK) translation has been updated. New strings have been added [Thank you, Thomas]\r\n^ The Italian (it-IT) translation has been updated. New strings have been added [Thank you, Alberto]\r\n\r\n08-May-2018 : v3.3.5\r\n# BUG FIXED: When an admin tried to change the settings of the plugin, he got a \"500 String could not be parsed as XML\" error message. The issue has been detected by admins who have as the default language for the backend the Danish and Italian.\r\n+ The Danish (da-DK) translation has been updated. [Thank you, Thomas]\r\n+ The Italian (it-IT) translation has been updated. [Thank you, Alberto]\r\n\r\n07-May-2018 : v3.3.4\r\n+ NEW PARAMETER: There is a new parameter to control if you want to enable the confirmation messages after clicking on the buttons. The Block Cookies functionality has to be enabled to enable the new parameter «Enable Confirmation Alerts».\r\n+ NEW PARAMETER: There is a new parameter to set the border-width and the border-color of the notification bar.\r\n+ The Danish (da-DK) translation has been added. Translated by: Thomas Thrane (Thrane.nu) [Many thanks to Thomas for his contribution]\r\n+ The Italian (it-IT) translation has been added. Translated by: Alberto Paracchini [Many thanks to Alberto for his contribution]\r\n+ The «Shortcode functionality {cookiesinfo}» is working also without the need to enable the «Block Cookies» functionality. [Thank you, Chris Elliott]\r\n^ HTML\/CSS FIXES: The entire CSS code has been rewritten. Many of the selectors in HTML\/CSS have been changed because of CSS validation rules.\r\n# BUG FIXED: Even there are some javascript errors by your template, the jquery ajax functionality will still work without any problems.\r\n^ HTML\/CSS FIXED: The HTML table which displays the served cookies by the website is now responsive. [Thank you, Peter Mochnaľ]\r\n^ The «Clean cookies!» functionality at the back-end (for Debuggers), has been improved. (File: \\elements\\rmvcookies.php)\r\n# BUG FIXED: When an admin tried to change the settings of the plugin, he got a \"500 String could not be parsed as XML\" error message. There was a small issue in all other language files, except English file.\r\n^ The «limit» parameter, in the Base Settings, is displayed only if the «Block Cookies» parameter is disabled.\r\n^ Do not load the \/jquery.cookiesdirective.js and style.css if the user already accepted the cookies policy, except if needed for the shortcode functionality.\r\n# BUG Fixed: Load the custom CSS styling only at the front-end.\r\n# CSS Issue: We don't use anymore the @import method to load the google fonts. We include the google fonts as external URLs now.\r\n^ The CSS styling has been now validated by the W3C CSS Validation Service.\r\n# JS Issue: The animated effect is working again. There was an error with the wrong type of \"w357_animate_duration\" variable.\r\n# Caching issues have been resolved [Thank you, Arte Ferro srl]\r\n# Minor bug fixes and code improvements.\r\n\r\n03-May-2018 : v3.3.3\r\n# BUG FIXED: The -ms-filter properly has been removed because of XML errors after saving the plugin parameters \"500 String could not be parsed as XML\".\r\n\r\n03-May-2018 : v3.3.2\r\n# BUG FIXED: The shortcode functionality {cookiesinfo} works properly now inside the modal window with your custom text. [Many thanks to Peter Mochnaľ]\r\n# BUG FIXED: After saving the plugin settings, the message will be displayed in white color (#FFF), even though the configuration is set to another color (e.g. #000) [Many thanks to Martin Krüber]\r\n# BUG FIXED: There are 2 options to close the modal window. Click on the X icon at top right, and click outside of the modal window. When the window is closed by clicking on the icon then work correctly. If I close the window by clicking outside of the window, the window disappears but scrolling of page is not working anymore. [Many thanks to Peter Mochnaľ]\r\n# BUG FIXED: The custom link for the More Info is not working (it worked in the version without GDPR) [Many thanks to Peter Mochnaľ]\r\n# BUG FIXED: Have set 'Store acceptance logs into the Database' to yes, to test I've cleared cookies and accepted a couple of times - but nothing get's stored in the DB table #_plg_system_cookiespolicynotificationbar_logs [Many thanks to Quintin]\r\n^ The language files (en-GB, fr-FR, nl-NL, ru-RU) have been updated.\r\n\r\n30-Apr-2018 : v3.3.1\r\n# BUG Fixed: Confirmation dialog appears twice if you are using the shortcode functionality and after clicking on the \"Ok, I've understood\" button of the notification bar.\r\n# Use the confirmation javascript dialog only if the \"Block Cookies\" functionality is enabled from the plugin parameters. Otherwise, use the Ajax asynchronous technology.\r\n# CSS BUG FIXED: Wrong encoding for the left quote of -ms-filter CSS property.\r\n! The blockCookies & Shortcode functionality is not working on the offline websites because of user (admin) state cookie.\r\n# Minor bug fixes.\r\n\r\n28-Apr-2018 : v3.3.0\r\n+ NEW FEATURE: GDPR Ready! Let the user to decide if accept or decline the cookies on the browser.\r\n+ NEW FEATURE: GDPR Compliance (25 May 2018) - Allow the user to reconsider (after acceptance), and give him the choice to delete the website cookies from his browser.\r\n+ NEW FEATURE: GDPR Rule - Functionality to record and store visitor consent (this record is not considered a personal data). We storing only the user IP Address and date\/time of acceptance.\r\n+ NEW FEATURE: «Shortcode Functionality». You will be able to display a table with the accepted website cookies and give the opportunity to the user reconsider or delete the cookies from his browser. Example of shortcode: {cookiesinfo}.\r\n+ NEW PLUGIN: Ajax Technology. The user accepts and declines the cookie policy asynchronously using the Ajax technique.\r\n# BUG Fixed: After accepting cookies policy there is an HTML error in the debug console. Extra \"body>\" tag found. Only one \"body>\" tag should exist per document.\r\n# HTML code improvement: The tags \" and \" have be removed from the source code, after user accepting the cookies policy.\r\n# The JRequest::getVar('example') has been replaced with JFactory::getApplication()->input->get('example'), because it has been deprecated in the earlier release of Joomla 3.x.\r\n# Code improvements because of coding standards.\r\n# Minor bug fixes.\r\n^ The jQuery will not be loaded by default anymore, because of conflicts, mostly with other jQuery versions of the active Joomla template.\r\n^ New header for the heading \"Custom Javascript code\", in the plugin settings.\r\n! The «Debug Mode» parameter has been removed. You can use the «Shortcode» functionality instead.\r\n! The «Always Display» parameter has been removed. You can use the «Block Cookies» parameter instead.\r\n! The «Display a message to the user if there are blocked cookies» parameter has been removed. You can use the «Shortcode» functionality instead.\r\n\r\n29-Mar-2018 : v3.2.8\r\n+ NEW Parameter field: Custom Javascript code. You can now add your custom Javascript code, included or not, by tags to block the Javascript code before the visitor accepting the cookies policy.\r\n# BUG Fixed: Enable jQuery on all pages except those selected. If the admin chooses one or more pages to exclude jQuery library, all the other pages should load the jQuery.\r\n# BUG Fixed: We don't support anymore the PHP 5.3.x, but there was a small issue with some subscribers who still use this old version of PHP.\r\n\r\n28-Mar-2018 : v3.2.7\r\n+ NEW FEATURE: There are new options for the load jQuery parameter field. A) load jQuery on all pages, B) Do not load jQuery on any page, C) load jQuery on specific pages. Sometimes you will need to enable the jQuery library only on some pages because of some conflicts, from other components, with different versions of jQuery. This option will help you to do that. [Many thanks to Marek Sobczak]\r\n# Minor fixes.\r\n# Cleanup some lines of code.\r\n\r\n16-Mar-2018 : v3.2.6\r\n^ The Demo and the JED link have been updated in the description tab, at Joomla! backend.\r\n! The Web357 Download ID parameter field has been deleted from each extension settings and has been replaced by a unique API key parameter field at the Web357 Framework plugin settings.\r\n+ A new button (Settings) has been added to the description tab at Joomla! backend.\r\n^ Compatible with the latest version (1.6.0) of Web357 framework plugin.\r\n\r\n26-Feb-2018 : v3.2.5\r\nBug Fixed: The element \"textsforlanguages\" should be hidden in the plugin parameters. [Thank you, Ronald]\r\n\r\n10-Jan-2018 : v3.2.4\r\n# BUG FIXED: The modal window doesn't have a scrollbar if there is much content. [Many thanks to Carlos Santos]\r\n# Fix responsive issues with the modal window in the most popular devices like Galaxy S5, Nexus 5X, Nexus 6P, iPhone 7, iPhone 7 Plus, iPhone 8, iPhone 8 Plus, iPhone X, iPad, iPad Pro.\r\n# Minor bug fixes.\r\n\r\n07-Nov-2017 : v3.2.3\r\n# Bug Fixed: Call to undefined method plgSystemCookiesPolicyNotificationBar::getLanguageNameByTag(). [Thank you, Mauro]\r\n\r\n06-Nov-2017 : v3.2.2\r\n# Bug Fixed: Missing parameters (Input texts fields for languages) if the plugin is unpublished. [Many thanks to Nina and Abbey]\r\n# Cleanup the code.\r\n# Minor bug fixes.\r\n# Not compatible anymore with older versions of Joomla! (e.g. J! 2.5.x).\r\n# Typo errors in the elements.\r\n^ Upgraded to the latest version v1.4.6 of Web357 Framework Joomla! System Plugin.\r\n\r\n27-Oct-2017 : v3.2.1\r\n+ New Feature in Advanced Settings. Language Migration Tool. In case you missed the old strings after an upgrade.\r\n# Minor bug fixes.\r\n# Code cleanup.\r\n\r\n26-Oct-2017 : v3.2.0\r\n+ NEW FEATURE: You will be able to choose the action of the 'More Info' button. Options are, 1) Custom link, 2) Link to a menu item, 3) Modal with your Custom Text. \r\n^ Now you can choose the same or different action button for each language separately. Example: The 'modal' method for the German language, and the 'assign to a menu item' method for the English language.\r\n^ The link target parameter has been moved in Texts for Languages fieldset.\r\n^ Database migrations. Some parameter fields have been renamed but you will not lose any values for your cookies message, or button texts, that you've already entered in previous versions. \r\n! Unnecessary comments have been removed from the code.\r\n# General Bug Fixes.\r\n# Styling improvements on the responsive design.\r\n\r\n05-Jul-2017 : v3.1.7\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n23-Jun-2017 : v3.1.6\r\n# BUG FIXED: Some issues with language text strings (e.g. J357_PLG_SYSTEM_COOKIES....) have been detected after the first installation before the admin save the plugin parameters. [Thank you, Yannick Wendling]\r\n^ The language files (en-GB, fr-FR, nl-NL, ru-RU) have been updated.\r\n\r\n13-May-2017 : v3.1.5\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n+ Compatible with the latest version of Web357 Framework v1.4.3.\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n\r\n12-May-2017 : v3.1.4\r\n# Bug Fixed in J! 2.5: Many of our subscribers still uses (badly) the version 2.5.x of Joomla!. We all know how dangerous it is. But, for now, we've added a small fix to still support the cookies policy notification bar also in not-up-to-date Joomla! websites [Thank you, Rafael]\r\n\r\n07-May-2017 : v3.1.3\r\n# Bug Fixed: In PHP Version 7.0.14 there are some errors in plugin parameters at Joomla! backend, on detecting correctly the active languages of the website. [Many thanks to Arkin Oksuzoglu]\r\n# Minor bug fixes.\r\n\r\n05-May-2017 : v3.1.2\r\n# BUG Fixed: After upgrading to the version 3.1.1 the text strings and other parameters data are not displayed properly, unless if the admin save again the plugin parameters. [Thank you, Thanos]\r\n\r\n04-May-2017 : v3.1.1\r\n# BUG Fixed: If the block cookies parameter was enabled, there were some issues with login authentication at the Joomla! backend.\r\n# BUG Fixed: The text strings for single language websites, do not change.\r\n# Bug Fixed: If the 'Block Cookies' parameter enabled, after clicking on the confirm button to accept the cookies policy the page is reloaded but the javascript code (e.g. google ads) is not displayed. [Thank you, Frank]\r\n# The 'remove cookies' parameter for debuggers, has been improved to allow clearing browser cookies for the specific cookie names.\r\n# Minor bug fixes.\r\n\r\n03-May-2017 : v3.1.0\r\n^ The Block Cookies functionality has been improved and many issues have been resolved.\r\n+ A very useful helper guide to help you understand how to block cookies, has been added inside the plugin parameters, under the Block Cookies parameter.\r\n+ A new parameter has been added to display a message to the user if there are blocked cookies. By enabling this option a notification message will be displayed at the frontend, on each position of the blocked script. * You can change the text of the notification message from the language overrides in Joomla! backend.\r\n! Some parameter fields about blocking cookies have been removed because this functionality has been changed.\r\n# General Bug fixes.\r\n# Minor CSS issues have been resolved.\r\n\r\n22-Mar-2017 : v3.0.8\r\n# CSS Bug Fixed: On smartphones and tablets, if you choose to display on the top, an extra gap appears at the bottom of the screen. [Many thanks to David Smith]\r\n\r\n12-Jan-2017 : v3.0.7\r\n# After the upgrade to the latest update 3.0.6, a fatal error has been displayed for a function that does not exist in Joomla! 2.5. The function is the \"addScriptVersion\", that has been replaced with \"addScript\". [Many thanks to Konzepttreu GmbH]\r\n\r\n23-Dec-2016 : v3.0.6\r\n^ JS code in the head has been replaced with a custom_xx_XX.js file in the assets folder. Each JS language file will be created automatically after each save in the plugin parameters. Many thanks to Laurent Garin.\r\n^ French language files have been updated. Many thanks to Sandra Thevenet and Marc Antoine Thevenet.\r\n+ Dutch (nl-NL) language has been added. Many thanks to Henk Gordebeke.\r\n# Minor bug fixes and speed improvements.\r\n\r\n22-Nov-2016 : v3.0.5\r\n^ Absolute URLs have been replaced with relative URLs.\r\n^ CSS in the head has been replaced with a custom.css file in the assets folder. The file will be created automatically after the first save of your parameters. [Thank you, Laurent]\r\n# Minor bug fixes.\r\n\r\n05-Jun-2016 : v3.0.4\r\n+ New Parameter: \"Show in iFrames\" has been added. You can choose if you want to show the plugin in iFrames (e.g. modal popups) [Thank you, Dan Tucker].\r\n^ Variable name for popup windows has been simplified from \"cpnb_popup_window\" to \"cpnb\".\r\n# Minor bug fixes.\r\n\r\n27-May-2016 : v3.0.3\r\n+ New Parameter added: Disable the google fonts from messages, buttons, or both of them. [Thank you, Frank Delventhal]\r\n! The $datetime variable has been removed from comments.\r\n\r\n02-May-2016 : v3.0.2\r\n# Bug Fixed: If the opacity has been set to 100, the opacity value was 0.1 instead of 1. [Thank you, Alexander Ioannidis]\r\n+ New Parameter: Choose if you want to open the 'More Info' link in a new or in a popup window with custom width and height. [Thank you, Tim Austin]\r\n# Minor bug fixes.\r\n\r\n20-Apr-2016 : v3.0.1\r\n# Bug Fixed: Some jQuery conflicts with JoomGallery component have been resolved, and both extensions are working properly on the same page now. [Thanks, Josef Brandner]\r\n\r\n13-Apr-2016 : v3.0.0\r\n+ New Parameter: You can select a Google Font Family for the message and buttons.\r\n+ New Parameter: You can choose if you want to show or hide the \"More Info\" button.\r\n+ New Parameter: You can select a Google Font Family for the message and buttons.\r\n+ New Parameter: Now you can enter a custom name for Cookie.\r\n+ New Parameter: By default, the message is displayed on the left side and the button on the right side. But, if you would like, you can choose the center alignment for the message and button(s).\r\n+ New Parameters have been added to improve the styling of buttons. You can set the border radius of button, the default background color, and the background color when the mouse is hover the button.\r\n+ A smaller header has been added to improve the plugin settings at the back-end.\r\n+ The Parameters in the backend is not on one page anymore. We improved the UX and the parameters are in different tabs for a quick edit.\r\n+ French language has been added. A big thanks to Marc-Antoine Thevenet (MATsxm).\r\n+ Russian language has been added.\r\n^ The way that we'd get the plugin parameters has been changed, because we couldn't get the params if the plugin was unpublished.\r\n^ The default text value for the button has been corrected, from \"Ok, I understand\" to \"Ok, I've understood!\" [Thanks, Alex Walker]\r\n! The error messages about the download ID, during the update of other Web357 extensions, have been resolved and have been removed.\r\n! For security reasons, the word Joomla! has been removed from the HTML comments. Example: \/* Cookies Policy Notification Bar - J! system plugin (Powered by: Web357.com) *\/ [Thanks, Robin Köhler]\r\n! Unnecessary comments have been removed.\r\n# CSS Bug fixed: After W3C CSS Validator results, the max-width: 1024x has been corrected and replaced with max-width: 1024px.\r\n# The plugin has been passed from the W3C Markup Validation Service. \r\n# Many CSS Improvements to be compatible with most popular devices.\r\n# Minor bug fixes in the code for a speed optimization.\r\n\r\n27-Jan-2016 : v2.2.8\r\n# Bug Fixed: In some browsers, there was a border one-pixel, at the bottom of the page, after the message disappears.\r\n^ CSS Improvements.\r\n\r\n27-Dec-2015 : v2.2.7\r\n# Bug Fixed: Some CSS and Javascript issues with scrolling on tablets (Lenovo, Samsung, etc.), have been resolved.\r\n\r\n08-Dec-2015 : v2.2.6\r\n# Some issues (missing language tabs, missing language files etc.) after the upgrade from v2.2.5, have been resolved.\r\n\r\n07-Dec-2015 : v2.2.5\r\n^ Updated description.\r\n^ Updated translations.\r\n\r\n23-Nov-2015 : v2.2.4\r\n+ Added compatibility to support extensions with jQuery Control, like \"System - jQuery Easy\" plugin and \"System - DJ-jQueryMonster\" plugin.\r\n# Bug Fixed: Some flags are not displayed correctly if the default language is not English.\r\n# Bug Fixed: Scrolling on tablets with android os has been resolved.\r\n# Minor bug fixes.\r\n\r\n13-Nov-2015 : v2.2.3\r\n+ NEW Parameter Field: Download ID. You need to specify your Download ID before you can receive updates for the PRO versions. For more information please follow our instructions here: https:\/\/www.web357.com\/apikey\r\n# Minor bug fixes.\r\n\r\n28-Aug-2015 : v2.2.2\r\n# Bug Fixed: Error 404 page does not operate with a Gantry template if the plugin is enabled.\r\n# Bug Fixed: Fatal error: Class 'JLanguageHelper' not found in. This bug has been fixed for the websites that still use Joomla! 1.7.\r\n# Bug Fixed: Flag image path has set to absolute URL, instead of relative.\r\n\r\n24-Aug-2015 : v2.2.1\r\n# Bug Fixed: Some issues and jQuery conflicts with JoomGallery component, have been resolved.\r\n\r\n10-Aug-2015 : v2.2.0\r\n+ BACKEND: Language flags are displayed left of each language label.\r\n+ NEW FEATURE: Debug mode has been added. You can see the list of all cookies and delete all cookies from the frontend.\r\n+ NEW PARAMETER ADDED: Block Cookies (If User does not accept the cookies policy by press the \"Ok I've understood\" button, all cookie(s) will be blocked.)\r\n+ NEW PARAMETER ADDED: Javascript Code (Some scripts like 'Google Analytics', 'Olark live chat', 'Zopim live chat' and many other javascript applications, use cookies in their javascript code. So, if we want to block the cookies of these apps before the User accepts our Cookies Policy, you have to enter the javascript code of those scripts in this field and not in the index.php of your current template.)\r\n# Minor bug fixes.\r\n\r\n25-May-2015 : v2.1.1\r\n# Bug Fixes: Lot of bug fixes have been resolved if a joomla website has the cache enabled.\r\n# jQuery conflict with Revolution Slider has been resolved.\r\n# Minor CSS fixes for responsive design.\r\n\r\n29-Apr-2015 : v2.1.0\r\n^ Improved CSS Style.\r\n+ New multi-language parameter fields: a) 'More info button text' and b) Link for the 'More info' button.\r\n+ New Feature: Clean cookies for Debug mode (If you can't see the 'Cookies Policy notification bar', click the button from parameters and then refresh your Homepage).\r\n+ New Feature: \"Always Display\" the notification bar. The notification bar will be displayed even if the User accept the Cookies Policy. This feature must be enabled only for debugging.\r\n+ New Feature: The bar is not appeared if the website is Offline.\r\n+ New Feature: Set the height and the line height of the notification bar.\r\n+ New Feature: INCULDE PAGES: Display the cookies policy notification bar only in the selected pages.\r\n+ New Feature: EXCLUDE PAGES: Do not display the cookies policy notification bar in these pages.\r\n+ New Feature: You can add your custom css.\r\n+ New Feature: Duration (ms) for animation.\r\n# General minor bug fixes in the code.\r\n\r\n23-Apr-2015 : v2.0.0\r\n+ Compatible with \"Web357Framework\" (joomla! system plugin).\r\n^ Improvement design for parameter fields (better radio buttons and color pickers).\r\n+ ADMIN: New Element: Description of extension (buttons: view demo, more details, changelog, support).\r\n+ ADMIN: New Element: Version Check.\r\n+ ADMIN: New Element: About Web357 (logo, description, find us on social media).\r\n# General minor fixes.\r\n# Clean and code improvement.\r\n\r\n29-Mar-2014 : v1.1.0\r\n# CSS Fixed: Adding !important; css rule for the link color in dark backgrounds.\r\n# Multilangual support.\r\n^ Parameter fields have been redesigned and be more useful.\r\n+ PHP functions have been added: getLangForm() and getLanguageNameByTag().\r\n^ Language folders are now inside plugin folder.\r\n# BUG Fixed: Line breaks in message don't display correctly the notification bar.\r\n+ Parameter Added: Option to load or not, the jQuery.\r\n+ BUG Fixed: jQuery conflict issues with 3rd party extensions (e.g. Virtuemart, JS Jobs etc.).\r\n\r\n13-Dec-2014 : v1.0.1\r\n# Fixed the css styling about z-index. Now the bar appears in front of any other element, e.g. logo, header banners etc.\r\n\r\n07-Oct-2014 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2021-01-19",
        "extension_type": "Plugin",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/browse\/cookies-policy-notification-bar",
        "more_info_url": "https:\/\/www.web357.com\/product\/cookies-policy-notification-bar-joomla-plugin",
        "documentation_url": "https:\/\/docs.web357.com\/category\/12-cookies-policy-notification-bar",
        "changelog_url": "https:\/\/www.web357.com\/product\/cookies-policy-notification-bar-joomla-plugin#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extension\/cookies-policy-notification-bar\/",
        "backend_settings_url": ".\/index.php?option=com_plugins&view=plugins&filter[search]=System%20-%20Web357%20Cookies%20Policy%20Notification%20Bar"
    },
    "datetime": {
        "name": "datetime",
        "real_name": "Display Date and Time",
        "product_type": "free",
        "description": "A simple, easy and nice display of the current date and time using AJAX scripting. It includes various display formats to choose from based on your preference. It supports all countries date and time formats.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Before &amp; After text <\/strong>(You can insert html text in front or at the end of date and time).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Time Zone<\/strong> (You can use multiple copies of datetime module, from different time zones, to display the time from more than one Countries in one single page.).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Date Format<\/strong> (You have a plethora of options to display the date format that match for your Country).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Date Format Separator<\/strong> (Some dates are written with dot 13.04.2015, or slash 13\/04\/2015, or dash 13-05-2015 etc.).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Text between date and time<\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Time Format<\/strong> (Static or ajax\/flashing format, e.g. 08:44:12 PM).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Display PM\/AM<\/strong> (You have the option to display or hide the PM\/AM right of the time).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Custom CSS<\/strong> (Enter your custom CSS code).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Compatible with the Igbo calendar<\/strong> (The Igbo calendar is the traditional calendar system of the Igbo people from present-day Nigeria. The calendar has 13 months in a year (afo), 7 weeks in a month (onwa), and 4 days of Igbo market days (afor, nkwo, eke, and orie) in a week (izu) plus an extra day at the end of the year, in the last month. Example: Monday, Nkwọ 08 October 2018.).<\/li>\r\n  \r\n  <\/ul>\r\n<h3 class=\"uk-h2 uk-text-center\">Specific date formats for the basic components<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> yy – Two-digit year, e.g. 96<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> yyyy – Four-digit year, e.g. 1996<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> m – One-digit month for months below 10, e.g. 4<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> mm – Two-digit month, e.g. 04    <\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> mmm – Three-letter abbreviation for month, e.g. Apr<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> mmmm – Month spelled out in full, e.g. April<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> d – One-digit day for days below 10, e.g. 2<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> dd – Two-digit day, e.g. 02<\/li>\r\n<\/ul>\r\n<!-- END: Features -->",
        "stable_version": "2.3.3",
        "beta_version": "",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n09-Jan-2021 : v2.3.3\r\n+ [New Feature] You are now able to show or hide the leading zero from the time (For example the 09:47:59, could be 9:47:59). [Thank you, Phil Leifer]\r\n\r\n28-Jan-2019 : v2.3.2\r\n^ [Styling Improvement] Do not display the DateTime in a new line if the {loadposition web357} is used inside a text. The div tags have been replaced with the span tags. [Thank you, Alistair Malcott]\r\n\r\n08-Oct-2018 : v2.3.1\r\n+ [New Feature] Added compatibility with the Igbo calendar. The Igbo calendar is the traditional calendar system of the Igbo people from present-day Nigeria. The calendar has 13 months in a year (afo), 7 weeks in a month (onwa), and 4 days of Igbo market days (afor, nkwo, eke, and orie) in a week (izu) plus an extra day at the end of the year, in the last month. Example: Monday, Nkwọ 08 October 2018. [Thank you, Emeka Agbaka]\r\n^ The translation (.ini) files have been updated.\r\n\r\n09-Aug-2018 : v2.3.0\r\n+ Fully compatible with Joomla! 4.x\r\n^ [Improvement] the online_text + offline_text variables have been removed.\r\n# [Bug Fixed] The custom date format from module parameters is not working in multilingual sites [Thank you, Hans van Haaren]\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n^ Code Cleanup.\r\n# Minor bug fixes and many improvements.\r\n\r\n29-Jan-2018 : v2.2.9\r\n+ New Feature\/Parameter: Display the Date and Time in two different rows. [Thank you, Lluís]\r\n# Some language strings have been improved at the backend.\r\n# Minor improvements.\r\n\r\n17-Oct-2017 : v2.2.8\r\n# BUG Fixed: If you choose to not display the date from the module parameters, it is displayed by default. [Many thanks to Иван Сустретов]\r\n! The 'Color' module parameter has been removed.\r\n+ The 'Custom CSS' module parameter has been added. Now you can add easily your own CSS inside the module params, without editing any of your CSS files.\r\n\r\n06-Jul-2017 : v2.2.7\r\n^ Option to display the $week variable (e.g. Week: 26) into your code. You just have to enter the into the file \"default.php\" [Thank you, Gerald Berger].\r\n\r\n05-Jul-2017 : v2.2.6\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n12-May-2017 : v2.2.5\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n+ Compatible with the latest version of Web357 Framework v1.4.3.\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n\r\n28-Feb-2017 : v2.2.4\r\n# Bug Fixed: PHP Fatal error: Redefinition of parameter $offset in \\modules\\mod_datetime\\helper.php on line 118.\r\n\r\n27-Feb-2017 : v2.2.3\r\n# Bug Fixed: Some issues with pacific ocean time zone have been resolved. [Thank you, Virtuo x.]\r\n\r\n21-Feb-2017 : v2.2.2\r\n# BUG fixed: There were some HTML Validation errors like \"Bad value for attribute datetime on element time.\" Solution: The datetime value of  tag, has been replaced with ISO 8601 date (added in PHP 5). [Thank you, Bob Pitatzidis]\r\n\r\n23-Dec-2016 : v2.2.1\r\n+ Dutch (nl-NL) language has been added. Many thanks to Henk Gordebeke.\r\n^ French language files have been updated. Many thanks to Sandra Thevenet and Marc Antoine Thevenet.\r\n^ Italian language files have been updated with corrections. Many thanks to Lorenzo de Mauro.\r\n\r\n15-Dec-2016 : v2.2.0\r\n+ The date format parameter list has been updated. The below joomla! date format options have been added, based on your language file (DATE_FORMAT_LC, DATE_FORMAT_LC1, DATE_FORMAT_LC2, DATE_FORMAT_LC3, DATE_FORMAT_LC4, DATE_FORMAT_LC5, DATE_FORMAT_JS1). [Many thanks to Radovan for his suggestion].\r\n+ A new input parameter has been added to adjust the date format if none of the options in the list does fit your needs.\r\n^ Language files have been updated.\r\n# Minor bug fixes.\r\n\r\n09-Jun-2016 : v2.1.0\r\n# Bug Fixed: When using the ajax\/flashing option, the time is faster than user's machine. When using the static option it works well. [Thank you, Stewart McMaster]\r\n\r\n22-Feb-2016 : v2.0.9\r\n# Bug Fixed: The front and the end text, are not displayed.\r\n\r\n15-Jan-2016 : v2.0.8\r\n# Bug Fixed: Issues with UTC time from towns like Kolkata, Adelaide, Bengaluru, Mumbai, Tehran, Darwin, Caracas, Kabul, and others, have been resolved.\r\n^ Better MVC Format.\r\n^ Compatible with HTML5 datetime Attribute.\r\n+ CSS file added mod_datetime\/tmpl\/default.css.\r\n\r\n08-Dec-2015 : v2.0.7\r\n# Minor bug fixes after the latest upgrade from v2.0.6\r\n\r\n07-Dec-2015 : v2.0.6\r\n^ Updated description.\r\n^ Updated translations.\r\n\r\n12-Nov-2015 : v2.0.5\r\n+ Russian (ru-RU) language has been added. Thanks bizt, https:\/\/www.web357.com\/forum\/question\/2144-solved-translite-russian.\r\n\r\n15-Oct-2015 : v2.0.4\r\n# Minor bug fixes.\r\n\r\n05-Sep-2015 : v2.0.3\r\n+ Language Added: Portuguese (Brazil) [pt-BR]. Thank you so much, Edimar Pereira.\r\n\r\n30-Jul-2015 : v2.0.2\r\n# BUG Fixed: If the option \"19:32 (ajax\/flashing)\" has been selected, the am\/pm did not display properly.\r\n+ Language Added: The French language has been added, by Henba.\r\n\r\n04-Jun-2015 : v2.0.1\r\n+ NEW PARAMETER: Select a timezone (With this new parameter, you can use multiple copies of datetime module, from different time zones, to display the time from more than one Countries in one single page.)\r\n\r\n23-Apr-2015 : v2.0.0\r\n+ Compatible with \"Web357Framework\" (joomla! system plugin).\r\n^ Improvement design for parameter fields (better radio buttons and color pickers).\r\n+ ADMIN: New Element: Description of extension (buttons: view demo, more details, changelog, support).\r\n+ ADMIN: New Element: Version Check.\r\n+ ADMIN: New Element: About Web357 (logo, description, find us on social media).\r\n# General minor fixes.\r\n# Clean and code improvement.\r\n\r\n27-Mar-2015 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2021-01-09",
        "extension_type": "Module",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/date-time",
        "more_info_url": "https:\/\/www.web357.com\/product\/display-date-and-time-joomla-module",
        "documentation_url": "https:\/\/docs.web357.com\/category\/46-display-date-and-time",
        "changelog_url": "https:\/\/www.web357.com\/product\/display-date-and-time-joomla-module#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extensions\/extension\/calendars-a-events\/time\/display-date-time",
        "backend_settings_url": ".\/index.php?option=com_modules&filter[search]=Display%20Date%20and%20Time"
    },
    "supporthours": {
        "name": "supporthours",
        "real_name": "Support Hours",
        "product_type": "free_and_pro",
        "description": "This Joomla! Module displays the Support Hours from your website. It shows the date-time of your online store based on your timezone, and the current date-time of the visitor.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Multilingual Support<\/strong>.<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Four great Layouts<\/strong> (Select a design layout that fit your template's needs).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Date and Time Params<\/strong> (Set your preferred Date and Time settings based on your Country's standards).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Based on ajax\/flashing <\/strong> (You shouldn't refresh your page to refresh the times).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Texts<\/strong> (Enter your custom Texts (state, status text, main text, etc.).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Links<\/strong> (Set your links for each status (online\/offline) separately).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Holidays<\/strong> (Set Holidays. In a holiday the support is offline and a holiday message will be displayed).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Styling<\/strong> (Choose a design, enter the box width, and upload your store's image).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Custom CSS Styling<\/strong> (Enter your Custom CSS code, to avoid opening css files).<\/li>\r\n<\/ul>\r\n<!-- END: Features -->",
        "stable_version": "1.5.2",
        "beta_version": "1.6.0",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n04-Feb-2020 : v1.5.2\r\n+ The [ca-ES] Catalan language has been added. Many thanks to Web Gestio (webgestio.com) for his contribution.\r\n\r\n18-Jan-2019 : v1.5.1\r\n+ [Improvement] Increase holidays from 3 to 10 [Thank you, Eric vanbok]\r\n# [Bug Fixed] PHP Notice: A non-well formed numeric value encountered in \"\\mod_supporthours\\helper.php on line 96\"\r\n- modal behavior\r\n# [Styling Improvement] The style of the \"Opening hour\" and the \"Closing hour\" parameter fields has been fixed in the module parameters.\r\n^ [Improvement] To avoid conflicts with 3rd party plugins, load the modal behavior {JHtml::_('behavior.modal');} as a hidden field, instead globally in the web357 framework.\r\n# [Bug Fixed] The screenshots are now displayed in a modal window, instead of a new tab in your browser.\r\n\r\n09-Aug-2018 : v1.5.0\r\n+ Fully compatible with Joomla! 4.x\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n^ Code Cleanup.\r\n# Minor bug fixes and many improvements.\r\n\r\n16-Mar-2018 : v1.4.2\r\n^ The Demo and the JED link have been updated in the description tab, at Joomla! backend.\r\n! The Web357 Download ID parameter field has been deleted from each extension settings and has been replaced by a unique API key parameter field at the Web357 Framework plugin settings.\r\n+ A new button (Settings) has been added to the description tab at Joomla! backend.\r\n^ Compatible with the latest version (1.6.0) of Web357 framework plugin.\r\n\r\n05-Jul-2017 : v1.4.1\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n02-Jun-2017 : v1.4.0\r\n+ New Feature: Support break for lunch. Example: Monday - Friday, 09:00 - 13:00 & 15:00 - 19:00. [Thank you, Norbert]\r\n# Minor improvements in the module parameters.\r\n\r\n13-May-2017 : v1.3.3\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n+ Compatible with the latest version of Web357 Framework v1.4.3.\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n\r\n08-Dec-2016 : v1.3.2\r\n+ The [nl-NL] Dutch (Belgium) language has been added (Many thanks to Henk Gordebeke for his contribution).\r\n\r\n05-Oct-2016 : v1.3.1\r\n# Bug Fixed: The online\/offline status text is not displayed after upgrade to version 1.3.0. [Thank you, Vladimir Melton].\r\n\r\n04-Oct-2016 : v1.3.0\r\n+ NEW Feature: Now you can enter different texts (online\/offline status) for each day separately. [Thanks, Peter Kuko].\r\n\r\n12-May-2016 : v1.2.0\r\n# CSS Improvements in all layouts.\r\n\r\n05-May-2016 : v1.1.0\r\n+ Four new great layouts from our awesome Graphic Designer. The first layout is available in the free version, and the other three are available to the premium version.\r\n+ New parameter: Box Width. You can now set the box width. The 320px is recommended, but for responsive websites you should use the 100%.\r\n+ New parameter: Links (tab). Set the links (contact us, live chat, send email) to be displayed. You can set different links if the support department is online or offline, respectively.\r\n+ New parameter: Choose if you want to show the opening hours beside the open days.\r\n+ Many new parameters have been added to improve the layout styling (image for layout-1, change the text of the state, the texts Online-Offline, etc.).\r\n! The non-useful date formats have been removed from the list and have been replaced by the most popular. But also alternatively you can set your custom date format.\r\n! The layout that released on the first two versions, 1.0.1 and 1.0.2, has been removed.\r\n! The parameter \"text between date and time\" has been deleted.\r\n^ Better back-end. The parameters are separated into tabs, instead of one page.\r\n^ The screenshots in back-end have been updated, for a better explanation of parameters.\r\n# Bug fixed: If the holiday #1 and #2 have been enabled, the module detects the holiday #3 as enabled too.\r\n# General bug fixes.\r\n\r\n30-Mar-2016 : v1.0.2\r\n+ A new helper plugin \"plg_system_supporthours\" has been added to the package, to help premium subscribers enable the live updates by entering the download ID of their purchase.\r\n+ The \"Download ID\" parameter field has been added to enable the live updates. This field is only for the Pro versions.\r\n^ The free, and the pro version have different update files.\r\n! The error messages about the download ID, during the update of other extensions, have been resolved and have deleted.\r\n\r\n29-Mar-2016 : v1.0.1\r\n! The unnecessary comments have been removed.\r\n! The file \"timezone.php\" has been removed, because is not needed anymore. All the necessary stuff has been moved to the file \"mod_supporthours.php\".\r\n^ JED link has been updated.\r\n# Bug Fixed: jQuery loaded every second to detect the time of visitor.\r\n# 404 error image not found for the image \"dateformat.png\". The URL of the screenshot for the \"dateformat\" parameter field, has been corrected.\r\n# Minor code fixes.\r\n\r\n09-Mar-2016 : v1.0.0\r\n+ First beta release.",
        "project_type": "web357",
        "date": "2020-02-04",
        "extension_type": "Module",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/browse\/support-hours",
        "more_info_url": "https:\/\/www.web357.com\/product\/support-hours-joomla-module",
        "documentation_url": "https:\/\/docs.web357.com\/category\/44-support-hours",
        "changelog_url": "https:\/\/www.web357.com\/product\/support-hours-joomla-module#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extension\/support-hours\/",
        "backend_settings_url": ".\/index.php?option=com_modules&filter[search]=Support%20Hours"
    },
    "vmsales": {
        "name": "vmsales",
        "real_name": "Virtuemart Sales",
        "product_type": "free_and_pro",
        "description": "The Virtuemart Sales Joomla! component is a search tool that provides a list of Virtuemart products with discounts. It is supplied with a lot of features and multiple parameters and it would be ideal for e-commerce websites that were built with VirtueMart.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>MVC &amp; Multi-language support.<\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Data Type<\/strong> (You can choose if you want to display all Virtuemart products with discount or not, or both).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Image Interactivity<\/strong> (On click navigate to product's page or 2. display a lightbox gallery).<\/li>\r\n\r\n\r\n\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Include Categories<\/strong> (Choose the Categories that should not be ignored).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Include Manufacturers<\/strong> (Choose the Manufacturers that should not be ignored).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Exclude Categories<\/strong> (Choose the Categories that should be ignored).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Exclude Manufacturers<\/strong> (Choose the Manufacturers that should be ignored).<\/li>\r\n\r\n\r\n\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Advanced Search Form <\/strong>(See below the Search form details list).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Product Layout <\/strong> (You have the option to choose if share buttons, question link, view more button, or description will be displaying).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Other Options<\/strong> (You have the option to set limit for product's title or description)<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Display prices with tax or not.<\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Display only featured producs <\/strong>(Select if you want to display only featured products or all)<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Social sharing buttons<\/strong> (Facebook, Twitter etc.)<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Copyright Message<\/strong> (Of course you can hide the copyright message if you want).<\/li>\r\n  <\/ul>\r\n<p><small>Full configuration in parameters, at joomla! back-end. You can change everything! (See the screenshots below).<\/small><\/p>\r\n\r\n<h3 class=\"uk-h2 uk-text-center\">Search form options<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Select the Search Type. All virtuemart products or products with discount or  products without discount.<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Select products from a Category.<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Select products from a Manufacturer.<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Sort results by most recent first, oldest first, price high to low, low to high, discount high to low or low to high. <\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Search via input text. Enter some characters or the entire word, from product's title, the short or the full description.<\/li>\r\n<\/ul>\r\n<!-- END: Features -->",
        "stable_version": "7.1.5",
        "beta_version": "7.1.6",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n15-Oct-2020 : v7.1.5\r\n+ Compatible with the latest version of VirtueMart v3.8.4x.\r\n# [Bug Fixed] Internal Server Errors after upgrading to v3.8.4x have been resolved. [Thank you, Daniela Ferraro]\r\n# [Bug Fixed] Share buttons FB and Twitter, the urls are relative and not absolute with the domain, so there's an error when we click to share.\r\n# [Bug Fixed] Notice: Undefined variable: childId in \/components\/com_vmsales\/models\/vmsales.php\r\n+ [New feature] A new parameter in component settings, \"Primary order\", to set the default product sorting.\r\n+ [New option] Added a new option in the \"Sort by\" filter. a) \"Weight hight to low\" and b) \"Weight low to high\".\r\n^ Updated translations: fr-FR\r\n\r\n26-Nov-2019 : v7.1.4\r\n+ Compatible with the latest version of VirtueMart v3.6.10x.\r\n^ [Improvement] Show only included or excluded categories in the category filter. [Thank you, Christopher]\r\n^ [Improvement] Show only included or excluded manufacturers in the manufacturer filter. [Thank you, Christopher]\r\n\r\n21-Oct-2019 : v7.1.3\r\n+ Compatibility with v3.6.2 of VirtueMart.\r\n# [Bug Fixed] jQuery conflict issues have been resolved.\r\n# [Bug Fixed] Blank page in VM Sales settings after upgrade to the VirtueMart version v3.6.2. [Thank you, Rossiniy Gamberea]\r\n\r\n13-May-2019 : v7.1.2\r\n# [Bug Fixed] If the website is multilingual and the texts for the products are stored in multiple languages, there was an issue with the search form results. [Many thanks to Giovanni]\r\n\r\n02-Nov-2018 : v7.1.1\r\n# [Bug Fixed] Do not show the products if their category is unpublished [Thank you, Georg]\r\n# [Bug Fixed] Warnings with VM Manufacturers and VM Categories (Include\/Exclude) parameter fields at the backend have been resolved successfully.\r\n# Minor bug fixes and many improvements, mostly in the FREE version.\r\n# Minor styling improvements in the settings.\r\n\r\n09-Aug-2018 : v7.1.0\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n^ Code Cleanup.\r\n# Minor bug fixes and many improvements.\r\n\r\n16-Mar-2018 : v7.0.2\r\n^ The Demo and the JED link have been updated in the description tab, at Joomla! backend.\r\n! The Web357 Download ID parameter field has been deleted from each extension settings and has been replaced by a unique API key parameter field at the Web357 Framework plugin settings.\r\n+ A new button (Settings) has been added to the description tab at Joomla! backend.\r\n^ Compatible with the latest version (1.6.0) of Web357 framework plugin.\r\n\r\n28-Feb-2018 : v7.0.1\r\n# BUG FIXED: Compatibility issues with older versions of Virtuemart have been resolved \"\\plugins\\system\\web357framework\\elements\\vmcategoriesp.php\". [Many thanks to Andrea Riquelme]\r\n\r\n20-Dec-2017 : v7.0.0\r\n+ NEW FEATURE: Multi currency is now supported. [Thank you, Peter London]\r\n+ NEW FEATURE: Include the parameters also in the menu items to have different settings in multiple menu items.\r\n+ NEW FEATURE: The Metadata options are now supported in Menu Item and you can set the meta description, the meta keywords, and the robots for each menu item you create. [Thank you, Jacobo]\r\n^ The product categories are now linkable.\r\n^ UIkit CSS framework has been updated to UIkit 3.0.0-beta.35\r\n^ The 'scope' mode of UIkit has been added to avoid conflicts with other versions of UIkit or other websites which using Yootheme templates.\r\n^ You can select multiple categories and manufacturers in the parameters, instead of entering IDs.\r\n^ Display the first image of the product instead of a random image. [Thank you, Jacobo]\r\n^ In menu item settings now we use the useglobal=\"true\" instead of the JGLOBAL_USE_GLOBAL. This method allows you to know which are exactly the global values of global configuration.\r\n^ The free version has more unlocked parameter fields.\r\n! Some parameter fields have been removed because are not needed anymore. (Currency, custom symbol, currency position, default ordering for categories and manufacturers).\r\n! Unnecessary comments have been removed.\r\n# The link \"Questions about this product?\" is working now as expected.\r\n# Better search results.\r\n# General bug fixes in product discount calculations.\r\n# Many CSS styling improvements and minor fixes in responsive design.\r\n\r\n05-Jul-2017 : v6.0.8\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n13-May-2017 : v6.0.7\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n+ Compatible with the latest version of Web357 Framework v1.4.3.\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n\r\n12-Mar-2017 : v6.0.6\r\n+ The SKU product's field is searchable now. [Thank you, Jacobo]\r\n# Bug Fixed: If a product had an override price same as the final price, should not be displayed in the discounted products list.\r\n# Bug Fixed: If a product has multiple prices for each shopper group separately, are displayed correctly now.\r\n! Some unnecessary comments have been removed.\r\n# Minor bug fixes.\r\n\r\n27-May-2016 : v6.0.5\r\n+ Two new parameters have been added: Choose if you want to display the Parent and the Child products that are out of stock.\r\n# Minor bug fixes.\r\n\r\n16-May-2016 : v6.0.4\r\n+ New Parameter has been added: Choose the type of products will be displayed (Only Parent products or Parent & Child products).\r\n\r\n12-May-2016 : v6.0.3\r\n+ New Parameter has been added: Choose if you want to display the products that are out of stock. [Thank you, Vladimir N. Solopov]\r\n! The unnecessary comments have been removed from the 'default.php' file.\r\n# The error messages about the download ID, during the update of other Web357 extensions, have been resolved and have been removed.\r\n# Minor bug fixes.\r\n# CSS minor fixes.\r\n\r\n09-Mar-2016 : v6.0.2\r\n+ NEW FEATURE: Set the number of displayed products per row.\r\n# BUG FIXED: The style of pagination has been fixed to supporting templates from templatemela.com.\r\n\r\n04-Feb-2016 : v6.0.1\r\n# Some issues with Joomla! 2.5, after upgrade from version 6.0.0, have been resolved.\r\n# BUG Fixed: Fatal error: Call to undefined method JComponentHelper::isInstalled().\r\n! PNG images have been removed and replaced with CSS design.\r\n# CSS minor fixes.\r\n\r\n04-Feb-2016 : v6.0.0\r\n# Bug Fixed: If a product is not assigned at least to one category, is not displayed in the list.\r\n# Bug Fixed: Discount in an entire Category, is now applied.\r\n# Bug Fixed: Multiple shopper groups are supported now.\r\n# Bug Fixed: If a discount hasn't an expiration day, the product has not discount.\r\n# Bug Fixed: Page title and Page heading are now editable from the menu item params.\r\n# Bug Fixed: If pagination is disabled, notices and warning messages are displayed.\r\n# Bug Fixed: If a discounted product is not marked as featured, but you want to show only the featured products, it still appears on the list.\r\n# General bug fixes (PHP, MySql).\r\n+ Responsive design, based on UIkit (getuikit.com).\r\n+ The component stops working if the VirtueMart component is not installed or not enabled at your Joomla! website.\r\n+ Social links have been improved for better social sharing.\r\n+ Social images have been replaced by the font awesome icons.\r\n+ You can use the page class from menu item params to give a custom style per menu item.\r\n! Unnecessary comments have been cleared.\r\n! Unnecessary parameters have been removed (the header background, and the header text color).\r\n! Colorbox js library has been deleted.\r\n^ The assets folder is moved to the \"tmpl\" directory, of default layout.\r\n^ The inline CSS code, has been moved to the style.css file.\r\n^ Cleaner, lighter code, and better MVC format based on Joomla! coding standards.\r\n\r\n19-Jan-2016 : v5.1.6\r\n# Product's small description (product_s_desc) is now searchable.\r\n+ New Parameter Field: Default Language (Select your default language. If your website is multilingual, you should choose the 'All' option.)\r\n# Some conflicts with other jQuery versions, have been resolved.\r\n\r\n14-Jan-2016 : v5.1.5\r\n^ Colorbox (the jQuery lightbox for product images), updated to the latest version 1.6.3.\r\n^ jQuery is updated to the latest version 1.12.0.\r\n# Bug Fixed: \"Notice: Use of undefined constant nul - assumed 'nul' in \/libraries\/legacy\/model\/legacy.php on line 207\".\r\n\r\n08-Dec-2015 : v5.1.4\r\n# Minor bug fixes after the latest upgrade from v5.1.3\r\n\r\n07-Dec-2015 : v5.1.3\r\n^ Updated description.\r\n^ Updated translations.\r\n\r\n13-Nov-2015 : v5.1.2\r\n+ NEW Parameter Field: Download ID. You need to specify your Download ID before you can receive updates for the PRO versions. For more information please follow our instructions here: https:\/\/www.web357.com\/apikey\r\n\r\n25-Sep-2015 : v5.1.1\r\n+ NEW PARAMETER: You can choose which type of description for display, the short or the full product description.\r\n+ NEW PARAMETER: You can choose which HTML tags are allowed for the description.\r\n# BUG Fixed: If a Tax & Calculation Rule has an expiration date, the product displayed to the discounted products list, it shouldn't be displayed.\r\n# BUG Fixed: If a Tax & Calculation Rule is not published, the product displayed to the discounted products list, it shouldn't be displayed.\r\n# BUG Fixed: # BUG Fixed: The count of Categories and Manufacturers in the form fields, is calculated properly now.\r\n# BUG Fixed: Image ordering doesn't work properly.\r\n# Minor bug fixes\r\n\r\n14-May-2015 : v5.1.0\r\n+ ACL supported.\r\n+ FREE version available.\r\n# Bug fixed: If you choose the option \"Display products WITHOUT discount\", displays all products, also those with discount.\r\n# Bug fixed in Joomla! 2.5: \"500 - An error has occurred. JHtml: :jquery not supported. File not found.\"\r\n\r\n23-Apr-2015 : v5.0.0\r\n+ Compatible with \"Web357Framework\" (joomla! system plugin).\r\n^ Improvement design for parameter fields (better radio buttons and color pickers).\r\n+ ADMIN: New Element: Description of extension (buttons: view demo, more details, changelog, support).\r\n+ ADMIN: New Element: Version Check.\r\n+ ADMIN: New Element: About Web357 (logo, description, find us on social media).\r\n# General minor fixes.\r\n# Clean and code improvement.\r\n\r\n28-Mar-2015 : v4.2.5\r\n# Bug Fixed: If the core Virtuemart component is not installed correctly, an error message is displayed.\r\n# Bug Fixed: If the default rules have not been set correctly, the default price will display.\r\n# CSS issues: Price displaying at left, instead of right.\r\n# General Bug Fixes\r\n\r\n04-Dec-2014 : v4.2.4\r\n# Bug Fixed: Warning: mb_substr() expects parameter 3 to be long\r\n# General Bug Fixes\r\n\r\n24-Nov-2014 : v4.2.3\r\n# Bug Fixed: Warning: utf8_to_unicode: Incomplete multi-octet sequence in UTF-8 (for Greek characters)\r\n^ Strip html tags from product's description\r\n\r\n14-Oct-2014 : v4.2.2\r\n# Bug Fixed: The product's url has the category name in.\r\n^ Avoid conflict issues and don't load jQuery if lightbox is not selected for image's interactivity.\r\n! Unnecessary javascript files and code have been removed.\r\n\r\n09-Oct-2014 : v4.2.2\r\n# Bug Fixed: There was a problem with links (view more button, product title and product image), if the component installed on a subfolder of subdomain.\r\n\r\n07-Oct-2014 : v4.2.0\r\n+ Compatible with Joomla! v3.3.x\r\n^ Compatible with the latest version of Virtuemart (v2.6.10), for Joomla! 2.5.x\r\n^ Compatible with the latest version of Virtuemart (v2.9.9), for Joomla! 3.3.x\r\n# Bug Fixed: jQuery conflict issues have been resolved\r\n# Bug Fixed: Free products now has 100% discount percentage\r\n# General Bug Fixes\r\n\r\n03-Sep-2014 : v4.1.5\r\n# Bug fixed: ssl products links did not working properly for the social sharing links.\r\n\r\n30-May-2014 : v4.1.4\r\n# Bug fixed: when you go to categories and select a category you see all products not just the ones with discount (thanks, Balazs Hende)\r\n+ New option in config! Is not longer necessary to mark a product as featured in virtuemart back-end. There is an option to display only featured products or all products.\r\n\r\n23-Nov-2013 : v4.1.3\r\n+ New Parameter has been added: Custom Currency\r\n+ New Parameter has been added: Currency Position\r\n\r\n22-Oct-2013 : v4.1.2\r\n# Bug fixed with selected variables after submit form\r\n# Other bug fixes\r\n\r\n11-Oct-2013 : v4.1.1\r\n+ £ symbol added for british pounds\r\n\r\n24-Jul-2013 : v4.1.0\r\n+ New Parameter has been added: You can display the product types you want:\r\n::: ALL virtuemart products WITH discount\r\n::: ALL virtuemart products WITHOUT discount\r\n::: ALL virtuemart products\r\n+ New Parameter has been added: Show or not the Search type field from the search options\r\n# Bug fixed: Display the products with no Manufacturers\r\n\r\n18-Jul-2013 : v4.0.0\r\n^ Compatible with the latest version of Virtuemart (v2.0.22a)\r\n+ Manufacturers parameter added and now you can select products from one or more manufacturers\r\n+ Parameter added: You can sort the categories by name alphabetically (asc, desc) or by id (asc, desc)\r\n+ Parameter added: EXCLUDE\/INCLUDE (categories, manufacturers)\r\n^ Cleaned up code syntax\r\n# General bug fixes\r\n\r\n03-Jul-2013 : v3.0.2\r\n# Bug fixed: wrong percentage discount\r\n\r\n26-May-2013 : v3.0.1\r\n^ Compatible with the latest version of Joomla! (v2.5.11)\r\n^ Compatible with the latest version of Virtuemart (v2.0.20b)\r\n^ Cleaned up code syntax\r\n# General small bug fixes\r\n\r\n01-Feb-2013 : v3.0.0\r\n+ Joomla! 2.5 compatible!\r\n# Bug fixed: Prices with tax\r\n^ Updated translations: en-GB\r\n^ Cleaned a lot of code\r\n^ Changed some language strings\r\n! Removed ability to install on Joomla 1.6 and 1.7\r\n! End of life Joomla! 1.5\r\n\r\n05-Dec-2012 : v2.0.0\r\n# Fixed security issue in search form\r\n^ Changed language files to be J1.6 ready\r\n^ Cleaned up some code\r\n^ Updated translations: en-GB\r\n\r\n22-Apr-2012 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2020-10-15",
        "extension_type": "Component",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/virtuemart-sales",
        "more_info_url": "https:\/\/www.web357.com\/product\/virtuemart-sales-joomla-component",
        "documentation_url": "https:\/\/docs.web357.com\/category\/43-virtuemart-sales",
        "changelog_url": "https:\/\/www.web357.com\/product\/virtuemart-sales-joomla-component#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extension\/virtuemart-sales\/",
        "backend_settings_url": ".\/index.php?option=com_config&view=component&component=com_vmsales"
    },
    "k2multiplecategories": {
        "name": "k2multiplecategories",
        "real_name": "Multiple Categories for K2",
        "product_type": "pro",
        "description": "With this Joomla! plugin, you can assign multiple categories for K2 items. This plugin leaves the K2 core and the template files untouched. The categories are also displayed at the backend and are countable.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n\r\n<ul class=\"uk-list uk-list-striped\">\r\n\r\n    <li><i class=\"uk-icon-thumbs-o-up\"><\/i> Migrate from the 3rd party plugin \"Additional Categories for K2\".<\/li>\r\n\r\n<\/ul>\r\n<!-- END: Features -->\r\n\r\n<h3 class=\"uk-h2 uk-text-center\">How to migrate from other plugins<\/h3>\r\n<hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<div class=\"uk-text-center uk-margin-top\">\r\n    <iframe width=\"1280\" height=\"720\" src=\"https:\/\/www.youtube.com\/embed\/-xzH3xIHVCA\" frameborder=\"0\" allowfullscreen><\/iframe>\r\n<\/div>",
        "stable_version": "1.3.1",
        "beta_version": "",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n20-Oct-2020 : v1.3.1\r\n+ [New Feature] You can now set which user groups are able to manage the multiple categories of K2 items.\r\n\r\n28-Sep-2020 : v1.3.0\r\n+ Added compatibility with the \"RAXO All-mode K2 extension\". Read the instructions here http:\/\/bit.ly\/raxo-allmode-compatibility\r\n^ [MySQL Improvements] For the websites that have more than 50k K2 items, the performance has been improved.\r\n\r\n18-Jun-2020 : v1.2.10\r\n# [Bug Fixed] The K2 pagination is not displayed if the Falang extension is enabled. [Thank you, Virgili Paez]\r\n\r\n12-May-2020 : v1.2.9\r\n+ [Improvement] The functionality is also available in the latest k2 items and in User's page view.\r\n+ Compatible with the latest version of K2 v2.10.3\r\n# [Bug Fixed] Fatal error: Cannot declare class K2ModelItemlist.\r\n# Minor fixes and improvements.\r\n\r\n06-Mar-2020 : v1.2.8\r\n# [Bug Fixed] K2 missing some items in the backend.\r\n# [Bug Fixed] Do not list K2 items, that are assigned to multiple categories, several times.\r\n# [Bug Fixed] Cannot declare class modK2ContentHelper, because the name is already in use.\r\n# [Bug Fixed] If the catalog mode has been set from menu item settings, some items are missing in the frontend.\r\n\r\n19-Feb-2020 : v1.2.7\r\n+ [New feature] Added compatibility with Widgetkit extension by Yootheme. If you are using the Widgetkit extension by Yootheme, with the new update release you can override the default K2 content type and display K2 items that assigned in multiple categories. [Many thanks to Tom Hollai for the feature request]\r\n\r\n13-Jan-2020 : v1.2.6\r\n# [Buf Fixed] Warning: Declaration of K2ModelItems::addIncludePath() should be compatible with K2Model::addIncludePath($path = '', $prefix = 'K2Model') in \/plugins\/system\/k2multiplecategories\/overrides\/admin\/components\/com_k2\/models\/items.php\r\n# [Buf Fixed] Notice: Undefined variable: total in \/plugins\/system\/k2multiplecategories\/overrides\/admin\/components\/com_k2\/views\/items\/view.html.php\r\n\r\n16-Dec-2019 : v1.2.5\r\n# [Buf Fixed] Many bug fixes have been resolved after upgrade to the latest versions of K2 (v2.10.x).\r\n# [Buf Fixed] The pagination at the backend, in the Items page, is working properly now.\r\n# [Bug Fixed] The pagination (next-prev link buttons) is missing in the sub-categories pages, both at the backend and frontend. [Thank you, Alex Asimakopoulos]\r\n# [Bug Fixed] Database error code 1052. Column 'language' in where clause is ambiguous.\r\n# [Improvements] Compatible with the latest version of K2 v2.10.2\r\n\r\n19-Jun-2019 : v1.2.4\r\n+ [Improvement] Now you are able to assign multiple categories in items from the frontend. [Thank you, Christos Chronopoulos]\r\n+ [Improvement] Now you are able to order\/sort the items in the backend also by the subcategories , instead the main categories as before. [Thank you, Frank Lauridsen]\r\n\r\n10-Apr-2019 : v1.2.3\r\n# [Bug Fixed] When the \"Multiple Extra Field Groups for K2\" is used at the K2 backend, some tabs are not displayed properly.\r\n\r\n03-Jan-2018 : v1.2.2\r\n# [Bug Fixed] The Items are not displayed in the admin panel of the K2 component if an additional category is selected from the \"-Select Category-\" field. [Thank you, Anton]\r\n\r\n10-Dec-2018 : v1.2.1\r\n# [Bug Fixed] Error with pagination results, in K2 category pages, if the plugin is enabled.\r\n\r\n07-Dec-2018 : v1.2.0\r\n^ [Improvement] The \"mod_k2_content\" module is now supported.\r\n# [Bug Fixed] Illegal offset type of variables in the \"mod_k2_tools\" module.\r\n# [Bug Fixed] Fixed issues with jQuery loading spinner after migrating from the plugin \"Additional Categories for K2\".\r\n^ [Imrovements] The text string \"in\" has been removed (by jQuery) from the k2 core modules, if our plugin is enabled.\r\n# Minor bug fixes and many improvements.\r\n\r\n08-Nov-2018 : v1.1.0\r\n+ [New Feature] Migrate from the plugin \"Additional Categories for K2\". Navigate to the (system) plugin settings to find this feature.\r\n# [Bug Fixed] Not allowing unset multiple categories after save.\r\n# [Bug Fixed] Add SQL indexing [Thank you, Dave Marshall]\r\n# [Bug Fixed] Do not display the list with categories if the parameter has been set to \"Do not display categories\" in component and module settings.\r\n# Minor bug fixes\r\n\r\n05-Nov-2018 : v1.0.1\r\n# [Bug Fixed] Wrong closing \"div\" tag. [Many thanks to Daniel Burri]\r\n\r\n19-Oct-2018 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2020-10-20",
        "extension_type": "Plugin",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/multiple-categories-for-k2",
        "more_info_url": "https:\/\/www.web357.com\/product\/multiple-categories-for-k2-joomla-plugin",
        "documentation_url": "https:\/\/docs.web357.com\/category\/36-multiple-categories-for-k2",
        "changelog_url": "https:\/\/www.web357.com\/product\/multiple-categories-for-k2-joomla-plugin#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extension\/multiple-categories-for-k2\/",
        "backend_settings_url": ""
    },
    "vmcountproducts": {
        "name": "vmcountproducts",
        "real_name": "Virtuemart Count Products",
        "product_type": "free",
        "description": "A Joomla! module that displays the count of active, inactive, or featured products of Virtuemart. Text can be added before and after the counted number.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Before &amp; After text <\/strong>(You can insert HTML text in front or at the end of count).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Virtuemart's Link<\/strong> (Enter the link to the Virtuemart).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Type of Products<\/strong> (Count the Active, Inactive or Featured products).<\/li>\r\n<\/ul>\r\n<!-- END: Features -->",
        "stable_version": "4.1.0",
        "beta_version": "4.1.1",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n09-Aug-2018 : v4.1.0\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n^ Code Cleanup.\r\n# Minor bug fixes and many improvements.\r\n\r\n05-Jul-2017 : v4.0.5\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n13-May-2017 : v4.0.4\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n+ Compatible with the latest version of Web357 Framework v1.4.3.\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n\r\n16-Mar-2016 : v4.0.3\r\n+ An error message is displayed if the VirtueMart component is not installed or not enabled.xxx\r\n+ Compatible with the latest version of VirtueMart 3.0.14.\r\n# Bug Fixed: error Deprecated: Non-static method mod_vmcountproductsHelper::getActiveProducts() should not be called statically.\r\n# Bug Fixed: error Deprecated: Non-static method mod_vmcountproductsHelper::getInactiveProducts() should not be called statically.\r\n# Bug Fixed: error Deprecated: Non-static method mod_vmcountproductsHelper::getSpecialProducts() should not be called statically.\r\n\r\n08-Dec-2015 : v4.0.2\r\n# Minor bug fixes after the latest upgrade from v4.0.1\r\n\r\n07-Dec-2015 : v4.0.1\r\n^ Updated description.\r\n^ Updated translations.\r\n\r\n23-Apr-2015 : v4.0.0\r\n+ Compatible with \"Web357Framework\" (joomla! system plugin).\r\n^ Improvement design for parameter fields (better radio buttons and color pickers).\r\n+ ADMIN: New Element: Description of extension (buttons: view demo, more details, changelog, support).\r\n+ ADMIN: New Element: Version Check.\r\n+ ADMIN: New Element: About Web357 (logo, description, find us on social media).\r\n# General minor fixes.\r\n# Clean and code improvement.\r\n\r\n26-May-2013 : v3.0.1\r\n^ Compatible with the latest version of Joomla! (v2.5.11)\r\n^ Compatible with the latest version of Virtuemart (v2.0.20b)\r\n^ Cleaned up code syntax\r\n! language files has been removed, we do not need these any more\r\n! Removed ability to install on Joomla! 1.5, 1.6 and 1.7\r\n! Joomla! 1.5 is not supported any more\r\n\r\n25-Feb-2013 : v3.0.0\r\n+ You can link the for count of products in the module parameters.\r\n+ You can add html in text fields in the module parameters.\r\n+ Language files added\r\n\r\n29-Jan-2013 : v2.0.0\r\n^ Compatible with the latest version of Joomla! (v2.5.6)\r\n^ Compatible with the latest version of Virtuemart (v2.0.0)\r\n^ Joomla! 1.5 version is not supported any more\r\n# Other Bug Fixes\r\n\r\n23-Jun-2010 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2018-08-09",
        "extension_type": "Module",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/virtuemart-count-products",
        "more_info_url": "https:\/\/www.web357.com\/product\/virtuemart-count-products-joomla-module",
        "documentation_url": "",
        "changelog_url": "https:\/\/www.web357.com\/product\/virtuemart-count-products-joomla-module#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extension\/count-products-for-virtuemart\/",
        "backend_settings_url": ".\/index.php?option=com_modules&filter[search]=Virtuemart%20Count%20Products"
    },
    "contactinfo": {
        "name": "contactinfo",
        "real_name": "Contact Info",
        "product_type": "pro",
        "description": "Τhe easiest way to display your website's contact information. This module allows you to specify various company information details such as a logo, social media links, and other contact info.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Fully customizable with many parameters.<\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Responsive Web Design.<\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Multilingual Support.<\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>MVC support.<\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Based on Joomla! coding standards.<\/strong><\/li>\r\n<\/ul>\r\n    \r\n<h3 class=\"uk-h2 uk-text-center\">Many Useful Parameters<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Style<\/strong> (Vertical or Horizontal layout).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Label Type<\/strong> (Text Label or Icon).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Icons<\/strong> (Fontawesome icons or upload your custom icons for social media links).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Text Before<\/strong> (You can enter a text that will be displayed before the information).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Text After<\/strong> (You can enter a text that will be displayed after the information).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Contact Information<\/strong> (You can specify various contact information details such as a logo, company name, slogan, phone number, fax number, mobile phone number, email address and website).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Address Information<\/strong> (You can specify various address information details such as address, city, state, zip code and country).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Social Media Links<\/strong> (You can enter the links of your social media such as the Facebook, Twitter, Google+, Instagram, Linkedin, Vimeo, Pinterest, and Behance).<\/li>\r\n<\/ul>\r\n<!-- END: Features -->",
        "stable_version": "1.1.0",
        "beta_version": "1.2.0",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n09-Aug-2018 : v1.1.0\r\n+ Fully compatible with Joomla! 4.x\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n^ Code Cleanup\r\n# Minor bug fixes and many improvements\r\n\r\n16-Mar-2018 : v1.0.3\r\n^ The Demo and the JED link have been updated in the description tab, at Joomla! backend.\r\n! The Web357 Download ID parameter field has been deleted from each extension settings and has been replaced by a unique API key parameter field at the Web357 Framework plugin settings.\r\n+ A new button (Settings) has been added to the description tab at Joomla! backend.\r\n^ Compatible with the latest version (1.6.0) of Web357 framework plugin.\r\n\r\n02-Nov-2017 : v1.0.2\r\n+ Youtube icon\/link has been added in the module parameters. [Thank you, Patrick]\r\n# Minor bug fixes.\r\n\r\n05-Jul-2017 : v1.0.1\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n16-May-2017 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2018-08-09",
        "extension_type": "Module",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/contact-info",
        "more_info_url": "https:\/\/www.web357.com\/product\/contact-info-joomla-module",
        "documentation_url": "https:\/\/docs.web357.com\/category\/45-contact-info",
        "changelog_url": "https:\/\/www.web357.com\/product\/contact-info-joomla-module#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extension\/contact-info\/",
        "backend_settings_url": ".\/index.php?option=com_modules&filter[search]=Contact%20Info"
    },
    "countdown": {
        "name": "countdown",
        "real_name": "Countdown",
        "product_type": "free",
        "description": "A simple Joomla! module that counts down the time until one or multiple events is scheduled to commence. It can also be used as a countdown for the release of a new website that is currently under construction.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Date <\/strong>(Enter the date of Event).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Time<\/strong> (Enter the time of Event).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Front text <\/strong>(The text before the &quot;count down&quot; timer).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>End text <\/strong>(The text after the &quot;count down&quot; timer).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Finish text<\/strong> (The text that will displayed after the end of Event).<\/li>\r\n<\/ul>\r\n<!-- END: Features -->",
        "stable_version": "3.2.1",
        "beta_version": "",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n02-Sep-2018 : v3.2.1\r\n^ [Improvements] Fix issues for the browser IE 8 and below.\r\n# [Bug Fixed] Cannot set property 'innerHTML' of null.\r\n\r\n09-Aug-2018 : v3.2.0\r\n+ Fully compatible with Joomla! 4.x\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n^ Code Cleanup.\r\n# Minor bug fixes and many improvements.\r\n\r\n08-Oct-2017 : v3.1.0\r\n# Joomla! template overrides are now supported in the module. You can now create your own layouts avoiding changes after the module upgrades. Ensure that you take a backup of your CSS file before this upgrade because the path and the name have been changed. [Many thanks to Jay B Hall]\r\n\r\n05-Jul-2017 : v3.0.7\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n12-May-2017 : v3.0.6\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n+ Compatible with the latest version of Web357 Framework v1.4.3.\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n\r\n10-Aug-2016 : v3.0.5\r\n^ The Olympic Games 2016 have been removed from the default XML data, because have been started, and have been replaced by Fifa World Cup 2018 in Russia.\r\n^ Some fields are not required anymore.\r\n\r\n28-Mar-2016 : v3.0.4\r\n^ The default XML data have been changed.\r\n\r\n08-Dec-2015 : v3.0.3\r\n# Minor bug fixes after the latest upgrade from v3.0.2\r\n\r\n07-Dec-2015 : v3.0.2\r\n^ Updated description.\r\n^ Updated translations.\r\n\r\n13-Nov-2015 : v3.0.1\r\n# Bug Fixed: wrong file path for mod_countdown.css\r\n\r\n23-Apr-2015 : v3.0.0\r\n+ Compatible with \"Web357Framework\" (joomla! system plugin).\r\n^ Improvement design for parameter fields (better radio buttons and color pickers).\r\n+ ADMIN: New Element: Description of extension (buttons: view demo, more details, changelog, support).\r\n+ ADMIN: New Element: Version Check.\r\n+ ADMIN: New Element: About Web357 (logo, description, find us on social media).\r\n# General minor fixes.\r\n# Clean and code improvement.\r\n\r\n14-Nov-2014 : v2.2.0\r\n+ CSS file has been added \"assets\/css\/mod_countdown.css\", for your custom styling.\r\n\r\n24-Jul-2013 : v2.1.0\r\n+ Support multiple countdown module in the same page\r\n! countdown.js has been removed\r\n\r\n26-May-2013 : v2.0.0\r\n+ align, color, and fontsize parameters has been removed because you can get a nice result if you add the \"\r\n.countdown\" class in your current template\r\n+ Supported for Joomla! 2.5.x, Joomla! 3.0.x and Joomla! 3.1.x\r\n^ Cleaned up code syntax\r\n^ Changed some language strings\r\n^ Updated translations: en-GN, el-GR\r\n! Removed ability to install on Joomla! 1.5, 1.6 and 1.7\r\n! Joomla! 1.5 is not supported any more\r\n\r\n08-Feb-2009 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2018-09-02",
        "extension_type": "Module",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/countdown",
        "more_info_url": "https:\/\/www.web357.com\/product\/countdown-joomla-module",
        "documentation_url": "https:\/\/docs.web357.com\/category\/47-countdown",
        "changelog_url": "https:\/\/www.web357.com\/product\/countdown-joomla-module#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extensions\/extension\/calendars-a-events\/events\/count-down",
        "backend_settings_url": ".\/index.php?option=com_modules&filter[search]=Countdown"
    },
    "failedloginattempts": {
        "name": "failedloginattempts",
        "real_name": "Failed Login Attempts",
        "product_type": "free_and_pro",
        "description": "This Joomla! Plugin records the failed and successful login attempts into the back-end and front-end of your Joomla! website. It is useful for security purposes and serves as an information pool to track malicious user access (IP, country, browser, OS, etc.).",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Enable logs for backend<\/span><\/strong> (Store the Failed login attempts of joomla! backend).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Enable logs for frontend<\/span><\/strong> (Store the Failed login attempts of joomla! frontend).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Successful Login Attempts<\/span><\/strong> (Store the Successful login attempts of joomla! frontend).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Direct E-mail Notifications<\/span><\/strong> (Receive direct notifications via email about the Failed and Successful login attempts of joomla! backend and frontend).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Store Logs in the Database<\/span><\/strong> (Store all, successfull or failed, login attempts in the database).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Data Storing: IP Address<\/span><\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Data Storing: Username<\/span><\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Data Storing: Password<\/span><\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Data Storing: Date Time<\/span><\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Data Storing: Country<\/span><\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Data Storing: Browser<\/span><\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong><span class=\"uk-width-4-10 uk-text-right\">Data Storing: Operating System<\/span><\/strong><\/li>\r\n<\/ul>\r\n<!-- END: Features -->",
        "stable_version": "2.2.0",
        "beta_version": "2.3.0",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n09-Aug-2018 : v2.2.0\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n^ Code Cleanup.\r\n# Minor bug fixes and many improvements.\r\n\r\n16-Mar-2018 : v2.1.0\r\n^ Functions Improved: The getOS() and the getBrowser() functions have been updated to get the most recent Operating Systems and Browsers.\r\n# BUG Fixed: The datetime gets now the correct offset from the joomla configuration.\r\n# BUG Fixed: The modal behavior is missing. Now the logs are displayed properly in a modal popup window.\r\n^ The Demo and the JED link have been updated in the description tab, at Joomla! backend.\r\n! The Web357 Download ID parameter field has been deleted from each extension settings and has been replaced by a unique API key parameter field at the Web357 Framework plugin settings.\r\n+ A new button (Settings) has been added to the description tab at Joomla! backend.\r\n^ Compatible with the latest version (1.6.0) of Web357 framework plugin.\r\n\r\n17-Jul-2017 : v2.0.8\r\n+ New Parameter: The \"Fix Ordering\" button has been added. Sometimes you need to click on that button to make sure that the plugin has been set as a priority between other authentication plugins.\r\n# Minor bug fixes.\r\n\r\n05-Jul-2017 : v2.0.7\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n12-May-2017 : v2.0.6\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n+ Compatible with the latest version of Web357 Framework v1.4.3.\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n+ NEW Parameter Field: Download ID. You need to specify your Download ID before you can receive updates for the PRO versions. For more information please follow our instructions here: https:\/\/www.web357.com\/apikey\r\n\r\n08-Dec-2015 : v2.0.5\r\n# Minor bug fixes after the latest upgrade from v2.0.4\r\n\r\n07-Dec-2015 : v2.0.4\r\n^ Updated description.\r\n^ Updated translations.\r\n\r\n13-Nov-2015 : v2.0.3\r\n# Minor bug fixes.\r\n\r\n02-Oct-2015 : v2.0.2\r\n^ The mail() php function has been replaced by Joomla's api function JFactory::getMailer.\r\n\r\n09-May-2015 : v2.0.1\r\n^ The \"footer\" element has been changed to reordering the plugin, for the right storing of  \"Successful login attempts\".\r\n^ Direct notifications are now available in the FREE version.\r\n^ Save Logs to Database are available only in PRO version.\r\n^ Minor fixes in language file.\r\n\r\n23-Apr-2015 : v2.0.0\r\n+ Compatible with 'Web357Framework' (joomla! system plugin).\r\n^ Improvement design for parameter fields (better radio buttons and color pickers).\r\n+ ADMIN: New Element: Description of extension (buttons: view demo, more details, changelog, support).\r\n+ ADMIN: New Element: Version Check.\r\n+ ADMIN: New Element: About Web357 (logo, description, find us on social media).\r\n# General minor fixes.\r\n# Clean and code improvement.\r\n\r\n12-Dec-2014 : v1.1.0\r\n+ One mysql table has inserted and now the data will be stored in the new sql table named #__failed_login_attempts_logs.\r\n+ FREE and PRO version are available.\r\n# Security issue with store data in a visible html file, has been resolved. The plugin will not store the data in the html file anymore\r\n# General bug fixes.\r\n\r\n08-Nov-2014 : v1.0.1\r\n# Bug Fixed: Date is always showing 11th, in log file.\r\n\r\n17-Sep-2014 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2018-08-09",
        "extension_type": "Plugin",
        "live_demo_url": "https:\/\/www.web357.com\/product\/failed-login-attempts-joomla-plugin",
        "more_info_url": "https:\/\/www.web357.com\/product\/failed-login-attempts-joomla-plugin",
        "documentation_url": "https:\/\/docs.web357.com\/category\/42-failed-login-attempts",
        "changelog_url": "https:\/\/www.web357.com\/product\/failed-login-attempts-joomla-plugin#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extension\/failed-login-attempts\/",
        "backend_settings_url": ".\/index.php?option=com_plugins&view=plugins&filter[search]=Authentication%20-%20Failed%20Login%20Attempts"
    },
    "fixedhtmltoolbar": {
        "name": "fixedhtmltoolbar",
        "real_name": "Fixed HTML Toolbar",
        "product_type": "free",
        "description": "A fixed toolbar at the bottom of your current Joomla! template, with up to 10 linked icons or just HTML code. This Joomla! plugin is useful for the display of social media icons or any other static content during page scrolling.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Background color <\/strong>(Select your color from the color picker).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Border Color<\/strong><strong> <\/strong>(Select your color from the color picker).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Border thickness <\/strong>(in pixels).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Alignment <\/strong>(Left, center or right).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>HTML Text<\/strong> (Enter your html text for the toolbar).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Space between images<\/strong><\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>10 Images and their Links<\/strong><\/li>\r\n<\/ul>\r\n<!-- END: Features -->",
        "stable_version": "3.2.0",
        "beta_version": "",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n01-Jun-2020 : v3.2.0\r\n+ [New Parameters] \"Alt\" tags for the images\/icons. This new feature resolves the SEO analysis on Joomla sites that were always coming up with \"alt\" tag errors for the various social media icon images. [Thank you, Michael Bittle]\r\n\r\n09-Aug-2018 : v3.1.0\r\n+ Fully compatible with Joomla! 4.x\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n^ Code Cleanup.\r\n# Minor bug fixes and many improvements.\r\n\r\n10-Mar-2018 : v3.0.9\r\n# NEW FEATURE: Now you can load any module position in HTML parameter field using this code {loadposition position}. [Thank you, Goran Nešić]\r\n\r\n05-Jul-2017 : v3.0.8\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n13-May-2017 : v3.0.7\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n+ Compatible with the latest version of Web357 Framework v1.4.3.\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n\r\n22-Apr-2017 : v3.0.6\r\n# Fix CSS issues with Internet Explorer 11. [Thank you, José Fernandes]\r\n\r\n29-Nov-2016 : v3.0.5\r\n+ Allowed HTML code in the textarea parameter field. [Thank you, Ric]\r\n+ New Parameter allows you to choose the position (top or bottom) of the fixed HTML toolbar. [Thank you, Fran Garcia]\r\n\r\n08-Dec-2015 : v3.0.4\r\n# Minor bug fixes after the latest upgrade from v3.0.3\r\n\r\n07-Dec-2015 : v3.0.3\r\n^ Updated description.\r\n^ Updated translations.\r\n\r\n19-Oct-2015 : v3.0.2\r\n# Minor Bug Fixes\r\n\r\n18-Sep-2015 : v3.0.1\r\n^ Module's name changed because it conflicted with joomla's core admin toolbar module.\r\n# CSS issues have been resolved.\r\n\r\n23-Apr-2015 : v3.0.0\r\n+ Compatible with \"Web357Framework\" (joomla! system plugin).\r\n^ Improvement design for parameter fields (better radio buttons and color pickers).\r\n+ ADMIN: New Element: Description of extension (buttons: view demo, more details, changelog, support).\r\n+ ADMIN: New Element: Version Check.\r\n+ ADMIN: New Element: About Web357 (logo, description, find us on social media).\r\n# General minor fixes.\r\n# Clean and code improvement.\r\n\r\n19-May-2014 : v2.0.3\r\n# Fixed: Issues with firefox have been resolved\r\n\r\n15-Jan-2014 : v2.0.2\r\n# Fixed: Allow add html in parameters field from module manager\r\n\r\n03-Jul-2013 : v2.0.1\r\n! default values has been removed from xml\r\n\r\n26-May-2013 : v2.0.0\r\n+ color, fontsize and bold parameters has been removed because you can get a nice result with module suffix\r\n+ Supported for Joomla! 2.5.x, Joomla! 3.0.x and Joomla! 3.1.x\r\n^ Cleaned up code syntax\r\n! Removed ability to install on Joomla! 1.5, 1.6 and 1.7\r\n! Joomla! 1.5 is not supported any more\r\n\r\n11-Aug-2009 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2020-06-01",
        "extension_type": "Module",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/fixed-html-toolbar",
        "more_info_url": "https:\/\/www.web357.com\/product\/fixed-html-toolbar-joomla-module",
        "documentation_url": "https:\/\/docs.web357.com\/category\/48-fixed-html-toolbar",
        "changelog_url": "https:\/\/www.web357.com\/product\/fixed-html-toolbar-joomla-module#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extension\/toolbar\/",
        "backend_settings_url": ".\/index.php?option=com_modules&filter[search]=Fixed%20HTML%20Toolbar"
    },
    "loginasuser": {
        "name": "loginasuser",
        "real_name": "Login as User",
        "product_type": "pro",
        "description": "This plugin helps admin users to login to the front-end as a specific user. It is useful for websites where the admin user needs to check if a user can see their order(s) correctly, if a form was filled out correctly, or any issues with a user's personal details, etc. The Admin user will be accessing all this information as the external User in order to replicate any issues and assist the user.",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Login System<\/strong> (Choose the login system, Joomla! core, K2 or ExtendedReg. If you select K2, note that the parameter 'Enable K2 User Profile' in K2 settings must be enabled).<\/li>\r\n\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Assign multiple Admins to specific User Groups<\/strong> (Choose the Admins who can use the LOGIN AS USER functionality for a specific User Group. <small>This feature added in v3.2.0<\/small>).<\/li>\r\n\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Inform Admin<\/strong> (Send a message to Admin, to inform that a user logged in from backend, through 'Login as User' plugin).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Admin's Email<\/strong> (Enter Admin's Email address. Example: info@yourdomain.com. If you leave this field blank, the default email from global configuration will be used).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>URL Redirect after login<\/strong> (Enter the URL that redirects the Admin in front-end, after a successfull login as a specific User).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Displayed Text<\/strong> (Enter your preferred displayed text. E.g. Login as %s »... or Login as User »... or Login as Client »... etc. Notice that the variable %s is equal with the Username of User).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Custom CSS Style<\/strong> (Enter your personal CSS style for the 'Login as User' text).<\/li>\r\n<\/ul>\r\n\r\n<h3 class=\"uk-h2 uk-text-center\">How it works? (Video)<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<p class=\"uk-text-center\" style=\"max-width:640px; margin:0 auto;\"><iframe width=\"640\" height=\"480\" src=\"https:\/\/www.youtube.com\/embed\/WYrYz4aXKhA\" frameborder=\"0\" allowfullscreen><\/iframe><\/p>\r\n<!-- END: Features -->",
        "stable_version": "3.4.1",
        "beta_version": "",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n04-Sep-2020 : v3.4.1\r\n# [Bug Fixed] JoomGallery photos are not displayed properly after enabling the Login as a User plugin. [Thank you, Yanco M. Nilyus]\r\n\r\n20-Feb-2020 : v3.4.0\r\n+ [New parameter] URL Redirection type (after login as a User). Enter the URL, or choose a Menu Item that the Admin will be redirected, to the front-end, after a successful login as a specific User.\r\n+ [New parameter] Display the «Username» or «Name» on the button. You can now choose which string will be displayed on the \"Login as User\" button. For example \"Login as «john357»\" (Username), or \"Login as «Yiannis Christodoulou»\" (Name).\r\n+ [New parameter] Show only the first X characters of the «Username\/Name». Show only the first X characters of the Username\/Name, on the \"Login as...«Username\/Name»\" button. For example, if you choose the option 5 (the five first characters of the string), the button will be displayed as \"Login as «john3...»\"  if the username is \"john357\", or it will be displayed as \"Login as «Yiann...»\" if the name is \"Yiannis Christodoulou\".\r\n# Minor fixes and code improvements.\r\n\r\n23-Dec-2019 : v3.3.5\r\n# [Bug Fixed] When a User Group name has special characters in the title, like the French string \"Enregistré\", then there is a bug with the error message: \"An error has occurred. 500 String could not be parsed as XML.\" [Many thanks to Jean Machuron]\r\n\r\n09-Dec-2019 : v3.3.4\r\n^ [Improvement] You are able to translate the \"Login as User\" column, by set a value to the constant \"COM_LOGINASUSER\". [Thank you, Milan]\r\n\r\n14-Jun-2019 : v3.3.3\r\n# [Bug Fixed] If a usergroup's name has special characters like the (&) symbol, an error message is displayed: (500 String could not be parsed as XML) and the Admins cannot view and edit the plugin parameters. [Many thanks to Simon Logan]\r\n\r\n10-Apr-2019 : v3.3.2\r\n# [Bug Fixed] There was a PHP max_execution_time error (30sec). This only affects MySQL databases where the #__users table exceeds the 100.000 users. [Thank you, Mike]\r\n\r\n12-Dec-2018 : v3.3.1\r\n# [Bug Fixed] Error after upgrading to Joomla! 3.9.x. 404 View not found [name, type, prefix]: users, html, loginasuserView. [Thank you, Serge]\r\n^ Minor Improvements\r\n\r\n09-Aug-2018 : v3.3.0\r\n+ Fully compatible with Joomla! 4.x\r\n+ Compatible with the latest version of Web357 Framework v1.7.x\r\n^ Code Cleanup.\r\n# Minor bug fixes and many improvements.\r\n\r\n16-Mar-2018 : v3.2.1\r\n# BUG FIXED: Notice: Undefined variable: is_enabled_arr in \/administrator\/components\/com_loginasuser\/views\/users\/tmpl\/default.php on line 102\r\n# BUG FIXED: Warning: array_sum() expects parameter 1 to be array, null given in \/administrator\/components\/com_loginasuser\/views\/users\/tmpl\/default.php on line 102\r\n^ The Demo and the JED link have been updated in the description tab, at Joomla! backend.\r\n! The Web357 Download ID parameter field has been deleted from each extension settings and has been replaced by a unique API key parameter field at the Web357 Framework plugin settings.\r\n+ A new button (Settings) has been added to the description tab at Joomla! backend.\r\n^ Compatible with the latest version (1.6.0) of Web357 framework plugin.\r\n\r\n15-Dec-2017 : v3.2.0\r\n# NEW FEATURE: Assign multiple Admins to specific User Groups. Choose the Admins who can use the LOGIN AS USER functionality for a specific User Group. Leave the field blank if you want to allow every Admin to log in as any user in this user group. [Many thanks to Gerry, for his suggestion] \r\n# The login as user plugin works properly in Joomla! 2.5.x but the above new feature is not working.\r\n# The core files from com_user have been replaced with the latest version of Joomla! 3.8.x series.\r\n# Minor bug fixes and many improvements.\r\n\r\n08-Oct-2017 : v3.1.3\r\n# Compatible with Easy Profile extension package by easy-profile.com. [Many thanks to Jean Marc Niklaus]\r\n\r\n05-Jul-2017 : v3.1.2\r\n# Bug fixed after upgrade to J! 3.7.3. The admins can't enter text in the form fields from the plugin parameters.\r\n# Web357 framework has been updated to the version 1.4.5.\r\n\r\n13-May-2017 : v3.1.1\r\n+ Compatibility for auto-updates via Watchful.li external service. [Many thanks to Valentin Barbu, Rafael Gaus, and Frank].\r\n+ Compatible with the latest version of Web357 Framework v1.4.3.\r\n^ If the JED link does not exist yet, do not display the 'leave a review' text inside the plugin parameters.\r\n\r\n26-Apr-2017 : v3.1.0\r\n+ Compatibility with Joomla! 3.7\r\n! End of support Joomla! 2.5.x. Note that the version 3.1+ of Login as User is not available anymore for Joomla! 2.5 series. DO NOT install this version if your Joomla! is not up to date, at least to the latest series of Joomla!.\r\n# Minor bug fixes after upgrade to Joomla! 3.7\r\n\r\n08-Dec-2016 : v3.0.6\r\n+ The [nl-NL] Dutch (Belgium) language has been added (Many thanks to Henk Gordebeke for his contribution).\r\n\r\n29-Jun-2016 : v3.0.5\r\n# BUG Fixed: The \"Download ID\" is missing from the plugin parameters, but exists in the component parameters. You can now enter your download ID, in the component parameters, either in the plugin parameters. Each one submission, or both of them, are correct.\r\n\r\n12-May-2016 : v3.0.4\r\n# BUG Fixed: The error messages about the download ID, during the update of other Web357 extensions, have been resolved and have been removed.\r\n# BUG Fixed: If the sh404sef extension is installed on your website, the URL redirections after login as a user redirects you to a 404 error page.\r\n\r\n14-Apr-2016 : v3.0.3\r\n# Bug Fixed: An error 404 (0 - Invalid address) is displayed after upgrading to Joomla! 3.5.1, after clicking on the link \"Login as _username_\". [Thank you, Lisa Keyser]\r\n\r\n08-Dec-2015 : v3.0.2\r\n# Minor bug fixes after the latest upgrade from v3.0.1\r\n\r\n07-Dec-2015 : v3.0.1\r\n^ Updated description.\r\n^ Updated translations.\r\n\r\n18-Nov-2015 : v3.0.0\r\n+ ACL supported. \r\n# Bug fixed: 500 Error. The function onAfterInitialise() is changed to onAfterDispatch(). \r\n^ Managers and Admins are not authorized to log in as Super User. \r\n+ NEW Parameter Field: Custom CSS style. You can add your personal CSS style. Find the classes by right click on the text, and then inspect element (browser option). \r\n+ NEW Parameter Field: Displayed text. You can change the \"Login as User\" text. \r\n+ Compatible with 'ExtendedReg' Joomla! Plugin, of jVitals Team. \r\n# Minor bug fixes and clean up some code. \r\n\r\n13-Nov-2015 : v2.1.4\r\n+ NEW Parameter Field: Download ID. You need to specify your Download ID before you can receive updates for the PRO versions. For more information please follow our instructions here: https:\/\/www.web357.com\/apikey\r\n# Minor bug fixes.\r\n\r\n30-Oct-2015 : v2.1.3\r\n# BUG Fixed: Fatal error: Class 'JControllerAdmin' not found in \\administrator\\components\\com_loginasuser\\controllers\\users.php on line 30\r\n\r\n19-Aug-2015 : v2.1.2\r\n+ New Parameter: Choose the login system, Joomla! core or K2. If you select K2, note that the parameter 'Enable K2 User Profile' in K2 settings must be enabled. The default option is 'Joomla'.\r\n\r\n26-May-2015 : v2.1.1\r\n# Warning and Notice messages do not display anymore.\r\n\r\n18-May-2015 : v2.1.0\r\n+ Component has been added.\r\n\r\n23-Apr-2015 : v2.0.0\r\n+ Compatible with \"Web357Framework\" (Joomla! system plugin).\r\n^ Improvement design for parameter fields (better radio buttons and color pickers).\r\n+ ADMIN: New Element: Description of extension (buttons: view demo, more details, changelog, support).\r\n+ ADMIN: New Element: Version Check.\r\n+ ADMIN: New Element: About Web357 (logo, description, find us on social media).\r\n# General minor fixes.\r\n# Clean and code improvement.\r\n\r\n24-Mar-2015 : v1.1.0\r\n# BUG Fixed: \"JFile: :copy:\" in Joomla! 3.4.1.\r\n+ New parameter field: \"Admin's Email\".\r\n+ New parameter field: \"URL Redirect after Login\".\r\n^ After plugin installation redirects you on Users Manager page.\r\n+ CSS added in Users Manager page to give a style to the \"Login as User\" phrase.\r\n^ The head link \"Login as User\" in Users Manager page, has now a sort order link.\r\n\t\t\r\n27-Nov-2014 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2020-09-04",
        "extension_type": "Component",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/login-as-user",
        "more_info_url": "https:\/\/www.web357.com\/product\/login-as-user-joomla-component",
        "documentation_url": "https:\/\/docs.web357.com\/category\/40-login-as-user",
        "changelog_url": "https:\/\/www.web357.com\/product\/login-as-user-joomla-component#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extension\/login-as-user",
        "backend_settings_url": ".\/index.php?option=com_plugins&view=plugins&filter[search]=System%20-%20Login%20as%20User"
    },
    "wwwredirect": {
        "name": "wwwredirect",
        "real_name": "www Redirect",
        "product_type": "free",
        "description": "With this tiny Joomla! System Plugin you can redirect all of the requests from non-www to www, or from www to non-www. (Example: from http:\/\/yourdomain.com to http:\/\/www.yourdomain.com, or from http:\/\/www.yourdomain.com to http:\/\/yourdomain.com).",
        "description_features": "<!-- BEGIN: Features -->\r\n<h3 class=\"uk-h2 uk-text-center\">Basic Features<\/h3><hr class=\"uk-grid-divider\" style=\"width:90px;margin:0 auto;\">\r\n<ul class=\"uk-list uk-list-striped\">\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Fixing non-www Redirection in Joomla!:<\/strong> (non-www → www, or www → non-www).<\/li>\r\n  <li><i class=\"uk-icon-thumbs-o-up\"><\/i> <strong>Force site access with or without HTTPS.<\/strong> (HTTP → HTTP[s], or HTTP[s] → HTTP). With this feature, you can pass the \"Avoid landing page redirects.\" of GTMetrix service.<\/li>\r\n<\/ul>\r\n<!-- END: Features -->\r\n",
        "stable_version": "1.2.1",
        "beta_version": "1.2.2",
        "changelog": "+ Added   ! Removed   ^ Changed   # Fixed\r\n\r\n23-Apr-2019 : v1.2.1\r\n^ [Improvement] Disable the redirect functionality for local servers (e.g. 127.0.0.1, ::1, localhost).\r\n\r\n01-Sep-2018 : v1.2.0\r\n+ [New Parameter] \"Force site access with or without HTTPS. Options: 1) From HTTP → HTTP[s] and 2) From HTTP[s] → HTTP. With this feature, you can pass the \"Avoid landing page redirects.\" of GTMetrix service.\r\n\r\n08-Aug-2018 : v1.1.0\r\n+ Compatible with Joomla! 4.x\r\n\r\n19-Apr-2018 : v1.0.0\r\n+ First beta release",
        "project_type": "web357",
        "date": "2019-04-23",
        "extension_type": "Plugin",
        "live_demo_url": "https:\/\/demo.web357.com\/joomla\/www-redirect",
        "more_info_url": "https:\/\/www.web357.com\/product\/www-redirect-joomla-plugin",
        "documentation_url": "https:\/\/docs.web357.com\/category\/49-virtuemart-count-products",
        "changelog_url": "https:\/\/www.web357.com\/product\/www-redirect-joomla-plugin#changelog",
        "support_url": "https:\/\/www.web357.com\/support",
        "jed_url": "https:\/\/extensions.joomla.org\/extensions\/extension\/site-management\/url-redirection\/www-redirect\/",
        "backend_settings_url": ".\/index.php?option=com_plugins&view=plugins&filter[search]=System%20-%20Web357%20www%20Redirect"
    }
}